MikroElektronika/core_packages/PIC/XC8/def/PIC16F1778/mcu.h
// Register: PIE4
#define PIE4 PIE4
extern volatile unsigned char           PIE4                __at(0x094);
#ifndef _LIB_BUILD
asm("PIE4 equ 094h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR4IE                 :1;
        unsigned TMR6IE                 :1;
        unsigned TMR3IE                 :1;
        unsigned TMR3GIE                :1;
        unsigned TMR5IE                 :1;
        unsigned TMR5GIE                :1;
        unsigned TMR8IE                 :1;
    };
} PIE4bits_t;
extern volatile PIE4bits_t PIE4bits __at(0x094);
// bitfield macros
#define _PIE4_TMR4IE_POSN                                   0x0
#define _PIE4_TMR4IE_POSITION                               0x0
#define _PIE4_TMR4IE_SIZE                                   0x1
#define _PIE4_TMR4IE_LENGTH                                 0x1
#define _PIE4_TMR4IE_MASK                                   0x1
#define _PIE4_TMR6IE_POSN                                   0x1
#define _PIE4_TMR6IE_POSITION                               0x1
#define _PIE4_TMR6IE_SIZE                                   0x1
#define _PIE4_TMR6IE_LENGTH                                 0x1
#define _PIE4_TMR6IE_MASK                                   0x2
#define _PIE4_TMR3IE_POSN                                   0x2
#define _PIE4_TMR3IE_POSITION                               0x2
#define _PIE4_TMR3IE_SIZE                                   0x1
#define _PIE4_TMR3IE_LENGTH                                 0x1
#define _PIE4_TMR3IE_MASK                                   0x4
#define _PIE4_TMR3GIE_POSN                                  0x3
#define _PIE4_TMR3GIE_POSITION                              0x3
#define _PIE4_TMR3GIE_SIZE                                  0x1
#define _PIE4_TMR3GIE_LENGTH                                0x1
#define _PIE4_TMR3GIE_MASK                                  0x8
#define _PIE4_TMR5IE_POSN                                   0x4
#define _PIE4_TMR5IE_POSITION                               0x4
#define _PIE4_TMR5IE_SIZE                                   0x1
#define _PIE4_TMR5IE_LENGTH                                 0x1
#define _PIE4_TMR5IE_MASK                                   0x10
#define _PIE4_TMR5GIE_POSN                                  0x5
#define _PIE4_TMR5GIE_POSITION                              0x5
#define _PIE4_TMR5GIE_SIZE                                  0x1
#define _PIE4_TMR5GIE_LENGTH                                0x1
#define _PIE4_TMR5GIE_MASK                                  0x20
#define _PIE4_TMR8IE_POSN                                   0x6
#define _PIE4_TMR8IE_POSITION                               0x6
#define _PIE4_TMR8IE_SIZE                                   0x1
#define _PIE4_TMR8IE_LENGTH                                 0x1
#define _PIE4_TMR8IE_MASK                                   0x40

// Register: PIE5
#define PIE5 PIE5
extern volatile unsigned char           PIE5                __at(0x095);
#ifndef _LIB_BUILD
asm("PIE5 equ 095h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C5IE                   :1;
        unsigned C6IE                   :1;
        unsigned                        :2;
        unsigned COG3IE                 :1;
        unsigned                        :1;
        unsigned CCP7IE                 :1;
    };
} PIE5bits_t;
extern volatile PIE5bits_t PIE5bits __at(0x095);
// bitfield macros
#define _PIE5_C5IE_POSN                                     0x0
#define _PIE5_C5IE_POSITION                                 0x0
#define _PIE5_C5IE_SIZE                                     0x1
#define _PIE5_C5IE_LENGTH                                   0x1
#define _PIE5_C5IE_MASK                                     0x1
#define _PIE5_C6IE_POSN                                     0x1
#define _PIE5_C6IE_POSITION                                 0x1
#define _PIE5_C6IE_SIZE                                     0x1
#define _PIE5_C6IE_LENGTH                                   0x1
#define _PIE5_C6IE_MASK                                     0x2
#define _PIE5_COG3IE_POSN                                   0x4
#define _PIE5_COG3IE_POSITION                               0x4
#define _PIE5_COG3IE_SIZE                                   0x1
#define _PIE5_COG3IE_LENGTH                                 0x1
#define _PIE5_COG3IE_MASK                                   0x10
#define _PIE5_CCP7IE_POSN                                   0x6
#define _PIE5_CCP7IE_POSITION                               0x6
#define _PIE5_CCP7IE_SIZE                                   0x1
#define _PIE5_CCP7IE_LENGTH                                 0x1
#define _PIE5_CCP7IE_MASK                                   0x40

// Register: PIE6
#define PIE6 PIE6
extern volatile unsigned char           PIE6                __at(0x096);
#ifndef _LIB_BUILD
asm("PIE6 equ 096h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM5IE                 :1;
        unsigned PWM6IE                 :1;
        unsigned PWM11IE                :1;
    };
} PIE6bits_t;
extern volatile PIE6bits_t PIE6bits __at(0x096);
// bitfield macros
#define _PIE6_PWM5IE_POSN                                   0x0
#define _PIE6_PWM5IE_POSITION                               0x0
#define _PIE6_PWM5IE_SIZE                                   0x1
#define _PIE6_PWM5IE_LENGTH                                 0x1
#define _PIE6_PWM5IE_MASK                                   0x1
#define _PIE6_PWM6IE_POSN                                   0x1
#define _PIE6_PWM6IE_POSITION                               0x1
#define _PIE6_PWM6IE_SIZE                                   0x1
#define _PIE6_PWM6IE_LENGTH                                 0x1
#define _PIE6_PWM6IE_MASK                                   0x2
#define _PIE6_PWM11IE_POSN                                  0x2
#define _PIE6_PWM11IE_POSITION                              0x2
#define _PIE6_PWM11IE_SIZE                                  0x1
#define _PIE6_PWM11IE_LENGTH                                0x1
#define _PIE6_PWM11IE_MASK                                  0x4

// Register: OPTION_REG
#define OPTION_REG OPTION_REG
extern volatile unsigned char           OPTION_REG          __at(0x097);
#ifndef _LIB_BUILD
asm("OPTION_REG equ 097h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PS                     :3;
        unsigned PSA                    :1;
        unsigned TMR0SE                 :1;
        unsigned TMR0CS                 :1;
        unsigned INTEDG                 :1;
        unsigned nWPUEN                 :1;
    };
    struct {
        unsigned _PS0                    :1;  // Note: Changed by MikroE
        unsigned _PS1                    :1;  // Note: Changed by MikroE
        unsigned _PS2                    :1;  // Note: Changed by MikroE
        unsigned                        :1;
        unsigned T0SE                   :1;
        unsigned T0CS                   :1;
    };
} OPTION_REGbits_t;
extern volatile OPTION_REGbits_t OPTION_REGbits __at(0x097);
// bitfield macros
#define _OPTION_REG_PS_POSN                                 0x0
#define _OPTION_REG_PS_POSITION                             0x0
#define _OPTION_REG_PS_SIZE                                 0x3
#define _OPTION_REG_PS_LENGTH                               0x3
#define _OPTION_REG_PS_MASK                                 0x7
#define _OPTION_REG_PSA_POSN                                0x3
#define _OPTION_REG_PSA_POSITION                            0x3
#define _OPTION_REG_PSA_SIZE                                0x1
#define _OPTION_REG_PSA_LENGTH                              0x1
#define _OPTION_REG_PSA_MASK                                0x8
#define _OPTION_REG_TMR0SE_POSN                             0x4
#define _OPTION_REG_TMR0SE_POSITION                         0x4
#define _OPTION_REG_TMR0SE_SIZE                             0x1
#define _OPTION_REG_TMR0SE_LENGTH                           0x1
#define _OPTION_REG_TMR0SE_MASK                             0x10
#define _OPTION_REG_TMR0CS_POSN                             0x5
#define _OPTION_REG_TMR0CS_POSITION                         0x5
#define _OPTION_REG_TMR0CS_SIZE                             0x1
#define _OPTION_REG_TMR0CS_LENGTH                           0x1
#define _OPTION_REG_TMR0CS_MASK                             0x20
#define _OPTION_REG_INTEDG_POSN                             0x6
#define _OPTION_REG_INTEDG_POSITION                         0x6
#define _OPTION_REG_INTEDG_SIZE                             0x1
#define _OPTION_REG_INTEDG_LENGTH                           0x1
#define _OPTION_REG_INTEDG_MASK                             0x40
#define _OPTION_REG_nWPUEN_POSN                             0x7
#define _OPTION_REG_nWPUEN_POSITION                         0x7
#define _OPTION_REG_nWPUEN_SIZE                             0x1
#define _OPTION_REG_nWPUEN_LENGTH                           0x1
#define _OPTION_REG_nWPUEN_MASK                             0x80
#define _OPTION_REG_PS0_POSN                                0x0
#define _OPTION_REG_PS0_POSITION                            0x0
#define _OPTION_REG_PS0_SIZE                                0x1
#define _OPTION_REG_PS0_LENGTH                              0x1
#define _OPTION_REG_PS0_MASK                                0x1
#define _OPTION_REG_PS1_POSN                                0x1
#define _OPTION_REG_PS1_POSITION                            0x1
#define _OPTION_REG_PS1_SIZE                                0x1
#define _OPTION_REG_PS1_LENGTH                              0x1
#define _OPTION_REG_PS1_MASK                                0x2
#define _OPTION_REG_PS2_POSN                                0x2
#define _OPTION_REG_PS2_POSITION                            0x2
#define _OPTION_REG_PS2_SIZE                                0x1
#define _OPTION_REG_PS2_LENGTH                              0x1
#define _OPTION_REG_PS2_MASK                                0x4
#define _OPTION_REG_T0SE_POSN                               0x4
#define _OPTION_REG_T0SE_POSITION                           0x4
#define _OPTION_REG_T0SE_SIZE                               0x1
#define _OPTION_REG_T0SE_LENGTH                             0x1
#define _OPTION_REG_T0SE_MASK                               0x10
#define _OPTION_REG_T0CS_POSN                               0x5
#define _OPTION_REG_T0CS_POSITION                           0x5
#define _OPTION_REG_T0CS_SIZE                               0x1
#define _OPTION_REG_T0CS_LENGTH                             0x1
#define _OPTION_REG_T0CS_MASK                               0x20

// Register: PCON
#define PCON PCON
extern volatile unsigned char           PCON                __at(0x098);
#ifndef _LIB_BUILD
asm("PCON equ 098h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned nBOR                   :1;
        unsigned nPOR                   :1;
        unsigned nRI                    :1;
        unsigned nRMCLR                 :1;
        unsigned nRWDT                  :1;
        unsigned                        :1;
        unsigned STKUNF                 :1;
        unsigned STKOVF                 :1;
    };
} PCONbits_t;
