MikroElektronika/core_packages/PIC/XC8/def/PIC16F1778/mcu.h
extern volatile DAC4CON1bits_t DAC4CON1bits __at(0x597);
// bitfield macros
#define _DAC4CON1_DACR_POSN                                 0x0
#define _DAC4CON1_DACR_POSITION                             0x0
#define _DAC4CON1_DACR_SIZE                                 0x5
#define _DAC4CON1_DACR_LENGTH                               0x5
#define _DAC4CON1_DACR_MASK                                 0x1F
#define _DAC4CON1_DACR0_POSN                                0x0
#define _DAC4CON1_DACR0_POSITION                            0x0
#define _DAC4CON1_DACR0_SIZE                                0x1
#define _DAC4CON1_DACR0_LENGTH                              0x1
#define _DAC4CON1_DACR0_MASK                                0x1
#define _DAC4CON1_DACR1_POSN                                0x1
#define _DAC4CON1_DACR1_POSITION                            0x1
#define _DAC4CON1_DACR1_SIZE                                0x1
#define _DAC4CON1_DACR1_LENGTH                              0x1
#define _DAC4CON1_DACR1_MASK                                0x2
#define _DAC4CON1_DACR2_POSN                                0x2
#define _DAC4CON1_DACR2_POSITION                            0x2
#define _DAC4CON1_DACR2_SIZE                                0x1
#define _DAC4CON1_DACR2_LENGTH                              0x1
#define _DAC4CON1_DACR2_MASK                                0x4
#define _DAC4CON1_DACR3_POSN                                0x3
#define _DAC4CON1_DACR3_POSITION                            0x3
#define _DAC4CON1_DACR3_SIZE                                0x1
#define _DAC4CON1_DACR3_LENGTH                              0x1
#define _DAC4CON1_DACR3_MASK                                0x8
#define _DAC4CON1_DACR4_POSN                                0x4
#define _DAC4CON1_DACR4_POSITION                            0x4
#define _DAC4CON1_DACR4_SIZE                                0x1
#define _DAC4CON1_DACR4_LENGTH                              0x1
#define _DAC4CON1_DACR4_MASK                                0x10
#define _DAC4CON1_R0_POSN                                   0x0
#define _DAC4CON1_R0_POSITION                               0x0
#define _DAC4CON1_R0_SIZE                                   0x1
#define _DAC4CON1_R0_LENGTH                                 0x1
#define _DAC4CON1_R0_MASK                                   0x1
#define _DAC4CON1_R1_POSN                                   0x1
#define _DAC4CON1_R1_POSITION                               0x1
#define _DAC4CON1_R1_SIZE                                   0x1
#define _DAC4CON1_R1_LENGTH                                 0x1
#define _DAC4CON1_R1_MASK                                   0x2
#define _DAC4CON1_R2_POSN                                   0x2
#define _DAC4CON1_R2_POSITION                               0x2
#define _DAC4CON1_R2_SIZE                                   0x1
#define _DAC4CON1_R2_LENGTH                                 0x1
#define _DAC4CON1_R2_MASK                                   0x4
#define _DAC4CON1_R3_POSN                                   0x3
#define _DAC4CON1_R3_POSITION                               0x3
#define _DAC4CON1_R3_SIZE                                   0x1
#define _DAC4CON1_R3_LENGTH                                 0x1
#define _DAC4CON1_R3_MASK                                   0x8
#define _DAC4CON1_R4_POSN                                   0x4
#define _DAC4CON1_R4_POSITION                               0x4
#define _DAC4CON1_R4_SIZE                                   0x1
#define _DAC4CON1_R4_LENGTH                                 0x1
#define _DAC4CON1_R4_MASK                                   0x10
#define _DAC4CON1_DAC4R_POSN                                0x0
#define _DAC4CON1_DAC4R_POSITION                            0x0
#define _DAC4CON1_DAC4R_SIZE                                0x5
#define _DAC4CON1_DAC4R_LENGTH                              0x5
#define _DAC4CON1_DAC4R_MASK                                0x1F
#define _DAC4CON1_DAC4R0_POSN                               0x0
#define _DAC4CON1_DAC4R0_POSITION                           0x0
#define _DAC4CON1_DAC4R0_SIZE                               0x1
#define _DAC4CON1_DAC4R0_LENGTH                             0x1
#define _DAC4CON1_DAC4R0_MASK                               0x1
#define _DAC4CON1_DAC4R1_POSN                               0x1
#define _DAC4CON1_DAC4R1_POSITION                           0x1
#define _DAC4CON1_DAC4R1_SIZE                               0x1
#define _DAC4CON1_DAC4R1_LENGTH                             0x1
#define _DAC4CON1_DAC4R1_MASK                               0x2
#define _DAC4CON1_DAC4R2_POSN                               0x2
#define _DAC4CON1_DAC4R2_POSITION                           0x2
#define _DAC4CON1_DAC4R2_SIZE                               0x1
#define _DAC4CON1_DAC4R2_LENGTH                             0x1
#define _DAC4CON1_DAC4R2_MASK                               0x4
#define _DAC4CON1_DAC4R3_POSN                               0x3
#define _DAC4CON1_DAC4R3_POSITION                           0x3
#define _DAC4CON1_DAC4R3_SIZE                               0x1
#define _DAC4CON1_DAC4R3_LENGTH                             0x1
#define _DAC4CON1_DAC4R3_MASK                               0x8
#define _DAC4CON1_DAC4R4_POSN                               0x4
#define _DAC4CON1_DAC4R4_POSITION                           0x4
#define _DAC4CON1_DAC4R4_SIZE                               0x1
#define _DAC4CON1_DAC4R4_LENGTH                             0x1
#define _DAC4CON1_DAC4R4_MASK                               0x10
#define _DAC4CON1_REF0_POSN                                 0x0
#define _DAC4CON1_REF0_POSITION                             0x0
#define _DAC4CON1_REF0_SIZE                                 0x1
#define _DAC4CON1_REF0_LENGTH                               0x1
#define _DAC4CON1_REF0_MASK                                 0x1
#define _DAC4CON1_REF1_POSN                                 0x1
#define _DAC4CON1_REF1_POSITION                             0x1
#define _DAC4CON1_REF1_SIZE                                 0x1
#define _DAC4CON1_REF1_LENGTH                               0x1
#define _DAC4CON1_REF1_MASK                                 0x2
#define _DAC4CON1_REF2_POSN                                 0x2
#define _DAC4CON1_REF2_POSITION                             0x2
#define _DAC4CON1_REF2_SIZE                                 0x1
#define _DAC4CON1_REF2_LENGTH                               0x1
#define _DAC4CON1_REF2_MASK                                 0x4
#define _DAC4CON1_REF3_POSN                                 0x3
#define _DAC4CON1_REF3_POSITION                             0x3
#define _DAC4CON1_REF3_SIZE                                 0x1
#define _DAC4CON1_REF3_LENGTH                               0x1
#define _DAC4CON1_REF3_MASK                                 0x8
#define _DAC4CON1_REF4_POSN                                 0x4
#define _DAC4CON1_REF4_POSITION                             0x4
#define _DAC4CON1_REF4_SIZE                                 0x1
#define _DAC4CON1_REF4_LENGTH                               0x1
#define _DAC4CON1_REF4_MASK                                 0x10
#define _DAC4CON1_DAC4REF0_POSN                             0x0
#define _DAC4CON1_DAC4REF0_POSITION                         0x0
#define _DAC4CON1_DAC4REF0_SIZE                             0x1
#define _DAC4CON1_DAC4REF0_LENGTH                           0x1
#define _DAC4CON1_DAC4REF0_MASK                             0x1
#define _DAC4CON1_DAC4REF1_POSN                             0x1
#define _DAC4CON1_DAC4REF1_POSITION                         0x1
#define _DAC4CON1_DAC4REF1_SIZE                             0x1
#define _DAC4CON1_DAC4REF1_LENGTH                           0x1
#define _DAC4CON1_DAC4REF1_MASK                             0x2
#define _DAC4CON1_DAC4REF2_POSN                             0x2
#define _DAC4CON1_DAC4REF2_POSITION                         0x2
#define _DAC4CON1_DAC4REF2_SIZE                             0x1
#define _DAC4CON1_DAC4REF2_LENGTH                           0x1
#define _DAC4CON1_DAC4REF2_MASK                             0x4
#define _DAC4CON1_DAC4REF3_POSN                             0x3
#define _DAC4CON1_DAC4REF3_POSITION                         0x3
#define _DAC4CON1_DAC4REF3_SIZE                             0x1
#define _DAC4CON1_DAC4REF3_LENGTH                           0x1
#define _DAC4CON1_DAC4REF3_MASK                             0x8
#define _DAC4CON1_DAC4REF4_POSN                             0x4
#define _DAC4CON1_DAC4REF4_POSITION                         0x4
#define _DAC4CON1_DAC4REF4_SIZE                             0x1
#define _DAC4CON1_DAC4REF4_LENGTH                           0x1
#define _DAC4CON1_DAC4REF4_MASK                             0x10

// Register: DAC5CON0
#define DAC5CON0 DAC5CON0
extern volatile unsigned char           DAC5CON0            __at(0x598);
#ifndef _LIB_BUILD
asm("DAC5CON0 equ 0598h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :2;
        unsigned PSS                    :2;
        unsigned OE2                    :1;
        unsigned OE1                    :1;
        unsigned FM                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned NSS0                   :1;
        unsigned NSS1                   :1;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
        unsigned                        :1;
        unsigned OE                     :1;
    };
    struct {
        unsigned DACNSS                 :2;
        unsigned DACPSS                 :2;
        unsigned DACOE2                 :1;
        unsigned DACOE1                 :1;
        unsigned DACFM                  :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned DACNSS0                :1;
        unsigned DACNSS1                :1;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
        unsigned                        :1;
        unsigned DACOE                  :1;
    };
    struct {
        unsigned DAC5NSS                :2;
        unsigned DAC5PSS                :2;
        unsigned DAC5OE2                :1;
        unsigned DAC5OE1                :1;
        unsigned DAC5FM                 :1;
        unsigned DAC5EN                 :1;
    };
    struct {
        unsigned DAC5NSS0               :1;
        unsigned DAC5NSS1               :1;
        unsigned DAC5PSS0               :1;
        unsigned DAC5PSS1               :1;
    };
} DAC5CON0bits_t;
extern volatile DAC5CON0bits_t DAC5CON0bits __at(0x598);
// bitfield macros
#define _DAC5CON0_NSS_POSN                                  0x0
#define _DAC5CON0_NSS_POSITION                              0x0
#define _DAC5CON0_NSS_SIZE                                  0x2
#define _DAC5CON0_NSS_LENGTH                                0x2
#define _DAC5CON0_NSS_MASK                                  0x3
#define _DAC5CON0_PSS_POSN                                  0x2
#define _DAC5CON0_PSS_POSITION                              0x2
#define _DAC5CON0_PSS_SIZE                                  0x2
#define _DAC5CON0_PSS_LENGTH                                0x2
#define _DAC5CON0_PSS_MASK                                  0xC
#define _DAC5CON0_OE2_POSN                                  0x4
#define _DAC5CON0_OE2_POSITION                              0x4
#define _DAC5CON0_OE2_SIZE                                  0x1
#define _DAC5CON0_OE2_LENGTH                                0x1
#define _DAC5CON0_OE2_MASK                                  0x10
#define _DAC5CON0_OE1_POSN                                  0x5
#define _DAC5CON0_OE1_POSITION                              0x5
#define _DAC5CON0_OE1_SIZE                                  0x1
#define _DAC5CON0_OE1_LENGTH                                0x1
#define _DAC5CON0_OE1_MASK                                  0x20
#define _DAC5CON0_FM_POSN                                   0x6
#define _DAC5CON0_FM_POSITION                               0x6
#define _DAC5CON0_FM_SIZE                                   0x1
#define _DAC5CON0_FM_LENGTH                                 0x1
#define _DAC5CON0_FM_MASK                                   0x40
#define _DAC5CON0_EN_POSN                                   0x7
#define _DAC5CON0_EN_POSITION                               0x7
#define _DAC5CON0_EN_SIZE                                   0x1
#define _DAC5CON0_EN_LENGTH                                 0x1
#define _DAC5CON0_EN_MASK                                   0x80
#define _DAC5CON0_NSS0_POSN                                 0x0
#define _DAC5CON0_NSS0_POSITION                             0x0
#define _DAC5CON0_NSS0_SIZE                                 0x1
#define _DAC5CON0_NSS0_LENGTH                               0x1
#define _DAC5CON0_NSS0_MASK                                 0x1
#define _DAC5CON0_NSS1_POSN                                 0x1
#define _DAC5CON0_NSS1_POSITION                             0x1
#define _DAC5CON0_NSS1_SIZE                                 0x1
#define _DAC5CON0_NSS1_LENGTH                               0x1
#define _DAC5CON0_NSS1_MASK                                 0x2
#define _DAC5CON0_PSS0_POSN                                 0x2
#define _DAC5CON0_PSS0_POSITION                             0x2
#define _DAC5CON0_PSS0_SIZE                                 0x1
#define _DAC5CON0_PSS0_LENGTH                               0x1
#define _DAC5CON0_PSS0_MASK                                 0x4
#define _DAC5CON0_PSS1_POSN                                 0x3
#define _DAC5CON0_PSS1_POSITION                             0x3
#define _DAC5CON0_PSS1_SIZE                                 0x1
#define _DAC5CON0_PSS1_LENGTH                               0x1
#define _DAC5CON0_PSS1_MASK                                 0x8
#define _DAC5CON0_OE_POSN                                   0x5
#define _DAC5CON0_OE_POSITION                               0x5
#define _DAC5CON0_OE_SIZE                                   0x1
#define _DAC5CON0_OE_LENGTH                                 0x1
#define _DAC5CON0_OE_MASK                                   0x20
#define _DAC5CON0_DACNSS_POSN                               0x0
#define _DAC5CON0_DACNSS_POSITION                           0x0
#define _DAC5CON0_DACNSS_SIZE                               0x2
#define _DAC5CON0_DACNSS_LENGTH                             0x2
#define _DAC5CON0_DACNSS_MASK                               0x3
#define _DAC5CON0_DACPSS_POSN                               0x2
#define _DAC5CON0_DACPSS_POSITION                           0x2
#define _DAC5CON0_DACPSS_SIZE                               0x2
#define _DAC5CON0_DACPSS_LENGTH                             0x2
#define _DAC5CON0_DACPSS_MASK                               0xC
#define _DAC5CON0_DACOE2_POSN                               0x4
#define _DAC5CON0_DACOE2_POSITION                           0x4
#define _DAC5CON0_DACOE2_SIZE                               0x1
#define _DAC5CON0_DACOE2_LENGTH                             0x1
#define _DAC5CON0_DACOE2_MASK                               0x10
#define _DAC5CON0_DACOE1_POSN                               0x5
#define _DAC5CON0_DACOE1_POSITION                           0x5
#define _DAC5CON0_DACOE1_SIZE                               0x1
#define _DAC5CON0_DACOE1_LENGTH                             0x1
#define _DAC5CON0_DACOE1_MASK                               0x20
#define _DAC5CON0_DACFM_POSN                                0x6
#define _DAC5CON0_DACFM_POSITION                            0x6
#define _DAC5CON0_DACFM_SIZE                                0x1
#define _DAC5CON0_DACFM_LENGTH                              0x1
#define _DAC5CON0_DACFM_MASK                                0x40
#define _DAC5CON0_DACEN_POSN                                0x7
#define _DAC5CON0_DACEN_POSITION                            0x7
#define _DAC5CON0_DACEN_SIZE                                0x1
#define _DAC5CON0_DACEN_LENGTH                              0x1
#define _DAC5CON0_DACEN_MASK                                0x80
#define _DAC5CON0_DACNSS0_POSN                              0x0
#define _DAC5CON0_DACNSS0_POSITION                          0x0
#define _DAC5CON0_DACNSS0_SIZE                              0x1
#define _DAC5CON0_DACNSS0_LENGTH                            0x1
#define _DAC5CON0_DACNSS0_MASK                              0x1
#define _DAC5CON0_DACNSS1_POSN                              0x1
#define _DAC5CON0_DACNSS1_POSITION                          0x1
#define _DAC5CON0_DACNSS1_SIZE                              0x1
#define _DAC5CON0_DACNSS1_LENGTH                            0x1
#define _DAC5CON0_DACNSS1_MASK                              0x2
#define _DAC5CON0_DACPSS0_POSN                              0x2
#define _DAC5CON0_DACPSS0_POSITION                          0x2
#define _DAC5CON0_DACPSS0_SIZE                              0x1
#define _DAC5CON0_DACPSS0_LENGTH                            0x1
#define _DAC5CON0_DACPSS0_MASK                              0x4
#define _DAC5CON0_DACPSS1_POSN                              0x3
#define _DAC5CON0_DACPSS1_POSITION                          0x3
#define _DAC5CON0_DACPSS1_SIZE                              0x1
#define _DAC5CON0_DACPSS1_LENGTH                            0x1
#define _DAC5CON0_DACPSS1_MASK                              0x8
#define _DAC5CON0_DACOE_POSN                                0x5
#define _DAC5CON0_DACOE_POSITION                            0x5
#define _DAC5CON0_DACOE_SIZE                                0x1
#define _DAC5CON0_DACOE_LENGTH                              0x1
#define _DAC5CON0_DACOE_MASK                                0x20
#define _DAC5CON0_DAC5NSS_POSN                              0x0
#define _DAC5CON0_DAC5NSS_POSITION                          0x0
#define _DAC5CON0_DAC5NSS_SIZE                              0x2
#define _DAC5CON0_DAC5NSS_LENGTH                            0x2
#define _DAC5CON0_DAC5NSS_MASK                              0x3
#define _DAC5CON0_DAC5PSS_POSN                              0x2
#define _DAC5CON0_DAC5PSS_POSITION                          0x2
#define _DAC5CON0_DAC5PSS_SIZE                              0x2
#define _DAC5CON0_DAC5PSS_LENGTH                            0x2
#define _DAC5CON0_DAC5PSS_MASK                              0xC
#define _DAC5CON0_DAC5OE2_POSN                              0x4
#define _DAC5CON0_DAC5OE2_POSITION                          0x4
#define _DAC5CON0_DAC5OE2_SIZE                              0x1
#define _DAC5CON0_DAC5OE2_LENGTH                            0x1
#define _DAC5CON0_DAC5OE2_MASK                              0x10
#define _DAC5CON0_DAC5OE1_POSN                              0x5
#define _DAC5CON0_DAC5OE1_POSITION                          0x5
#define _DAC5CON0_DAC5OE1_SIZE                              0x1
#define _DAC5CON0_DAC5OE1_LENGTH                            0x1
#define _DAC5CON0_DAC5OE1_MASK                              0x20
#define _DAC5CON0_DAC5FM_POSN                               0x6
#define _DAC5CON0_DAC5FM_POSITION                           0x6
#define _DAC5CON0_DAC5FM_SIZE                               0x1
#define _DAC5CON0_DAC5FM_LENGTH                             0x1
#define _DAC5CON0_DAC5FM_MASK                               0x40
#define _DAC5CON0_DAC5EN_POSN                               0x7
#define _DAC5CON0_DAC5EN_POSITION                           0x7
#define _DAC5CON0_DAC5EN_SIZE                               0x1
#define _DAC5CON0_DAC5EN_LENGTH                             0x1
#define _DAC5CON0_DAC5EN_MASK                               0x80
#define _DAC5CON0_DAC5NSS0_POSN                             0x0
#define _DAC5CON0_DAC5NSS0_POSITION                         0x0
#define _DAC5CON0_DAC5NSS0_SIZE                             0x1
#define _DAC5CON0_DAC5NSS0_LENGTH                           0x1
#define _DAC5CON0_DAC5NSS0_MASK                             0x1
#define _DAC5CON0_DAC5NSS1_POSN                             0x1
#define _DAC5CON0_DAC5NSS1_POSITION                         0x1
#define _DAC5CON0_DAC5NSS1_SIZE                             0x1
#define _DAC5CON0_DAC5NSS1_LENGTH                           0x1
#define _DAC5CON0_DAC5NSS1_MASK                             0x2
#define _DAC5CON0_DAC5PSS0_POSN                             0x2
#define _DAC5CON0_DAC5PSS0_POSITION                         0x2
#define _DAC5CON0_DAC5PSS0_SIZE                             0x1
#define _DAC5CON0_DAC5PSS0_LENGTH                           0x1
#define _DAC5CON0_DAC5PSS0_MASK                             0x4
#define _DAC5CON0_DAC5PSS1_POSN                             0x3
#define _DAC5CON0_DAC5PSS1_POSITION                         0x3
#define _DAC5CON0_DAC5PSS1_SIZE                             0x1
#define _DAC5CON0_DAC5PSS1_LENGTH                           0x1
#define _DAC5CON0_DAC5PSS1_MASK                             0x8

