MikroElektronika/core_packages/PIC/XC8/def/PIC16F1778/mcu.h
// Register: COG1DBF
#define COG1DBF COG1DBF
extern volatile unsigned char           COG1DBF             __at(0x692);
#ifndef _LIB_BUILD
asm("COG1DBF equ 0692h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBF0                   :1;
        unsigned DBF1                   :1;
        unsigned DBF2                   :1;
        unsigned DBF3                   :1;
        unsigned DBF4                   :1;
        unsigned DBF5                   :1;
    };
    struct {
        unsigned G1DBF0                 :1;
        unsigned G1DBF1                 :1;
        unsigned G1DBF2                 :1;
        unsigned G1DBF3                 :1;
        unsigned G1DBF4                 :1;
        unsigned G1DBF5                 :1;
    };
    struct {
        unsigned G1DBF                  :6;
    };
} COG1DBFbits_t;
extern volatile COG1DBFbits_t COG1DBFbits __at(0x692);
// bitfield macros
#define _COG1DBF_DBF0_POSN                                  0x0
#define _COG1DBF_DBF0_POSITION                              0x0
#define _COG1DBF_DBF0_SIZE                                  0x1
#define _COG1DBF_DBF0_LENGTH                                0x1
#define _COG1DBF_DBF0_MASK                                  0x1
#define _COG1DBF_DBF1_POSN                                  0x1
#define _COG1DBF_DBF1_POSITION                              0x1
#define _COG1DBF_DBF1_SIZE                                  0x1
#define _COG1DBF_DBF1_LENGTH                                0x1
#define _COG1DBF_DBF1_MASK                                  0x2
#define _COG1DBF_DBF2_POSN                                  0x2
#define _COG1DBF_DBF2_POSITION                              0x2
#define _COG1DBF_DBF2_SIZE                                  0x1
#define _COG1DBF_DBF2_LENGTH                                0x1
#define _COG1DBF_DBF2_MASK                                  0x4
#define _COG1DBF_DBF3_POSN                                  0x3
#define _COG1DBF_DBF3_POSITION                              0x3
#define _COG1DBF_DBF3_SIZE                                  0x1
#define _COG1DBF_DBF3_LENGTH                                0x1
#define _COG1DBF_DBF3_MASK                                  0x8
#define _COG1DBF_DBF4_POSN                                  0x4
#define _COG1DBF_DBF4_POSITION                              0x4
#define _COG1DBF_DBF4_SIZE                                  0x1
#define _COG1DBF_DBF4_LENGTH                                0x1
#define _COG1DBF_DBF4_MASK                                  0x10
#define _COG1DBF_DBF5_POSN                                  0x5
#define _COG1DBF_DBF5_POSITION                              0x5
#define _COG1DBF_DBF5_SIZE                                  0x1
#define _COG1DBF_DBF5_LENGTH                                0x1
#define _COG1DBF_DBF5_MASK                                  0x20
#define _COG1DBF_G1DBF0_POSN                                0x0
#define _COG1DBF_G1DBF0_POSITION                            0x0
#define _COG1DBF_G1DBF0_SIZE                                0x1
#define _COG1DBF_G1DBF0_LENGTH                              0x1
#define _COG1DBF_G1DBF0_MASK                                0x1
#define _COG1DBF_G1DBF1_POSN                                0x1
#define _COG1DBF_G1DBF1_POSITION                            0x1
#define _COG1DBF_G1DBF1_SIZE                                0x1
#define _COG1DBF_G1DBF1_LENGTH                              0x1
#define _COG1DBF_G1DBF1_MASK                                0x2
#define _COG1DBF_G1DBF2_POSN                                0x2
#define _COG1DBF_G1DBF2_POSITION                            0x2
#define _COG1DBF_G1DBF2_SIZE                                0x1
#define _COG1DBF_G1DBF2_LENGTH                              0x1
#define _COG1DBF_G1DBF2_MASK                                0x4
#define _COG1DBF_G1DBF3_POSN                                0x3
#define _COG1DBF_G1DBF3_POSITION                            0x3
#define _COG1DBF_G1DBF3_SIZE                                0x1
#define _COG1DBF_G1DBF3_LENGTH                              0x1
#define _COG1DBF_G1DBF3_MASK                                0x8
#define _COG1DBF_G1DBF4_POSN                                0x4
#define _COG1DBF_G1DBF4_POSITION                            0x4
#define _COG1DBF_G1DBF4_SIZE                                0x1
#define _COG1DBF_G1DBF4_LENGTH                              0x1
#define _COG1DBF_G1DBF4_MASK                                0x10
#define _COG1DBF_G1DBF5_POSN                                0x5
#define _COG1DBF_G1DBF5_POSITION                            0x5
#define _COG1DBF_G1DBF5_SIZE                                0x1
#define _COG1DBF_G1DBF5_LENGTH                              0x1
#define _COG1DBF_G1DBF5_MASK                                0x20
#define _COG1DBF_G1DBF_POSN                                 0x0
#define _COG1DBF_G1DBF_POSITION                             0x0
#define _COG1DBF_G1DBF_SIZE                                 0x6
#define _COG1DBF_G1DBF_LENGTH                               0x6
#define _COG1DBF_G1DBF_MASK                                 0x3F

// Register: COG1CON0
#define COG1CON0 COG1CON0
extern volatile unsigned char           COG1CON0            __at(0x693);
#ifndef _LIB_BUILD
asm("COG1CON0 equ 0693h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD                     :3;
        unsigned CS                     :2;
        unsigned                        :1;
        unsigned LD                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MD0                    :1;
        unsigned MD1                    :1;
        unsigned MD2                    :1;
        unsigned CS0                    :1;
        unsigned CS1                    :1;
    };
    struct {
        unsigned G1MD                   :3;
        unsigned G1CS                   :2;
        unsigned                        :1;
        unsigned G1LD                   :1;
        unsigned G1EN                   :1;
    };
    struct {
        unsigned G1MD0                  :1;
        unsigned G1MD1                  :1;
        unsigned G1MD2                  :1;
        unsigned G1CS0                  :1;
        unsigned G1CS1                  :1;
    };
} COG1CON0bits_t;
extern volatile COG1CON0bits_t COG1CON0bits __at(0x693);
// bitfield macros
#define _COG1CON0_MD_POSN                                   0x0
#define _COG1CON0_MD_POSITION                               0x0
#define _COG1CON0_MD_SIZE                                   0x3
#define _COG1CON0_MD_LENGTH                                 0x3
#define _COG1CON0_MD_MASK                                   0x7
#define _COG1CON0_CS_POSN                                   0x3
#define _COG1CON0_CS_POSITION                               0x3
#define _COG1CON0_CS_SIZE                                   0x2
#define _COG1CON0_CS_LENGTH                                 0x2
#define _COG1CON0_CS_MASK                                   0x18
#define _COG1CON0_LD_POSN                                   0x6
#define _COG1CON0_LD_POSITION                               0x6
#define _COG1CON0_LD_SIZE                                   0x1
#define _COG1CON0_LD_LENGTH                                 0x1
#define _COG1CON0_LD_MASK                                   0x40
#define _COG1CON0_EN_POSN                                   0x7
#define _COG1CON0_EN_POSITION                               0x7
#define _COG1CON0_EN_SIZE                                   0x1
#define _COG1CON0_EN_LENGTH                                 0x1
#define _COG1CON0_EN_MASK                                   0x80
#define _COG1CON0_MD0_POSN                                  0x0
#define _COG1CON0_MD0_POSITION                              0x0
#define _COG1CON0_MD0_SIZE                                  0x1
#define _COG1CON0_MD0_LENGTH                                0x1
#define _COG1CON0_MD0_MASK                                  0x1
#define _COG1CON0_MD1_POSN                                  0x1
#define _COG1CON0_MD1_POSITION                              0x1
#define _COG1CON0_MD1_SIZE                                  0x1
#define _COG1CON0_MD1_LENGTH                                0x1
#define _COG1CON0_MD1_MASK                                  0x2
#define _COG1CON0_MD2_POSN                                  0x2
#define _COG1CON0_MD2_POSITION                              0x2
#define _COG1CON0_MD2_SIZE                                  0x1
#define _COG1CON0_MD2_LENGTH                                0x1
#define _COG1CON0_MD2_MASK                                  0x4
#define _COG1CON0_CS0_POSN                                  0x3
#define _COG1CON0_CS0_POSITION                              0x3
#define _COG1CON0_CS0_SIZE                                  0x1
#define _COG1CON0_CS0_LENGTH                                0x1
#define _COG1CON0_CS0_MASK                                  0x8
#define _COG1CON0_CS1_POSN                                  0x4
#define _COG1CON0_CS1_POSITION                              0x4
#define _COG1CON0_CS1_SIZE                                  0x1
#define _COG1CON0_CS1_LENGTH                                0x1
#define _COG1CON0_CS1_MASK                                  0x10
#define _COG1CON0_G1MD_POSN                                 0x0
#define _COG1CON0_G1MD_POSITION                             0x0
#define _COG1CON0_G1MD_SIZE                                 0x3
#define _COG1CON0_G1MD_LENGTH                               0x3
#define _COG1CON0_G1MD_MASK                                 0x7
#define _COG1CON0_G1CS_POSN                                 0x3
#define _COG1CON0_G1CS_POSITION                             0x3
#define _COG1CON0_G1CS_SIZE                                 0x2
#define _COG1CON0_G1CS_LENGTH                               0x2
#define _COG1CON0_G1CS_MASK                                 0x18
#define _COG1CON0_G1LD_POSN                                 0x6
#define _COG1CON0_G1LD_POSITION                             0x6
#define _COG1CON0_G1LD_SIZE                                 0x1
#define _COG1CON0_G1LD_LENGTH                               0x1
#define _COG1CON0_G1LD_MASK                                 0x40
#define _COG1CON0_G1EN_POSN                                 0x7
#define _COG1CON0_G1EN_POSITION                             0x7
#define _COG1CON0_G1EN_SIZE                                 0x1
#define _COG1CON0_G1EN_LENGTH                               0x1
#define _COG1CON0_G1EN_MASK                                 0x80
#define _COG1CON0_G1MD0_POSN                                0x0
#define _COG1CON0_G1MD0_POSITION                            0x0
#define _COG1CON0_G1MD0_SIZE                                0x1
#define _COG1CON0_G1MD0_LENGTH                              0x1
#define _COG1CON0_G1MD0_MASK                                0x1
#define _COG1CON0_G1MD1_POSN                                0x1
#define _COG1CON0_G1MD1_POSITION                            0x1
#define _COG1CON0_G1MD1_SIZE                                0x1
#define _COG1CON0_G1MD1_LENGTH                              0x1
#define _COG1CON0_G1MD1_MASK                                0x2
#define _COG1CON0_G1MD2_POSN                                0x2
#define _COG1CON0_G1MD2_POSITION                            0x2
#define _COG1CON0_G1MD2_SIZE                                0x1
#define _COG1CON0_G1MD2_LENGTH                              0x1
#define _COG1CON0_G1MD2_MASK                                0x4
#define _COG1CON0_G1CS0_POSN                                0x3
#define _COG1CON0_G1CS0_POSITION                            0x3
#define _COG1CON0_G1CS0_SIZE                                0x1
#define _COG1CON0_G1CS0_LENGTH                              0x1
#define _COG1CON0_G1CS0_MASK                                0x8
#define _COG1CON0_G1CS1_POSN                                0x4
#define _COG1CON0_G1CS1_POSITION                            0x4
#define _COG1CON0_G1CS1_SIZE                                0x1
#define _COG1CON0_G1CS1_LENGTH                              0x1
#define _COG1CON0_G1CS1_MASK                                0x10

// Register: COG1CON1
#define COG1CON1 COG1CON1
extern volatile unsigned char           COG1CON1            __at(0x694);
#ifndef _LIB_BUILD
asm("COG1CON1 equ 0694h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POLA                   :1;
        unsigned POLB                   :1;
        unsigned POLC                   :1;
        unsigned POLD                   :1;
        unsigned                        :2;
        unsigned FDBS                   :1;
        unsigned RDBS                   :1;
    };
    struct {
        unsigned G1POLA                 :1;
        unsigned G1POLB                 :1;
        unsigned G1POLC                 :1;
        unsigned G1POLD                 :1;
        unsigned                        :2;
        unsigned G1FDBS                 :1;
        unsigned G1RDBS                 :1;
    };
} COG1CON1bits_t;
extern volatile COG1CON1bits_t COG1CON1bits __at(0x694);
// bitfield macros
#define _COG1CON1_POLA_POSN                                 0x0
#define _COG1CON1_POLA_POSITION                             0x0
#define _COG1CON1_POLA_SIZE                                 0x1
#define _COG1CON1_POLA_LENGTH                               0x1
#define _COG1CON1_POLA_MASK                                 0x1
#define _COG1CON1_POLB_POSN                                 0x1
#define _COG1CON1_POLB_POSITION                             0x1
#define _COG1CON1_POLB_SIZE                                 0x1
#define _COG1CON1_POLB_LENGTH                               0x1
#define _COG1CON1_POLB_MASK                                 0x2
#define _COG1CON1_POLC_POSN                                 0x2
#define _COG1CON1_POLC_POSITION                             0x2
#define _COG1CON1_POLC_SIZE                                 0x1
#define _COG1CON1_POLC_LENGTH                               0x1
#define _COG1CON1_POLC_MASK                                 0x4
#define _COG1CON1_POLD_POSN                                 0x3
#define _COG1CON1_POLD_POSITION                             0x3
#define _COG1CON1_POLD_SIZE                                 0x1
#define _COG1CON1_POLD_LENGTH                               0x1
#define _COG1CON1_POLD_MASK                                 0x8
#define _COG1CON1_FDBS_POSN                                 0x6
#define _COG1CON1_FDBS_POSITION                             0x6
#define _COG1CON1_FDBS_SIZE                                 0x1
#define _COG1CON1_FDBS_LENGTH                               0x1
#define _COG1CON1_FDBS_MASK                                 0x40
#define _COG1CON1_RDBS_POSN                                 0x7
#define _COG1CON1_RDBS_POSITION                             0x7
#define _COG1CON1_RDBS_SIZE                                 0x1
#define _COG1CON1_RDBS_LENGTH                               0x1
#define _COG1CON1_RDBS_MASK                                 0x80
#define _COG1CON1_G1POLA_POSN                               0x0
#define _COG1CON1_G1POLA_POSITION                           0x0
#define _COG1CON1_G1POLA_SIZE                               0x1
#define _COG1CON1_G1POLA_LENGTH                             0x1
#define _COG1CON1_G1POLA_MASK                               0x1
#define _COG1CON1_G1POLB_POSN                               0x1
#define _COG1CON1_G1POLB_POSITION                           0x1
#define _COG1CON1_G1POLB_SIZE                               0x1
#define _COG1CON1_G1POLB_LENGTH                             0x1
#define _COG1CON1_G1POLB_MASK                               0x2
#define _COG1CON1_G1POLC_POSN                               0x2
#define _COG1CON1_G1POLC_POSITION                           0x2
#define _COG1CON1_G1POLC_SIZE                               0x1
#define _COG1CON1_G1POLC_LENGTH                             0x1
#define _COG1CON1_G1POLC_MASK                               0x4
#define _COG1CON1_G1POLD_POSN                               0x3
#define _COG1CON1_G1POLD_POSITION                           0x3
#define _COG1CON1_G1POLD_SIZE                               0x1
#define _COG1CON1_G1POLD_LENGTH                             0x1
#define _COG1CON1_G1POLD_MASK                               0x8
#define _COG1CON1_G1FDBS_POSN                               0x6
#define _COG1CON1_G1FDBS_POSITION                           0x6
#define _COG1CON1_G1FDBS_SIZE                               0x1
#define _COG1CON1_G1FDBS_LENGTH                             0x1
#define _COG1CON1_G1FDBS_MASK                               0x40
#define _COG1CON1_G1RDBS_POSN                               0x7
#define _COG1CON1_G1RDBS_POSITION                           0x7
#define _COG1CON1_G1RDBS_SIZE                               0x1
#define _COG1CON1_G1RDBS_LENGTH                             0x1
#define _COG1CON1_G1RDBS_MASK                               0x80

// Register: COG1RIS0
#define COG1RIS0 COG1RIS0
extern volatile unsigned char           COG1RIS0            __at(0x695);
#ifndef _LIB_BUILD
asm("COG1RIS0 equ 0695h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RIS0                   :1;
        unsigned RIS1                   :1;
        unsigned RIS2                   :1;
        unsigned RIS3                   :1;
        unsigned RIS4                   :1;
        unsigned RIS5                   :1;
        unsigned RIS6                   :1;
        unsigned RIS7                   :1;
    };
    struct {
        unsigned G1RIS0                 :1;
        unsigned G1RIS1                 :1;
        unsigned G1RIS2                 :1;
        unsigned G1RIS3                 :1;
        unsigned G1RIS4                 :1;
        unsigned G1RIS5                 :1;
        unsigned G1RIS6                 :1;
        unsigned G1RIS7                 :1;
    };
} COG1RIS0bits_t;
extern volatile COG1RIS0bits_t COG1RIS0bits __at(0x695);
// bitfield macros
#define _COG1RIS0_RIS0_POSN                                 0x0
#define _COG1RIS0_RIS0_POSITION                             0x0
#define _COG1RIS0_RIS0_SIZE                                 0x1
#define _COG1RIS0_RIS0_LENGTH                               0x1
#define _COG1RIS0_RIS0_MASK                                 0x1
#define _COG1RIS0_RIS1_POSN                                 0x1
#define _COG1RIS0_RIS1_POSITION                             0x1
#define _COG1RIS0_RIS1_SIZE                                 0x1
#define _COG1RIS0_RIS1_LENGTH                               0x1
#define _COG1RIS0_RIS1_MASK                                 0x2
#define _COG1RIS0_RIS2_POSN                                 0x2
#define _COG1RIS0_RIS2_POSITION                             0x2
#define _COG1RIS0_RIS2_SIZE                                 0x1
#define _COG1RIS0_RIS2_LENGTH                               0x1
#define _COG1RIS0_RIS2_MASK                                 0x4
#define _COG1RIS0_RIS3_POSN                                 0x3
#define _COG1RIS0_RIS3_POSITION                             0x3
#define _COG1RIS0_RIS3_SIZE                                 0x1
#define _COG1RIS0_RIS3_LENGTH                               0x1
#define _COG1RIS0_RIS3_MASK                                 0x8
#define _COG1RIS0_RIS4_POSN                                 0x4
#define _COG1RIS0_RIS4_POSITION                             0x4
#define _COG1RIS0_RIS4_SIZE                                 0x1
#define _COG1RIS0_RIS4_LENGTH                               0x1
#define _COG1RIS0_RIS4_MASK                                 0x10
#define _COG1RIS0_RIS5_POSN                                 0x5
#define _COG1RIS0_RIS5_POSITION                             0x5
#define _COG1RIS0_RIS5_SIZE                                 0x1
#define _COG1RIS0_RIS5_LENGTH                               0x1
#define _COG1RIS0_RIS5_MASK                                 0x20
#define _COG1RIS0_RIS6_POSN                                 0x6
#define _COG1RIS0_RIS6_POSITION                             0x6
#define _COG1RIS0_RIS6_SIZE                                 0x1
#define _COG1RIS0_RIS6_LENGTH                               0x1
#define _COG1RIS0_RIS6_MASK                                 0x40
#define _COG1RIS0_RIS7_POSN                                 0x7
#define _COG1RIS0_RIS7_POSITION                             0x7
#define _COG1RIS0_RIS7_SIZE                                 0x1
#define _COG1RIS0_RIS7_LENGTH                               0x1
#define _COG1RIS0_RIS7_MASK                                 0x80
#define _COG1RIS0_G1RIS0_POSN                               0x0
#define _COG1RIS0_G1RIS0_POSITION                           0x0
#define _COG1RIS0_G1RIS0_SIZE                               0x1
#define _COG1RIS0_G1RIS0_LENGTH                             0x1
#define _COG1RIS0_G1RIS0_MASK                               0x1
#define _COG1RIS0_G1RIS1_POSN                               0x1
#define _COG1RIS0_G1RIS1_POSITION                           0x1
#define _COG1RIS0_G1RIS1_SIZE                               0x1
#define _COG1RIS0_G1RIS1_LENGTH                             0x1
#define _COG1RIS0_G1RIS1_MASK                               0x2
#define _COG1RIS0_G1RIS2_POSN                               0x2
#define _COG1RIS0_G1RIS2_POSITION                           0x2
#define _COG1RIS0_G1RIS2_SIZE                               0x1
#define _COG1RIS0_G1RIS2_LENGTH                             0x1
#define _COG1RIS0_G1RIS2_MASK                               0x4
#define _COG1RIS0_G1RIS3_POSN                               0x3
#define _COG1RIS0_G1RIS3_POSITION                           0x3
#define _COG1RIS0_G1RIS3_SIZE                               0x1
#define _COG1RIS0_G1RIS3_LENGTH                             0x1
#define _COG1RIS0_G1RIS3_MASK                               0x8
#define _COG1RIS0_G1RIS4_POSN                               0x4
#define _COG1RIS0_G1RIS4_POSITION                           0x4
#define _COG1RIS0_G1RIS4_SIZE                               0x1
#define _COG1RIS0_G1RIS4_LENGTH                             0x1
#define _COG1RIS0_G1RIS4_MASK                               0x10
#define _COG1RIS0_G1RIS5_POSN                               0x5
#define _COG1RIS0_G1RIS5_POSITION                           0x5
#define _COG1RIS0_G1RIS5_SIZE                               0x1
#define _COG1RIS0_G1RIS5_LENGTH                             0x1
#define _COG1RIS0_G1RIS5_MASK                               0x20
#define _COG1RIS0_G1RIS6_POSN                               0x6
#define _COG1RIS0_G1RIS6_POSITION                           0x6
#define _COG1RIS0_G1RIS6_SIZE                               0x1
#define _COG1RIS0_G1RIS6_LENGTH                             0x1
#define _COG1RIS0_G1RIS6_MASK                               0x40
#define _COG1RIS0_G1RIS7_POSN                               0x7
#define _COG1RIS0_G1RIS7_POSITION                           0x7
#define _COG1RIS0_G1RIS7_SIZE                               0x1
#define _COG1RIS0_G1RIS7_LENGTH                             0x1
#define _COG1RIS0_G1RIS7_MASK                               0x80

