MikroElektronika/core_packages/PIC/XC8/def/PIC16F1778/mcu.h
extern volatile COG2RSIM0bits_t COG2RSIM0bits __at(0x717);
// bitfield macros
#define _COG2RSIM0_RSIM0_POSN                               0x0
#define _COG2RSIM0_RSIM0_POSITION                           0x0
#define _COG2RSIM0_RSIM0_SIZE                               0x1
#define _COG2RSIM0_RSIM0_LENGTH                             0x1
#define _COG2RSIM0_RSIM0_MASK                               0x1
#define _COG2RSIM0_RSIM1_POSN                               0x1
#define _COG2RSIM0_RSIM1_POSITION                           0x1
#define _COG2RSIM0_RSIM1_SIZE                               0x1
#define _COG2RSIM0_RSIM1_LENGTH                             0x1
#define _COG2RSIM0_RSIM1_MASK                               0x2
#define _COG2RSIM0_RSIM2_POSN                               0x2
#define _COG2RSIM0_RSIM2_POSITION                           0x2
#define _COG2RSIM0_RSIM2_SIZE                               0x1
#define _COG2RSIM0_RSIM2_LENGTH                             0x1
#define _COG2RSIM0_RSIM2_MASK                               0x4
#define _COG2RSIM0_RSIM3_POSN                               0x3
#define _COG2RSIM0_RSIM3_POSITION                           0x3
#define _COG2RSIM0_RSIM3_SIZE                               0x1
#define _COG2RSIM0_RSIM3_LENGTH                             0x1
#define _COG2RSIM0_RSIM3_MASK                               0x8
#define _COG2RSIM0_RSIM4_POSN                               0x4
#define _COG2RSIM0_RSIM4_POSITION                           0x4
#define _COG2RSIM0_RSIM4_SIZE                               0x1
#define _COG2RSIM0_RSIM4_LENGTH                             0x1
#define _COG2RSIM0_RSIM4_MASK                               0x10
#define _COG2RSIM0_RSIM5_POSN                               0x5
#define _COG2RSIM0_RSIM5_POSITION                           0x5
#define _COG2RSIM0_RSIM5_SIZE                               0x1
#define _COG2RSIM0_RSIM5_LENGTH                             0x1
#define _COG2RSIM0_RSIM5_MASK                               0x20
#define _COG2RSIM0_RSIM6_POSN                               0x6
#define _COG2RSIM0_RSIM6_POSITION                           0x6
#define _COG2RSIM0_RSIM6_SIZE                               0x1
#define _COG2RSIM0_RSIM6_LENGTH                             0x1
#define _COG2RSIM0_RSIM6_MASK                               0x40
#define _COG2RSIM0_RSIM7_POSN                               0x7
#define _COG2RSIM0_RSIM7_POSITION                           0x7
#define _COG2RSIM0_RSIM7_SIZE                               0x1
#define _COG2RSIM0_RSIM7_LENGTH                             0x1
#define _COG2RSIM0_RSIM7_MASK                               0x80
#define _COG2RSIM0_G2RSIM0_POSN                             0x0
#define _COG2RSIM0_G2RSIM0_POSITION                         0x0
#define _COG2RSIM0_G2RSIM0_SIZE                             0x1
#define _COG2RSIM0_G2RSIM0_LENGTH                           0x1
#define _COG2RSIM0_G2RSIM0_MASK                             0x1
#define _COG2RSIM0_G2RSIM1_POSN                             0x1
#define _COG2RSIM0_G2RSIM1_POSITION                         0x1
#define _COG2RSIM0_G2RSIM1_SIZE                             0x1
#define _COG2RSIM0_G2RSIM1_LENGTH                           0x1
#define _COG2RSIM0_G2RSIM1_MASK                             0x2
#define _COG2RSIM0_G2RSIM2_POSN                             0x2
#define _COG2RSIM0_G2RSIM2_POSITION                         0x2
#define _COG2RSIM0_G2RSIM2_SIZE                             0x1
#define _COG2RSIM0_G2RSIM2_LENGTH                           0x1
#define _COG2RSIM0_G2RSIM2_MASK                             0x4
#define _COG2RSIM0_G2RSIM3_POSN                             0x3
#define _COG2RSIM0_G2RSIM3_POSITION                         0x3
#define _COG2RSIM0_G2RSIM3_SIZE                             0x1
#define _COG2RSIM0_G2RSIM3_LENGTH                           0x1
#define _COG2RSIM0_G2RSIM3_MASK                             0x8
#define _COG2RSIM0_G2RSIM4_POSN                             0x4
#define _COG2RSIM0_G2RSIM4_POSITION                         0x4
#define _COG2RSIM0_G2RSIM4_SIZE                             0x1
#define _COG2RSIM0_G2RSIM4_LENGTH                           0x1
#define _COG2RSIM0_G2RSIM4_MASK                             0x10
#define _COG2RSIM0_G2RSIM5_POSN                             0x5
#define _COG2RSIM0_G2RSIM5_POSITION                         0x5
#define _COG2RSIM0_G2RSIM5_SIZE                             0x1
#define _COG2RSIM0_G2RSIM5_LENGTH                           0x1
#define _COG2RSIM0_G2RSIM5_MASK                             0x20
#define _COG2RSIM0_G2RSIM6_POSN                             0x6
#define _COG2RSIM0_G2RSIM6_POSITION                         0x6
#define _COG2RSIM0_G2RSIM6_SIZE                             0x1
#define _COG2RSIM0_G2RSIM6_LENGTH                           0x1
#define _COG2RSIM0_G2RSIM6_MASK                             0x40
#define _COG2RSIM0_G2RSIM7_POSN                             0x7
#define _COG2RSIM0_G2RSIM7_POSITION                         0x7
#define _COG2RSIM0_G2RSIM7_SIZE                             0x1
#define _COG2RSIM0_G2RSIM7_LENGTH                           0x1
#define _COG2RSIM0_G2RSIM7_MASK                             0x80

// Register: COG2RSIM1
#define COG2RSIM1 COG2RSIM1
extern volatile unsigned char           COG2RSIM1           __at(0x718);
#ifndef _LIB_BUILD
asm("COG2RSIM1 equ 0718h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RSIM8                  :1;
        unsigned RSIM9                  :1;
        unsigned RSIM10                 :1;
        unsigned RSIM11                 :1;
        unsigned RSIM12                 :1;
        unsigned RSIM13                 :1;
        unsigned RSIM14                 :1;
        unsigned RSIM15                 :1;
    };
    struct {
        unsigned G2RSIM8                :1;
        unsigned G2RSIM9                :1;
        unsigned G2RSIM10               :1;
        unsigned G2RSIM11               :1;
        unsigned G2RSIM12               :1;
        unsigned G2RSIM13               :1;
        unsigned G2RSIM14               :1;
        unsigned G2RSIM15               :1;
    };
} COG2RSIM1bits_t;
extern volatile COG2RSIM1bits_t COG2RSIM1bits __at(0x718);
// bitfield macros
#define _COG2RSIM1_RSIM8_POSN                               0x0
#define _COG2RSIM1_RSIM8_POSITION                           0x0
#define _COG2RSIM1_RSIM8_SIZE                               0x1
#define _COG2RSIM1_RSIM8_LENGTH                             0x1
#define _COG2RSIM1_RSIM8_MASK                               0x1
#define _COG2RSIM1_RSIM9_POSN                               0x1
#define _COG2RSIM1_RSIM9_POSITION                           0x1
#define _COG2RSIM1_RSIM9_SIZE                               0x1
#define _COG2RSIM1_RSIM9_LENGTH                             0x1
#define _COG2RSIM1_RSIM9_MASK                               0x2
#define _COG2RSIM1_RSIM10_POSN                              0x2
#define _COG2RSIM1_RSIM10_POSITION                          0x2
#define _COG2RSIM1_RSIM10_SIZE                              0x1
#define _COG2RSIM1_RSIM10_LENGTH                            0x1
#define _COG2RSIM1_RSIM10_MASK                              0x4
#define _COG2RSIM1_RSIM11_POSN                              0x3
#define _COG2RSIM1_RSIM11_POSITION                          0x3
#define _COG2RSIM1_RSIM11_SIZE                              0x1
#define _COG2RSIM1_RSIM11_LENGTH                            0x1
#define _COG2RSIM1_RSIM11_MASK                              0x8
#define _COG2RSIM1_RSIM12_POSN                              0x4
#define _COG2RSIM1_RSIM12_POSITION                          0x4
#define _COG2RSIM1_RSIM12_SIZE                              0x1
#define _COG2RSIM1_RSIM12_LENGTH                            0x1
#define _COG2RSIM1_RSIM12_MASK                              0x10
#define _COG2RSIM1_RSIM13_POSN                              0x5
#define _COG2RSIM1_RSIM13_POSITION                          0x5
#define _COG2RSIM1_RSIM13_SIZE                              0x1
#define _COG2RSIM1_RSIM13_LENGTH                            0x1
#define _COG2RSIM1_RSIM13_MASK                              0x20
#define _COG2RSIM1_RSIM14_POSN                              0x6
#define _COG2RSIM1_RSIM14_POSITION                          0x6
#define _COG2RSIM1_RSIM14_SIZE                              0x1
#define _COG2RSIM1_RSIM14_LENGTH                            0x1
#define _COG2RSIM1_RSIM14_MASK                              0x40
#define _COG2RSIM1_RSIM15_POSN                              0x7
#define _COG2RSIM1_RSIM15_POSITION                          0x7
#define _COG2RSIM1_RSIM15_SIZE                              0x1
#define _COG2RSIM1_RSIM15_LENGTH                            0x1
#define _COG2RSIM1_RSIM15_MASK                              0x80
#define _COG2RSIM1_G2RSIM8_POSN                             0x0
#define _COG2RSIM1_G2RSIM8_POSITION                         0x0
#define _COG2RSIM1_G2RSIM8_SIZE                             0x1
#define _COG2RSIM1_G2RSIM8_LENGTH                           0x1
#define _COG2RSIM1_G2RSIM8_MASK                             0x1
#define _COG2RSIM1_G2RSIM9_POSN                             0x1
#define _COG2RSIM1_G2RSIM9_POSITION                         0x1
#define _COG2RSIM1_G2RSIM9_SIZE                             0x1
#define _COG2RSIM1_G2RSIM9_LENGTH                           0x1
#define _COG2RSIM1_G2RSIM9_MASK                             0x2
#define _COG2RSIM1_G2RSIM10_POSN                            0x2
#define _COG2RSIM1_G2RSIM10_POSITION                        0x2
#define _COG2RSIM1_G2RSIM10_SIZE                            0x1
#define _COG2RSIM1_G2RSIM10_LENGTH                          0x1
#define _COG2RSIM1_G2RSIM10_MASK                            0x4
#define _COG2RSIM1_G2RSIM11_POSN                            0x3
#define _COG2RSIM1_G2RSIM11_POSITION                        0x3
#define _COG2RSIM1_G2RSIM11_SIZE                            0x1
#define _COG2RSIM1_G2RSIM11_LENGTH                          0x1
#define _COG2RSIM1_G2RSIM11_MASK                            0x8
#define _COG2RSIM1_G2RSIM12_POSN                            0x4
#define _COG2RSIM1_G2RSIM12_POSITION                        0x4
#define _COG2RSIM1_G2RSIM12_SIZE                            0x1
#define _COG2RSIM1_G2RSIM12_LENGTH                          0x1
#define _COG2RSIM1_G2RSIM12_MASK                            0x10
#define _COG2RSIM1_G2RSIM13_POSN                            0x5
#define _COG2RSIM1_G2RSIM13_POSITION                        0x5
#define _COG2RSIM1_G2RSIM13_SIZE                            0x1
#define _COG2RSIM1_G2RSIM13_LENGTH                          0x1
#define _COG2RSIM1_G2RSIM13_MASK                            0x20
#define _COG2RSIM1_G2RSIM14_POSN                            0x6
#define _COG2RSIM1_G2RSIM14_POSITION                        0x6
#define _COG2RSIM1_G2RSIM14_SIZE                            0x1
#define _COG2RSIM1_G2RSIM14_LENGTH                          0x1
#define _COG2RSIM1_G2RSIM14_MASK                            0x40
#define _COG2RSIM1_G2RSIM15_POSN                            0x7
#define _COG2RSIM1_G2RSIM15_POSITION                        0x7
#define _COG2RSIM1_G2RSIM15_SIZE                            0x1
#define _COG2RSIM1_G2RSIM15_LENGTH                          0x1
#define _COG2RSIM1_G2RSIM15_MASK                            0x80

// Register: COG2FIS0
#define COG2FIS0 COG2FIS0
extern volatile unsigned char           COG2FIS0            __at(0x719);
#ifndef _LIB_BUILD
asm("COG2FIS0 equ 0719h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FIS0                   :1;
        unsigned FIS1                   :1;
        unsigned FIS2                   :1;
        unsigned FIS3                   :1;
        unsigned FIS4                   :1;
        unsigned FIS5                   :1;
        unsigned FIS6                   :1;
        unsigned FIS7                   :1;
    };
    struct {
        unsigned G2FIS0                 :1;
        unsigned G2FIS1                 :1;
        unsigned G2FIS2                 :1;
        unsigned G2FIS3                 :1;
        unsigned G2FIS4                 :1;
        unsigned G2FIS5                 :1;
        unsigned G2FIS6                 :1;
        unsigned G2FIS7                 :1;
    };
} COG2FIS0bits_t;
