MikroElektronika/core_packages/PIC/XC8/def/PIC16F1778/mcu.h
extern volatile PRG3FTSSbits_t PRG3FTSSbits __at(0x79B);
// bitfield macros
#define _PRG3FTSS_FTSS_POSN                                 0x0
#define _PRG3FTSS_FTSS_POSITION                             0x0
#define _PRG3FTSS_FTSS_SIZE                                 0x8
#define _PRG3FTSS_FTSS_LENGTH                               0x8
#define _PRG3FTSS_FTSS_MASK                                 0xFF
#define _PRG3FTSS_FTSS0_POSN                                0x0
#define _PRG3FTSS_FTSS0_POSITION                            0x0
#define _PRG3FTSS_FTSS0_SIZE                                0x1
#define _PRG3FTSS_FTSS0_LENGTH                              0x1
#define _PRG3FTSS_FTSS0_MASK                                0x1
#define _PRG3FTSS_FTSS1_POSN                                0x1
#define _PRG3FTSS_FTSS1_POSITION                            0x1
#define _PRG3FTSS_FTSS1_SIZE                                0x1
#define _PRG3FTSS_FTSS1_LENGTH                              0x1
#define _PRG3FTSS_FTSS1_MASK                                0x2
#define _PRG3FTSS_FTSS2_POSN                                0x2
#define _PRG3FTSS_FTSS2_POSITION                            0x2
#define _PRG3FTSS_FTSS2_SIZE                                0x1
#define _PRG3FTSS_FTSS2_LENGTH                              0x1
#define _PRG3FTSS_FTSS2_MASK                                0x4
#define _PRG3FTSS_FTSS3_POSN                                0x3
#define _PRG3FTSS_FTSS3_POSITION                            0x3
#define _PRG3FTSS_FTSS3_SIZE                                0x1
#define _PRG3FTSS_FTSS3_LENGTH                              0x1
#define _PRG3FTSS_FTSS3_MASK                                0x8
#define _PRG3FTSS_RG3FTSS0_POSN                             0x0
#define _PRG3FTSS_RG3FTSS0_POSITION                         0x0
#define _PRG3FTSS_RG3FTSS0_SIZE                             0x1
#define _PRG3FTSS_RG3FTSS0_LENGTH                           0x1
#define _PRG3FTSS_RG3FTSS0_MASK                             0x1
#define _PRG3FTSS_RG3FTSS1_POSN                             0x1
#define _PRG3FTSS_RG3FTSS1_POSITION                         0x1
#define _PRG3FTSS_RG3FTSS1_SIZE                             0x1
#define _PRG3FTSS_RG3FTSS1_LENGTH                           0x1
#define _PRG3FTSS_RG3FTSS1_MASK                             0x2
#define _PRG3FTSS_RG3FTSS2_POSN                             0x2
#define _PRG3FTSS_RG3FTSS2_POSITION                         0x2
#define _PRG3FTSS_RG3FTSS2_SIZE                             0x1
#define _PRG3FTSS_RG3FTSS2_LENGTH                           0x1
#define _PRG3FTSS_RG3FTSS2_MASK                             0x4
#define _PRG3FTSS_RG3FTSS3_POSN                             0x3
#define _PRG3FTSS_RG3FTSS3_POSITION                         0x3
#define _PRG3FTSS_RG3FTSS3_SIZE                             0x1
#define _PRG3FTSS_RG3FTSS3_LENGTH                           0x1
#define _PRG3FTSS_RG3FTSS3_MASK                             0x8

// Register: PRG3INS
#define PRG3INS PRG3INS
extern volatile unsigned char           PRG3INS             __at(0x79C);
#ifndef _LIB_BUILD
asm("PRG3INS equ 079Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INS                    :8;
    };
    struct {
        unsigned INS0                   :1;
        unsigned INS1                   :1;
        unsigned INS2                   :1;
        unsigned INS3                   :1;
    };
    struct {
        unsigned RG3INS0                :1;
        unsigned RG3INS1                :1;
        unsigned RG3INS2                :1;
        unsigned RG3INS3                :1;
    };
} PRG3INSbits_t;
extern volatile PRG3INSbits_t PRG3INSbits __at(0x79C);
// bitfield macros
#define _PRG3INS_INS_POSN                                   0x0
#define _PRG3INS_INS_POSITION                               0x0
#define _PRG3INS_INS_SIZE                                   0x8
#define _PRG3INS_INS_LENGTH                                 0x8
#define _PRG3INS_INS_MASK                                   0xFF
#define _PRG3INS_INS0_POSN                                  0x0
#define _PRG3INS_INS0_POSITION                              0x0
#define _PRG3INS_INS0_SIZE                                  0x1
#define _PRG3INS_INS0_LENGTH                                0x1
#define _PRG3INS_INS0_MASK                                  0x1
#define _PRG3INS_INS1_POSN                                  0x1
#define _PRG3INS_INS1_POSITION                              0x1
#define _PRG3INS_INS1_SIZE                                  0x1
#define _PRG3INS_INS1_LENGTH                                0x1
#define _PRG3INS_INS1_MASK                                  0x2
#define _PRG3INS_INS2_POSN                                  0x2
#define _PRG3INS_INS2_POSITION                              0x2
#define _PRG3INS_INS2_SIZE                                  0x1
#define _PRG3INS_INS2_LENGTH                                0x1
#define _PRG3INS_INS2_MASK                                  0x4
#define _PRG3INS_INS3_POSN                                  0x3
#define _PRG3INS_INS3_POSITION                              0x3
#define _PRG3INS_INS3_SIZE                                  0x1
#define _PRG3INS_INS3_LENGTH                                0x1
#define _PRG3INS_INS3_MASK                                  0x8
#define _PRG3INS_RG3INS0_POSN                               0x0
#define _PRG3INS_RG3INS0_POSITION                           0x0
#define _PRG3INS_RG3INS0_SIZE                               0x1
#define _PRG3INS_RG3INS0_LENGTH                             0x1
#define _PRG3INS_RG3INS0_MASK                               0x1
#define _PRG3INS_RG3INS1_POSN                               0x1
#define _PRG3INS_RG3INS1_POSITION                           0x1
#define _PRG3INS_RG3INS1_SIZE                               0x1
#define _PRG3INS_RG3INS1_LENGTH                             0x1
#define _PRG3INS_RG3INS1_MASK                               0x2
#define _PRG3INS_RG3INS2_POSN                               0x2
#define _PRG3INS_RG3INS2_POSITION                           0x2
#define _PRG3INS_RG3INS2_SIZE                               0x1
#define _PRG3INS_RG3INS2_LENGTH                             0x1
#define _PRG3INS_RG3INS2_MASK                               0x4
#define _PRG3INS_RG3INS3_POSN                               0x3
#define _PRG3INS_RG3INS3_POSITION                           0x3
#define _PRG3INS_RG3INS3_SIZE                               0x1
#define _PRG3INS_RG3INS3_LENGTH                             0x1
#define _PRG3INS_RG3INS3_MASK                               0x8

// Register: PRG3CON0
#define PRG3CON0 PRG3CON0
extern volatile unsigned char           PRG3CON0            __at(0x79D);
#ifndef _LIB_BUILD
asm("PRG3CON0 equ 079Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GO                     :1;
        unsigned OS                     :1;
        unsigned MODE                   :2;
        unsigned REDG                   :1;
        unsigned FEDG                   :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
    };
    struct {
        unsigned RG3GO                  :1;
        unsigned RG3OS                  :1;
        unsigned RG3MODE                :2;
        unsigned RG3REDG                :1;
        unsigned RG3FEDG                :1;
        unsigned                        :1;
        unsigned RG3EN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned RG3MODE0               :1;
        unsigned RG3MODE1               :1;
    };
} PRG3CON0bits_t;
extern volatile PRG3CON0bits_t PRG3CON0bits __at(0x79D);
// bitfield macros
#define _PRG3CON0_GO_POSN                                   0x0
#define _PRG3CON0_GO_POSITION                               0x0
#define _PRG3CON0_GO_SIZE                                   0x1
#define _PRG3CON0_GO_LENGTH                                 0x1
#define _PRG3CON0_GO_MASK                                   0x1
#define _PRG3CON0_OS_POSN                                   0x1
#define _PRG3CON0_OS_POSITION                               0x1
#define _PRG3CON0_OS_SIZE                                   0x1
#define _PRG3CON0_OS_LENGTH                                 0x1
#define _PRG3CON0_OS_MASK                                   0x2
#define _PRG3CON0_MODE_POSN                                 0x2
#define _PRG3CON0_MODE_POSITION                             0x2
#define _PRG3CON0_MODE_SIZE                                 0x2
#define _PRG3CON0_MODE_LENGTH                               0x2
#define _PRG3CON0_MODE_MASK                                 0xC
#define _PRG3CON0_REDG_POSN                                 0x4
#define _PRG3CON0_REDG_POSITION                             0x4
#define _PRG3CON0_REDG_SIZE                                 0x1
#define _PRG3CON0_REDG_LENGTH                               0x1
#define _PRG3CON0_REDG_MASK                                 0x10
#define _PRG3CON0_FEDG_POSN                                 0x5
#define _PRG3CON0_FEDG_POSITION                             0x5
#define _PRG3CON0_FEDG_SIZE                                 0x1
#define _PRG3CON0_FEDG_LENGTH                               0x1
#define _PRG3CON0_FEDG_MASK                                 0x20
#define _PRG3CON0_EN_POSN                                   0x7
#define _PRG3CON0_EN_POSITION                               0x7
#define _PRG3CON0_EN_SIZE                                   0x1
#define _PRG3CON0_EN_LENGTH                                 0x1
#define _PRG3CON0_EN_MASK                                   0x80
#define _PRG3CON0_MODE0_POSN                                0x2
#define _PRG3CON0_MODE0_POSITION                            0x2
#define _PRG3CON0_MODE0_SIZE                                0x1
#define _PRG3CON0_MODE0_LENGTH                              0x1
#define _PRG3CON0_MODE0_MASK                                0x4
#define _PRG3CON0_MODE1_POSN                                0x3
#define _PRG3CON0_MODE1_POSITION                            0x3
#define _PRG3CON0_MODE1_SIZE                                0x1
#define _PRG3CON0_MODE1_LENGTH                              0x1
#define _PRG3CON0_MODE1_MASK                                0x8
#define _PRG3CON0_RG3GO_POSN                                0x0
#define _PRG3CON0_RG3GO_POSITION                            0x0
#define _PRG3CON0_RG3GO_SIZE                                0x1
#define _PRG3CON0_RG3GO_LENGTH                              0x1
#define _PRG3CON0_RG3GO_MASK                                0x1
#define _PRG3CON0_RG3OS_POSN                                0x1
#define _PRG3CON0_RG3OS_POSITION                            0x1
#define _PRG3CON0_RG3OS_SIZE                                0x1
#define _PRG3CON0_RG3OS_LENGTH                              0x1
#define _PRG3CON0_RG3OS_MASK                                0x2
#define _PRG3CON0_RG3MODE_POSN                              0x2
#define _PRG3CON0_RG3MODE_POSITION                          0x2
#define _PRG3CON0_RG3MODE_SIZE                              0x2
#define _PRG3CON0_RG3MODE_LENGTH                            0x2
#define _PRG3CON0_RG3MODE_MASK                              0xC
#define _PRG3CON0_RG3REDG_POSN                              0x4
#define _PRG3CON0_RG3REDG_POSITION                          0x4
#define _PRG3CON0_RG3REDG_SIZE                              0x1
#define _PRG3CON0_RG3REDG_LENGTH                            0x1
#define _PRG3CON0_RG3REDG_MASK                              0x10
#define _PRG3CON0_RG3FEDG_POSN                              0x5
#define _PRG3CON0_RG3FEDG_POSITION                          0x5
#define _PRG3CON0_RG3FEDG_SIZE                              0x1
#define _PRG3CON0_RG3FEDG_LENGTH                            0x1
#define _PRG3CON0_RG3FEDG_MASK                              0x20
#define _PRG3CON0_RG3EN_POSN                                0x7
#define _PRG3CON0_RG3EN_POSITION                            0x7
#define _PRG3CON0_RG3EN_SIZE                                0x1
#define _PRG3CON0_RG3EN_LENGTH                              0x1
#define _PRG3CON0_RG3EN_MASK                                0x80
#define _PRG3CON0_RG3MODE0_POSN                             0x2
#define _PRG3CON0_RG3MODE0_POSITION                         0x2
#define _PRG3CON0_RG3MODE0_SIZE                             0x1
#define _PRG3CON0_RG3MODE0_LENGTH                           0x1
#define _PRG3CON0_RG3MODE0_MASK                             0x4
#define _PRG3CON0_RG3MODE1_POSN                             0x3
#define _PRG3CON0_RG3MODE1_POSITION                         0x3
#define _PRG3CON0_RG3MODE1_SIZE                             0x1
#define _PRG3CON0_RG3MODE1_LENGTH                           0x1
#define _PRG3CON0_RG3MODE1_MASK                             0x8

// Register: PRG3CON1
#define PRG3CON1 PRG3CON1
extern volatile unsigned char           PRG3CON1            __at(0x79E);
#ifndef _LIB_BUILD
asm("PRG3CON1 equ 079Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPOL                   :1;
        unsigned FPOL                   :1;
        unsigned RDY                    :1;
    };
    struct {
        unsigned RG3RPOL                :1;
        unsigned RG3FPOL                :1;
        unsigned RG3RDY                 :1;
    };
} PRG3CON1bits_t;
extern volatile PRG3CON1bits_t PRG3CON1bits __at(0x79E);
// bitfield macros
#define _PRG3CON1_RPOL_POSN                                 0x0
#define _PRG3CON1_RPOL_POSITION                             0x0
#define _PRG3CON1_RPOL_SIZE                                 0x1
#define _PRG3CON1_RPOL_LENGTH                               0x1
#define _PRG3CON1_RPOL_MASK                                 0x1
#define _PRG3CON1_FPOL_POSN                                 0x1
#define _PRG3CON1_FPOL_POSITION                             0x1
#define _PRG3CON1_FPOL_SIZE                                 0x1
#define _PRG3CON1_FPOL_LENGTH                               0x1
#define _PRG3CON1_FPOL_MASK                                 0x2
#define _PRG3CON1_RDY_POSN                                  0x2
#define _PRG3CON1_RDY_POSITION                              0x2
#define _PRG3CON1_RDY_SIZE                                  0x1
#define _PRG3CON1_RDY_LENGTH                                0x1
#define _PRG3CON1_RDY_MASK                                  0x4
#define _PRG3CON1_RG3RPOL_POSN                              0x0
#define _PRG3CON1_RG3RPOL_POSITION                          0x0
#define _PRG3CON1_RG3RPOL_SIZE                              0x1
#define _PRG3CON1_RG3RPOL_LENGTH                            0x1
#define _PRG3CON1_RG3RPOL_MASK                              0x1
#define _PRG3CON1_RG3FPOL_POSN                              0x1
#define _PRG3CON1_RG3FPOL_POSITION                          0x1
#define _PRG3CON1_RG3FPOL_SIZE                              0x1
#define _PRG3CON1_RG3FPOL_LENGTH                            0x1
#define _PRG3CON1_RG3FPOL_MASK                              0x2
#define _PRG3CON1_RG3RDY_POSN                               0x2
#define _PRG3CON1_RG3RDY_POSITION                           0x2
#define _PRG3CON1_RG3RDY_SIZE                               0x1
#define _PRG3CON1_RG3RDY_LENGTH                             0x1
#define _PRG3CON1_RG3RDY_MASK                               0x4

// Register: PRG3CON2
#define PRG3CON2 PRG3CON2
extern volatile unsigned char           PRG3CON2            __at(0x79F);
#ifndef _LIB_BUILD
asm("PRG3CON2 equ 079Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ISET                   :5;
    };
    struct {
        unsigned ISET0                  :1;
        unsigned ISET1                  :1;
        unsigned ISET2                  :1;
        unsigned ISET3                  :1;
        unsigned ISET4                  :1;
    };
    struct {
        unsigned RG3ISET                :5;
    };
    struct {
        unsigned RG3ISET0               :1;
        unsigned RG3ISET1               :1;
        unsigned RG3ISET2               :1;
        unsigned RG3ISET3               :1;
        unsigned RG3ISET4               :1;
    };
} PRG3CON2bits_t;
extern volatile PRG3CON2bits_t PRG3CON2bits __at(0x79F);
// bitfield macros
#define _PRG3CON2_ISET_POSN                                 0x0
#define _PRG3CON2_ISET_POSITION                             0x0
#define _PRG3CON2_ISET_SIZE                                 0x5
#define _PRG3CON2_ISET_LENGTH                               0x5
#define _PRG3CON2_ISET_MASK                                 0x1F
#define _PRG3CON2_ISET0_POSN                                0x0
#define _PRG3CON2_ISET0_POSITION                            0x0
#define _PRG3CON2_ISET0_SIZE                                0x1
#define _PRG3CON2_ISET0_LENGTH                              0x1
#define _PRG3CON2_ISET0_MASK                                0x1
#define _PRG3CON2_ISET1_POSN                                0x1
#define _PRG3CON2_ISET1_POSITION                            0x1
#define _PRG3CON2_ISET1_SIZE                                0x1
#define _PRG3CON2_ISET1_LENGTH                              0x1
#define _PRG3CON2_ISET1_MASK                                0x2
#define _PRG3CON2_ISET2_POSN                                0x2
#define _PRG3CON2_ISET2_POSITION                            0x2
#define _PRG3CON2_ISET2_SIZE                                0x1
#define _PRG3CON2_ISET2_LENGTH                              0x1
#define _PRG3CON2_ISET2_MASK                                0x4
#define _PRG3CON2_ISET3_POSN                                0x3
#define _PRG3CON2_ISET3_POSITION                            0x3
#define _PRG3CON2_ISET3_SIZE                                0x1
#define _PRG3CON2_ISET3_LENGTH                              0x1
#define _PRG3CON2_ISET3_MASK                                0x8
#define _PRG3CON2_ISET4_POSN                                0x4
#define _PRG3CON2_ISET4_POSITION                            0x4
#define _PRG3CON2_ISET4_SIZE                                0x1
#define _PRG3CON2_ISET4_LENGTH                              0x1
#define _PRG3CON2_ISET4_MASK                                0x10
#define _PRG3CON2_RG3ISET_POSN                              0x0
#define _PRG3CON2_RG3ISET_POSITION                          0x0
#define _PRG3CON2_RG3ISET_SIZE                              0x5
#define _PRG3CON2_RG3ISET_LENGTH                            0x5
#define _PRG3CON2_RG3ISET_MASK                              0x1F
#define _PRG3CON2_RG3ISET0_POSN                             0x0
#define _PRG3CON2_RG3ISET0_POSITION                         0x0
#define _PRG3CON2_RG3ISET0_SIZE                             0x1
#define _PRG3CON2_RG3ISET0_LENGTH                           0x1
#define _PRG3CON2_RG3ISET0_MASK                             0x1
#define _PRG3CON2_RG3ISET1_POSN                             0x1
#define _PRG3CON2_RG3ISET1_POSITION                         0x1
#define _PRG3CON2_RG3ISET1_SIZE                             0x1
#define _PRG3CON2_RG3ISET1_LENGTH                           0x1
#define _PRG3CON2_RG3ISET1_MASK                             0x2
#define _PRG3CON2_RG3ISET2_POSN                             0x2
#define _PRG3CON2_RG3ISET2_POSITION                         0x2
#define _PRG3CON2_RG3ISET2_SIZE                             0x1
#define _PRG3CON2_RG3ISET2_LENGTH                           0x1
#define _PRG3CON2_RG3ISET2_MASK                             0x4
#define _PRG3CON2_RG3ISET3_POSN                             0x3
#define _PRG3CON2_RG3ISET3_POSITION                         0x3
#define _PRG3CON2_RG3ISET3_SIZE                             0x1
#define _PRG3CON2_RG3ISET3_LENGTH                           0x1
#define _PRG3CON2_RG3ISET3_MASK                             0x8
#define _PRG3CON2_RG3ISET4_POSN                             0x4
#define _PRG3CON2_RG3ISET4_POSITION                         0x4
#define _PRG3CON2_RG3ISET4_SIZE                             0x1
#define _PRG3CON2_RG3ISET4_LENGTH                           0x1
#define _PRG3CON2_RG3ISET4_MASK                             0x10

