MikroElektronika/core_packages/PIC/XC8/def/PIC16F1778/mcu.h
// Register: COG3STR
#define COG3STR COG3STR
extern volatile unsigned char           COG3STR             __at(0x81F);
#ifndef _LIB_BUILD
asm("COG3STR equ 081Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned SDATA                  :1;
        unsigned SDATB                  :1;
        unsigned SDATC                  :1;
        unsigned SDATD                  :1;
    };
    struct {
        unsigned G3STRA                 :1;
        unsigned G3STRB                 :1;
        unsigned G3STRC                 :1;
        unsigned G3STRD                 :1;
        unsigned G3SDATA                :1;
        unsigned G3SDATB                :1;
        unsigned G3SDATC                :1;
        unsigned G3SDATD                :1;
    };
} COG3STRbits_t;
extern volatile COG3STRbits_t COG3STRbits __at(0x81F);
// bitfield macros
#define _COG3STR_STRA_POSN                                  0x0
#define _COG3STR_STRA_POSITION                              0x0
#define _COG3STR_STRA_SIZE                                  0x1
#define _COG3STR_STRA_LENGTH                                0x1
#define _COG3STR_STRA_MASK                                  0x1
#define _COG3STR_STRB_POSN                                  0x1
#define _COG3STR_STRB_POSITION                              0x1
#define _COG3STR_STRB_SIZE                                  0x1
#define _COG3STR_STRB_LENGTH                                0x1
#define _COG3STR_STRB_MASK                                  0x2
#define _COG3STR_STRC_POSN                                  0x2
#define _COG3STR_STRC_POSITION                              0x2
#define _COG3STR_STRC_SIZE                                  0x1
#define _COG3STR_STRC_LENGTH                                0x1
#define _COG3STR_STRC_MASK                                  0x4
#define _COG3STR_STRD_POSN                                  0x3
#define _COG3STR_STRD_POSITION                              0x3
#define _COG3STR_STRD_SIZE                                  0x1
#define _COG3STR_STRD_LENGTH                                0x1
#define _COG3STR_STRD_MASK                                  0x8
#define _COG3STR_SDATA_POSN                                 0x4
#define _COG3STR_SDATA_POSITION                             0x4
#define _COG3STR_SDATA_SIZE                                 0x1
#define _COG3STR_SDATA_LENGTH                               0x1
#define _COG3STR_SDATA_MASK                                 0x10
#define _COG3STR_SDATB_POSN                                 0x5
#define _COG3STR_SDATB_POSITION                             0x5
#define _COG3STR_SDATB_SIZE                                 0x1
#define _COG3STR_SDATB_LENGTH                               0x1
#define _COG3STR_SDATB_MASK                                 0x20
#define _COG3STR_SDATC_POSN                                 0x6
#define _COG3STR_SDATC_POSITION                             0x6
#define _COG3STR_SDATC_SIZE                                 0x1
#define _COG3STR_SDATC_LENGTH                               0x1
#define _COG3STR_SDATC_MASK                                 0x40
#define _COG3STR_SDATD_POSN                                 0x7
#define _COG3STR_SDATD_POSITION                             0x7
#define _COG3STR_SDATD_SIZE                                 0x1
#define _COG3STR_SDATD_LENGTH                               0x1
#define _COG3STR_SDATD_MASK                                 0x80
#define _COG3STR_G3STRA_POSN                                0x0
#define _COG3STR_G3STRA_POSITION                            0x0
#define _COG3STR_G3STRA_SIZE                                0x1
#define _COG3STR_G3STRA_LENGTH                              0x1
#define _COG3STR_G3STRA_MASK                                0x1
#define _COG3STR_G3STRB_POSN                                0x1
#define _COG3STR_G3STRB_POSITION                            0x1
#define _COG3STR_G3STRB_SIZE                                0x1
#define _COG3STR_G3STRB_LENGTH                              0x1
#define _COG3STR_G3STRB_MASK                                0x2
#define _COG3STR_G3STRC_POSN                                0x2
#define _COG3STR_G3STRC_POSITION                            0x2
#define _COG3STR_G3STRC_SIZE                                0x1
#define _COG3STR_G3STRC_LENGTH                              0x1
#define _COG3STR_G3STRC_MASK                                0x4
#define _COG3STR_G3STRD_POSN                                0x3
#define _COG3STR_G3STRD_POSITION                            0x3
#define _COG3STR_G3STRD_SIZE                                0x1
#define _COG3STR_G3STRD_LENGTH                              0x1
#define _COG3STR_G3STRD_MASK                                0x8
#define _COG3STR_G3SDATA_POSN                               0x4
#define _COG3STR_G3SDATA_POSITION                           0x4
#define _COG3STR_G3SDATA_SIZE                               0x1
#define _COG3STR_G3SDATA_LENGTH                             0x1
#define _COG3STR_G3SDATA_MASK                               0x10
#define _COG3STR_G3SDATB_POSN                               0x5
#define _COG3STR_G3SDATB_POSITION                           0x5
#define _COG3STR_G3SDATB_SIZE                               0x1
#define _COG3STR_G3SDATB_LENGTH                             0x1
#define _COG3STR_G3SDATB_MASK                               0x20
#define _COG3STR_G3SDATC_POSN                               0x6
#define _COG3STR_G3SDATC_POSITION                           0x6
#define _COG3STR_G3SDATC_SIZE                               0x1
#define _COG3STR_G3SDATC_LENGTH                             0x1
#define _COG3STR_G3SDATC_MASK                               0x40
#define _COG3STR_G3SDATD_POSN                               0x7
#define _COG3STR_G3SDATD_POSITION                           0x7
#define _COG3STR_G3SDATD_SIZE                               0x1
#define _COG3STR_G3SDATD_LENGTH                             0x1
#define _COG3STR_G3SDATD_MASK                               0x80

// Register: CM4CON0
#define CM4CON0 CM4CON0
extern volatile unsigned char           CM4CON0             __at(0x90C);
#ifndef _LIB_BUILD
asm("CM4CON0 equ 090Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYNC                   :1;
        unsigned HYS                    :1;
        unsigned                        :1;
        unsigned ZLF                    :1;
        unsigned POL                    :1;
        unsigned                        :1;
        unsigned OUT                    :1;
        unsigned ON                     :1;
    };
    struct {
        unsigned C4SYNC                 :1;
        unsigned C4HYS                  :1;
        unsigned                        :1;
        unsigned C4ZLF                  :1;
        unsigned C4POL                  :1;
        unsigned                        :1;
        unsigned C4OUT                  :1;
        unsigned C4ON                   :1;
    };
} CM4CON0bits_t;
extern volatile CM4CON0bits_t CM4CON0bits __at(0x90C);
// bitfield macros
#define _CM4CON0_SYNC_POSN                                  0x0
#define _CM4CON0_SYNC_POSITION                              0x0
#define _CM4CON0_SYNC_SIZE                                  0x1
#define _CM4CON0_SYNC_LENGTH                                0x1
#define _CM4CON0_SYNC_MASK                                  0x1
#define _CM4CON0_HYS_POSN                                   0x1
#define _CM4CON0_HYS_POSITION                               0x1
#define _CM4CON0_HYS_SIZE                                   0x1
#define _CM4CON0_HYS_LENGTH                                 0x1
#define _CM4CON0_HYS_MASK                                   0x2
#define _CM4CON0_ZLF_POSN                                   0x3
#define _CM4CON0_ZLF_POSITION                               0x3
#define _CM4CON0_ZLF_SIZE                                   0x1
#define _CM4CON0_ZLF_LENGTH                                 0x1
#define _CM4CON0_ZLF_MASK                                   0x8
#define _CM4CON0_POL_POSN                                   0x4
#define _CM4CON0_POL_POSITION                               0x4
#define _CM4CON0_POL_SIZE                                   0x1
#define _CM4CON0_POL_LENGTH                                 0x1
#define _CM4CON0_POL_MASK                                   0x10
#define _CM4CON0_OUT_POSN                                   0x6
#define _CM4CON0_OUT_POSITION                               0x6
#define _CM4CON0_OUT_SIZE                                   0x1
#define _CM4CON0_OUT_LENGTH                                 0x1
#define _CM4CON0_OUT_MASK                                   0x40
#define _CM4CON0_ON_POSN                                    0x7
#define _CM4CON0_ON_POSITION                                0x7
#define _CM4CON0_ON_SIZE                                    0x1
#define _CM4CON0_ON_LENGTH                                  0x1
#define _CM4CON0_ON_MASK                                    0x80
#define _CM4CON0_C4SYNC_POSN                                0x0
#define _CM4CON0_C4SYNC_POSITION                            0x0
#define _CM4CON0_C4SYNC_SIZE                                0x1
#define _CM4CON0_C4SYNC_LENGTH                              0x1
#define _CM4CON0_C4SYNC_MASK                                0x1
#define _CM4CON0_C4HYS_POSN                                 0x1
#define _CM4CON0_C4HYS_POSITION                             0x1
#define _CM4CON0_C4HYS_SIZE                                 0x1
#define _CM4CON0_C4HYS_LENGTH                               0x1
#define _CM4CON0_C4HYS_MASK                                 0x2
#define _CM4CON0_C4ZLF_POSN                                 0x3
#define _CM4CON0_C4ZLF_POSITION                             0x3
#define _CM4CON0_C4ZLF_SIZE                                 0x1
#define _CM4CON0_C4ZLF_LENGTH                               0x1
#define _CM4CON0_C4ZLF_MASK                                 0x8
#define _CM4CON0_C4POL_POSN                                 0x4
#define _CM4CON0_C4POL_POSITION                             0x4
#define _CM4CON0_C4POL_SIZE                                 0x1
#define _CM4CON0_C4POL_LENGTH                               0x1
#define _CM4CON0_C4POL_MASK                                 0x10
#define _CM4CON0_C4OUT_POSN                                 0x6
#define _CM4CON0_C4OUT_POSITION                             0x6
#define _CM4CON0_C4OUT_SIZE                                 0x1
#define _CM4CON0_C4OUT_LENGTH                               0x1
#define _CM4CON0_C4OUT_MASK                                 0x40
#define _CM4CON0_C4ON_POSN                                  0x7
#define _CM4CON0_C4ON_POSITION                              0x7
#define _CM4CON0_C4ON_SIZE                                  0x1
#define _CM4CON0_C4ON_LENGTH                                0x1
#define _CM4CON0_C4ON_MASK                                  0x80

// Register: CM4CON1
#define CM4CON1 CM4CON1
extern volatile unsigned char           CM4CON1             __at(0x90D);
#ifndef _LIB_BUILD
asm("CM4CON1 equ 090Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
    };
    struct {
        unsigned C4INTN                 :1;
        unsigned C4INTP                 :1;
    };
} CM4CON1bits_t;
extern volatile CM4CON1bits_t CM4CON1bits __at(0x90D);
// bitfield macros
#define _CM4CON1_INTN_POSN                                  0x0
#define _CM4CON1_INTN_POSITION                              0x0
#define _CM4CON1_INTN_SIZE                                  0x1
#define _CM4CON1_INTN_LENGTH                                0x1
#define _CM4CON1_INTN_MASK                                  0x1
#define _CM4CON1_INTP_POSN                                  0x1
#define _CM4CON1_INTP_POSITION                              0x1
#define _CM4CON1_INTP_SIZE                                  0x1
#define _CM4CON1_INTP_LENGTH                                0x1
#define _CM4CON1_INTP_MASK                                  0x2
#define _CM4CON1_C4INTN_POSN                                0x0
#define _CM4CON1_C4INTN_POSITION                            0x0
#define _CM4CON1_C4INTN_SIZE                                0x1
#define _CM4CON1_C4INTN_LENGTH                              0x1
#define _CM4CON1_C4INTN_MASK                                0x1
#define _CM4CON1_C4INTP_POSN                                0x1
#define _CM4CON1_C4INTP_POSITION                            0x1
#define _CM4CON1_C4INTP_SIZE                                0x1
#define _CM4CON1_C4INTP_LENGTH                              0x1
#define _CM4CON1_C4INTP_MASK                                0x2

// Register: CM4NSEL
#define CM4NSEL CM4NSEL
extern volatile unsigned char           CM4NSEL             __at(0x90E);
#ifndef _LIB_BUILD
asm("CM4NSEL equ 090Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :4;
    };
    struct {
        unsigned C4NCH                  :4;
    };
    struct {
        unsigned C4NCH0                 :1;
        unsigned C4NCH1                 :1;
        unsigned C4NCH2                 :1;
        unsigned C4NCH3                 :1;
    };
} CM4NSELbits_t;
