MikroElektronika/core_packages/PIC/XC8/def/PIC16F1778/mcu.h
extern volatile PWM11DCLbits_t PWM11DCLbits __at(0xDB3);
// bitfield macros
#define _PWM11DCL_DC_POSN                                   0x0
#define _PWM11DCL_DC_POSITION                               0x0
#define _PWM11DCL_DC_SIZE                                   0x8
#define _PWM11DCL_DC_LENGTH                                 0x8
#define _PWM11DCL_DC_MASK                                   0xFF
#define _PWM11DCL_PWM11DCL0_POSN                            0x0
#define _PWM11DCL_PWM11DCL0_POSITION                        0x0
#define _PWM11DCL_PWM11DCL0_SIZE                            0x1
#define _PWM11DCL_PWM11DCL0_LENGTH                          0x1
#define _PWM11DCL_PWM11DCL0_MASK                            0x1
#define _PWM11DCL_PWM11DCL1_POSN                            0x1
#define _PWM11DCL_PWM11DCL1_POSITION                        0x1
#define _PWM11DCL_PWM11DCL1_SIZE                            0x1
#define _PWM11DCL_PWM11DCL1_LENGTH                          0x1
#define _PWM11DCL_PWM11DCL1_MASK                            0x2
#define _PWM11DCL_PWM11DCL2_POSN                            0x2
#define _PWM11DCL_PWM11DCL2_POSITION                        0x2
#define _PWM11DCL_PWM11DCL2_SIZE                            0x1
#define _PWM11DCL_PWM11DCL2_LENGTH                          0x1
#define _PWM11DCL_PWM11DCL2_MASK                            0x4
#define _PWM11DCL_PWM11DCL3_POSN                            0x3
#define _PWM11DCL_PWM11DCL3_POSITION                        0x3
#define _PWM11DCL_PWM11DCL3_SIZE                            0x1
#define _PWM11DCL_PWM11DCL3_LENGTH                          0x1
#define _PWM11DCL_PWM11DCL3_MASK                            0x8
#define _PWM11DCL_PWM11DCL4_POSN                            0x4
#define _PWM11DCL_PWM11DCL4_POSITION                        0x4
#define _PWM11DCL_PWM11DCL4_SIZE                            0x1
#define _PWM11DCL_PWM11DCL4_LENGTH                          0x1
#define _PWM11DCL_PWM11DCL4_MASK                            0x10
#define _PWM11DCL_PWM11DCL5_POSN                            0x5
#define _PWM11DCL_PWM11DCL5_POSITION                        0x5
#define _PWM11DCL_PWM11DCL5_SIZE                            0x1
#define _PWM11DCL_PWM11DCL5_LENGTH                          0x1
#define _PWM11DCL_PWM11DCL5_MASK                            0x20
#define _PWM11DCL_PWM11DCL6_POSN                            0x6
#define _PWM11DCL_PWM11DCL6_POSITION                        0x6
#define _PWM11DCL_PWM11DCL6_SIZE                            0x1
#define _PWM11DCL_PWM11DCL6_LENGTH                          0x1
#define _PWM11DCL_PWM11DCL6_MASK                            0x40
#define _PWM11DCL_PWM11DCL7_POSN                            0x7
#define _PWM11DCL_PWM11DCL7_POSITION                        0x7
#define _PWM11DCL_PWM11DCL7_SIZE                            0x1
#define _PWM11DCL_PWM11DCL7_LENGTH                          0x1
#define _PWM11DCL_PWM11DCL7_MASK                            0x80
#define _PWM11DCL_PWM11DCL_POSN                             0x0
#define _PWM11DCL_PWM11DCL_POSITION                         0x0
#define _PWM11DCL_PWM11DCL_SIZE                             0x8
#define _PWM11DCL_PWM11DCL_LENGTH                           0x8
#define _PWM11DCL_PWM11DCL_MASK                             0xFF

// Register: PWM11DCH
#define PWM11DCH PWM11DCH
extern volatile unsigned char           PWM11DCH            __at(0xDB4);
#ifndef _LIB_BUILD
asm("PWM11DCH equ 0DB4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM11DCH0              :1;
        unsigned PWM11DCH1              :1;
        unsigned PWM11DCH2              :1;
        unsigned PWM11DCH3              :1;
        unsigned PWM11DCH4              :1;
        unsigned PWM11DCH5              :1;
        unsigned PWM11DCH6              :1;
        unsigned PWM11DCH7              :1;
    };
    struct {
        unsigned PWM11DCH               :8;
    };
} PWM11DCHbits_t;
extern volatile PWM11DCHbits_t PWM11DCHbits __at(0xDB4);
// bitfield macros
#define _PWM11DCH_DC_POSN                                   0x0
#define _PWM11DCH_DC_POSITION                               0x0
#define _PWM11DCH_DC_SIZE                                   0x8
#define _PWM11DCH_DC_LENGTH                                 0x8
#define _PWM11DCH_DC_MASK                                   0xFF
#define _PWM11DCH_PWM11DCH0_POSN                            0x0
#define _PWM11DCH_PWM11DCH0_POSITION                        0x0
#define _PWM11DCH_PWM11DCH0_SIZE                            0x1
#define _PWM11DCH_PWM11DCH0_LENGTH                          0x1
#define _PWM11DCH_PWM11DCH0_MASK                            0x1
#define _PWM11DCH_PWM11DCH1_POSN                            0x1
#define _PWM11DCH_PWM11DCH1_POSITION                        0x1
#define _PWM11DCH_PWM11DCH1_SIZE                            0x1
#define _PWM11DCH_PWM11DCH1_LENGTH                          0x1
#define _PWM11DCH_PWM11DCH1_MASK                            0x2
#define _PWM11DCH_PWM11DCH2_POSN                            0x2
#define _PWM11DCH_PWM11DCH2_POSITION                        0x2
#define _PWM11DCH_PWM11DCH2_SIZE                            0x1
#define _PWM11DCH_PWM11DCH2_LENGTH                          0x1
#define _PWM11DCH_PWM11DCH2_MASK                            0x4
#define _PWM11DCH_PWM11DCH3_POSN                            0x3
#define _PWM11DCH_PWM11DCH3_POSITION                        0x3
#define _PWM11DCH_PWM11DCH3_SIZE                            0x1
#define _PWM11DCH_PWM11DCH3_LENGTH                          0x1
#define _PWM11DCH_PWM11DCH3_MASK                            0x8
#define _PWM11DCH_PWM11DCH4_POSN                            0x4
#define _PWM11DCH_PWM11DCH4_POSITION                        0x4
#define _PWM11DCH_PWM11DCH4_SIZE                            0x1
#define _PWM11DCH_PWM11DCH4_LENGTH                          0x1
#define _PWM11DCH_PWM11DCH4_MASK                            0x10
#define _PWM11DCH_PWM11DCH5_POSN                            0x5
#define _PWM11DCH_PWM11DCH5_POSITION                        0x5
#define _PWM11DCH_PWM11DCH5_SIZE                            0x1
#define _PWM11DCH_PWM11DCH5_LENGTH                          0x1
#define _PWM11DCH_PWM11DCH5_MASK                            0x20
#define _PWM11DCH_PWM11DCH6_POSN                            0x6
#define _PWM11DCH_PWM11DCH6_POSITION                        0x6
#define _PWM11DCH_PWM11DCH6_SIZE                            0x1
#define _PWM11DCH_PWM11DCH6_LENGTH                          0x1
#define _PWM11DCH_PWM11DCH6_MASK                            0x40
#define _PWM11DCH_PWM11DCH7_POSN                            0x7
#define _PWM11DCH_PWM11DCH7_POSITION                        0x7
#define _PWM11DCH_PWM11DCH7_SIZE                            0x1
#define _PWM11DCH_PWM11DCH7_LENGTH                          0x1
#define _PWM11DCH_PWM11DCH7_MASK                            0x80
#define _PWM11DCH_PWM11DCH_POSN                             0x0
#define _PWM11DCH_PWM11DCH_POSITION                         0x0
#define _PWM11DCH_PWM11DCH_SIZE                             0x8
#define _PWM11DCH_PWM11DCH_LENGTH                           0x8
#define _PWM11DCH_PWM11DCH_MASK                             0xFF

// Register: PWM11PR
#define PWM11PR PWM11PR
extern volatile unsigned short          PWM11PR             __at(0xDB5);
#ifndef _LIB_BUILD
asm("PWM11PR equ 0DB5h");
#endif

// Register: PWM11PRL
#define PWM11PRL PWM11PRL
extern volatile unsigned char           PWM11PRL            __at(0xDB5);
#ifndef _LIB_BUILD
asm("PWM11PRL equ 0DB5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PWM11PRL0              :1;
        unsigned PWM11PRL1              :1;
        unsigned PWM11PRL2              :1;
        unsigned PWM11PRL3              :1;
        unsigned PWM11PRL4              :1;
        unsigned PWM11PRL5              :1;
        unsigned PWM11PRL6              :1;
        unsigned PWM11PRL7              :1;
    };
    struct {
        unsigned PWM11PRL               :8;
    };
} PWM11PRLbits_t;
