MikroElektronika/core_packages/PIC/XC8/def/PIC16F1778/mcu.h
extern volatile PWM11INTCONbits_t PWM11INTCONbits __at(0xDBC);
// bitfield macros
#define _PWM11INTCON_PRIE_POSN                              0x0
#define _PWM11INTCON_PRIE_POSITION                          0x0
#define _PWM11INTCON_PRIE_SIZE                              0x1
#define _PWM11INTCON_PRIE_LENGTH                            0x1
#define _PWM11INTCON_PRIE_MASK                              0x1
#define _PWM11INTCON_DCIE_POSN                              0x1
#define _PWM11INTCON_DCIE_POSITION                          0x1
#define _PWM11INTCON_DCIE_SIZE                              0x1
#define _PWM11INTCON_DCIE_LENGTH                            0x1
#define _PWM11INTCON_DCIE_MASK                              0x2
#define _PWM11INTCON_PHIE_POSN                              0x2
#define _PWM11INTCON_PHIE_POSITION                          0x2
#define _PWM11INTCON_PHIE_SIZE                              0x1
#define _PWM11INTCON_PHIE_LENGTH                            0x1
#define _PWM11INTCON_PHIE_MASK                              0x4
#define _PWM11INTCON_OFIE_POSN                              0x3
#define _PWM11INTCON_OFIE_POSITION                          0x3
#define _PWM11INTCON_OFIE_SIZE                              0x1
#define _PWM11INTCON_OFIE_LENGTH                            0x1
#define _PWM11INTCON_OFIE_MASK                              0x8
#define _PWM11INTCON_PWM11PRIE_POSN                         0x0
#define _PWM11INTCON_PWM11PRIE_POSITION                     0x0
#define _PWM11INTCON_PWM11PRIE_SIZE                         0x1
#define _PWM11INTCON_PWM11PRIE_LENGTH                       0x1
#define _PWM11INTCON_PWM11PRIE_MASK                         0x1
#define _PWM11INTCON_PWM11DCIE_POSN                         0x1
#define _PWM11INTCON_PWM11DCIE_POSITION                     0x1
#define _PWM11INTCON_PWM11DCIE_SIZE                         0x1
#define _PWM11INTCON_PWM11DCIE_LENGTH                       0x1
#define _PWM11INTCON_PWM11DCIE_MASK                         0x2
#define _PWM11INTCON_PWM11PHIE_POSN                         0x2
#define _PWM11INTCON_PWM11PHIE_POSITION                     0x2
#define _PWM11INTCON_PWM11PHIE_SIZE                         0x1
#define _PWM11INTCON_PWM11PHIE_LENGTH                       0x1
#define _PWM11INTCON_PWM11PHIE_MASK                         0x4
#define _PWM11INTCON_PWM11OFIE_POSN                         0x3
#define _PWM11INTCON_PWM11OFIE_POSITION                     0x3
#define _PWM11INTCON_PWM11OFIE_SIZE                         0x1
#define _PWM11INTCON_PWM11OFIE_LENGTH                       0x1
#define _PWM11INTCON_PWM11OFIE_MASK                         0x8

// Register: PWM11INTF
#define PWM11INTF PWM11INTF
extern volatile unsigned char           PWM11INTF           __at(0xDBD);
#ifndef _LIB_BUILD
asm("PWM11INTF equ 0DBDh");
#endif
// aliases
extern volatile unsigned char           PWM11INTFLG         __at(0xDBD);
#ifndef _LIB_BUILD
asm("PWM11INTFLG equ 0DBDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM11PRIF              :1;
        unsigned PWM11DCIF              :1;
        unsigned PWM11PHIF              :1;
        unsigned PWM11OFIF              :1;
    };
} PWM11INTFbits_t;
extern volatile PWM11INTFbits_t PWM11INTFbits __at(0xDBD);
// bitfield macros
#define _PWM11INTF_PRIF_POSN                                0x0
#define _PWM11INTF_PRIF_POSITION                            0x0
#define _PWM11INTF_PRIF_SIZE                                0x1
#define _PWM11INTF_PRIF_LENGTH                              0x1
#define _PWM11INTF_PRIF_MASK                                0x1
#define _PWM11INTF_DCIF_POSN                                0x1
#define _PWM11INTF_DCIF_POSITION                            0x1
#define _PWM11INTF_DCIF_SIZE                                0x1
#define _PWM11INTF_DCIF_LENGTH                              0x1
#define _PWM11INTF_DCIF_MASK                                0x2
#define _PWM11INTF_PHIF_POSN                                0x2
#define _PWM11INTF_PHIF_POSITION                            0x2
#define _PWM11INTF_PHIF_SIZE                                0x1
#define _PWM11INTF_PHIF_LENGTH                              0x1
#define _PWM11INTF_PHIF_MASK                                0x4
#define _PWM11INTF_OFIF_POSN                                0x3
#define _PWM11INTF_OFIF_POSITION                            0x3
#define _PWM11INTF_OFIF_SIZE                                0x1
#define _PWM11INTF_OFIF_LENGTH                              0x1
#define _PWM11INTF_OFIF_MASK                                0x8
#define _PWM11INTF_PWM11PRIF_POSN                           0x0
#define _PWM11INTF_PWM11PRIF_POSITION                       0x0
#define _PWM11INTF_PWM11PRIF_SIZE                           0x1
#define _PWM11INTF_PWM11PRIF_LENGTH                         0x1
#define _PWM11INTF_PWM11PRIF_MASK                           0x1
#define _PWM11INTF_PWM11DCIF_POSN                           0x1
#define _PWM11INTF_PWM11DCIF_POSITION                       0x1
#define _PWM11INTF_PWM11DCIF_SIZE                           0x1
#define _PWM11INTF_PWM11DCIF_LENGTH                         0x1
#define _PWM11INTF_PWM11DCIF_MASK                           0x2
#define _PWM11INTF_PWM11PHIF_POSN                           0x2
#define _PWM11INTF_PWM11PHIF_POSITION                       0x2
#define _PWM11INTF_PWM11PHIF_SIZE                           0x1
#define _PWM11INTF_PWM11PHIF_LENGTH                         0x1
#define _PWM11INTF_PWM11PHIF_MASK                           0x4
#define _PWM11INTF_PWM11OFIF_POSN                           0x3
#define _PWM11INTF_PWM11OFIF_POSITION                       0x3
#define _PWM11INTF_PWM11OFIF_SIZE                           0x1
#define _PWM11INTF_PWM11OFIF_LENGTH                         0x1
#define _PWM11INTF_PWM11OFIF_MASK                           0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM11PRIF              :1;
        unsigned PWM11DCIF              :1;
        unsigned PWM11PHIF              :1;
        unsigned PWM11OFIF              :1;
    };
} PWM11INTFLGbits_t;
