MikroElektronika/core_packages/PIC/XC8/def/PIC16F1778/mcu.h
extern volatile COG1INPPSbits_t COG1INPPSbits __at(0xE1D);
// bitfield macros
#define _COG1INPPS_COG1INPPS_POSN                           0x0
#define _COG1INPPS_COG1INPPS_POSITION                       0x0
#define _COG1INPPS_COG1INPPS_SIZE                           0x6
#define _COG1INPPS_COG1INPPS_LENGTH                         0x6
#define _COG1INPPS_COG1INPPS_MASK                           0x3F

// Register: COG2INPPS
#define COG2INPPS COG2INPPS
extern volatile unsigned char           COG2INPPS           __at(0xE1E);
#ifndef _LIB_BUILD
asm("COG2INPPS equ 0E1Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned COG2INPPS              :6;
    };
} COG2INPPSbits_t;
extern volatile COG2INPPSbits_t COG2INPPSbits __at(0xE1E);
// bitfield macros
#define _COG2INPPS_COG2INPPS_POSN                           0x0
#define _COG2INPPS_COG2INPPS_POSITION                       0x0
#define _COG2INPPS_COG2INPPS_SIZE                           0x6
#define _COG2INPPS_COG2INPPS_LENGTH                         0x6
#define _COG2INPPS_COG2INPPS_MASK                           0x3F

// Register: COG3INPPS
#define COG3INPPS COG3INPPS
extern volatile unsigned char           COG3INPPS           __at(0xE1F);
#ifndef _LIB_BUILD
asm("COG3INPPS equ 0E1Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned COG3INPPS              :6;
    };
} COG3INPPSbits_t;
extern volatile COG3INPPSbits_t COG3INPPSbits __at(0xE1F);
// bitfield macros
#define _COG3INPPS_COG3INPPS_POSN                           0x0
#define _COG3INPPS_COG3INPPS_POSITION                       0x0
#define _COG3INPPS_COG3INPPS_SIZE                           0x6
#define _COG3INPPS_COG3INPPS_LENGTH                         0x6
#define _COG3INPPS_COG3INPPS_MASK                           0x3F

// Register: MD1CLPPS
#define MD1CLPPS MD1CLPPS
extern volatile unsigned char           MD1CLPPS            __at(0xE21);
#ifndef _LIB_BUILD
asm("MD1CLPPS equ 0E21h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD1CLPPS               :6;
    };
} MD1CLPPSbits_t;
extern volatile MD1CLPPSbits_t MD1CLPPSbits __at(0xE21);
// bitfield macros
#define _MD1CLPPS_MD1CLPPS_POSN                             0x0
#define _MD1CLPPS_MD1CLPPS_POSITION                         0x0
#define _MD1CLPPS_MD1CLPPS_SIZE                             0x6
#define _MD1CLPPS_MD1CLPPS_LENGTH                           0x6
#define _MD1CLPPS_MD1CLPPS_MASK                             0x3F

// Register: MD1CHPPS
#define MD1CHPPS MD1CHPPS
extern volatile unsigned char           MD1CHPPS            __at(0xE22);
#ifndef _LIB_BUILD
asm("MD1CHPPS equ 0E22h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD1CHPPS               :6;
    };
} MD1CHPPSbits_t;
extern volatile MD1CHPPSbits_t MD1CHPPSbits __at(0xE22);
// bitfield macros
#define _MD1CHPPS_MD1CHPPS_POSN                             0x0
#define _MD1CHPPS_MD1CHPPS_POSITION                         0x0
#define _MD1CHPPS_MD1CHPPS_SIZE                             0x6
#define _MD1CHPPS_MD1CHPPS_LENGTH                           0x6
#define _MD1CHPPS_MD1CHPPS_MASK                             0x3F

// Register: MD1MODPPS
#define MD1MODPPS MD1MODPPS
extern volatile unsigned char           MD1MODPPS           __at(0xE23);
#ifndef _LIB_BUILD
asm("MD1MODPPS equ 0E23h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD1MODPPS              :6;
    };
} MD1MODPPSbits_t;
extern volatile MD1MODPPSbits_t MD1MODPPSbits __at(0xE23);
// bitfield macros
#define _MD1MODPPS_MD1MODPPS_POSN                           0x0
#define _MD1MODPPS_MD1MODPPS_POSITION                       0x0
#define _MD1MODPPS_MD1MODPPS_SIZE                           0x6
#define _MD1MODPPS_MD1MODPPS_LENGTH                         0x6
#define _MD1MODPPS_MD1MODPPS_MASK                           0x3F

// Register: MD2CLPPS
#define MD2CLPPS MD2CLPPS
extern volatile unsigned char           MD2CLPPS            __at(0xE24);
#ifndef _LIB_BUILD
asm("MD2CLPPS equ 0E24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD2CLPPS               :6;
    };
} MD2CLPPSbits_t;
extern volatile MD2CLPPSbits_t MD2CLPPSbits __at(0xE24);
// bitfield macros
#define _MD2CLPPS_MD2CLPPS_POSN                             0x0
#define _MD2CLPPS_MD2CLPPS_POSITION                         0x0
#define _MD2CLPPS_MD2CLPPS_SIZE                             0x6
#define _MD2CLPPS_MD2CLPPS_LENGTH                           0x6
#define _MD2CLPPS_MD2CLPPS_MASK                             0x3F

// Register: MD2CHPPS
#define MD2CHPPS MD2CHPPS
extern volatile unsigned char           MD2CHPPS            __at(0xE25);
#ifndef _LIB_BUILD
asm("MD2CHPPS equ 0E25h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD2CHPPS               :6;
    };
} MD2CHPPSbits_t;
extern volatile MD2CHPPSbits_t MD2CHPPSbits __at(0xE25);
// bitfield macros
#define _MD2CHPPS_MD2CHPPS_POSN                             0x0
#define _MD2CHPPS_MD2CHPPS_POSITION                         0x0
#define _MD2CHPPS_MD2CHPPS_SIZE                             0x6
#define _MD2CHPPS_MD2CHPPS_LENGTH                           0x6
#define _MD2CHPPS_MD2CHPPS_MASK                             0x3F

// Register: MD2MODPPS
#define MD2MODPPS MD2MODPPS
extern volatile unsigned char           MD2MODPPS           __at(0xE26);
#ifndef _LIB_BUILD
asm("MD2MODPPS equ 0E26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD2MODPPS              :6;
    };
} MD2MODPPSbits_t;
extern volatile MD2MODPPSbits_t MD2MODPPSbits __at(0xE26);
// bitfield macros
#define _MD2MODPPS_MD2MODPPS_POSN                           0x0
#define _MD2MODPPS_MD2MODPPS_POSITION                       0x0
#define _MD2MODPPS_MD2MODPPS_SIZE                           0x6
#define _MD2MODPPS_MD2MODPPS_LENGTH                         0x6
#define _MD2MODPPS_MD2MODPPS_MASK                           0x3F

// Register: MD3CLPPS
#define MD3CLPPS MD3CLPPS
extern volatile unsigned char           MD3CLPPS            __at(0xE27);
#ifndef _LIB_BUILD
asm("MD3CLPPS equ 0E27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD3CLPPS               :6;
    };
} MD3CLPPSbits_t;
