MikroElektronika/core_packages/PIC/XC8/def/PIC16F1778/mcu.h
extern volatile __bit                   G3DBR0              __at(0x4088);	// @ (0x811 * 8 + 0)
#define                                 G3DBR0_bit          _BIT_ACCESS(COG3DBR,0)
// COG3DBR<G3DBR1>
extern volatile __bit                   G3DBR1              __at(0x4089);	// @ (0x811 * 8 + 1)
#define                                 G3DBR1_bit          _BIT_ACCESS(COG3DBR,1)
// COG3DBR<G3DBR2>
extern volatile __bit                   G3DBR2              __at(0x408A);	// @ (0x811 * 8 + 2)
#define                                 G3DBR2_bit          _BIT_ACCESS(COG3DBR,2)
// COG3DBR<G3DBR3>
extern volatile __bit                   G3DBR3              __at(0x408B);	// @ (0x811 * 8 + 3)
#define                                 G3DBR3_bit          _BIT_ACCESS(COG3DBR,3)
// COG3DBR<G3DBR4>
extern volatile __bit                   G3DBR4              __at(0x408C);	// @ (0x811 * 8 + 4)
#define                                 G3DBR4_bit          _BIT_ACCESS(COG3DBR,4)
// COG3DBR<G3DBR5>
extern volatile __bit                   G3DBR5              __at(0x408D);	// @ (0x811 * 8 + 5)
#define                                 G3DBR5_bit          _BIT_ACCESS(COG3DBR,5)
// COG3CON0<G3EN>
extern volatile __bit                   G3EN                __at(0x409F);	// @ (0x813 * 8 + 7)
#define                                 G3EN_bit            _BIT_ACCESS(COG3CON0,7)
// COG3CON1<G3FDBS>
extern volatile __bit                   G3FDBS              __at(0x40A6);	// @ (0x814 * 8 + 6)
#define                                 G3FDBS_bit          _BIT_ACCESS(COG3CON1,6)
// COG3FIS0<G3FIS0>
extern volatile __bit                   G3FIS0              __at(0x40C8);	// @ (0x819 * 8 + 0)
#define                                 G3FIS0_bit          _BIT_ACCESS(COG3FIS0,0)
// COG3FIS0<G3FIS1>
extern volatile __bit                   G3FIS1              __at(0x40C9);	// @ (0x819 * 8 + 1)
#define                                 G3FIS1_bit          _BIT_ACCESS(COG3FIS0,1)
// COG3FIS1<G3FIS11>
extern volatile __bit                   G3FIS11             __at(0x40D3);	// @ (0x81A * 8 + 3)
#define                                 G3FIS11_bit         _BIT_ACCESS(COG3FIS1,3)
// COG3FIS1<G3FIS12>
extern volatile __bit                   G3FIS12             __at(0x40D4);	// @ (0x81A * 8 + 4)
#define                                 G3FIS12_bit         _BIT_ACCESS(COG3FIS1,4)
// COG3FIS1<G3FIS13>
extern volatile __bit                   G3FIS13             __at(0x40D5);	// @ (0x81A * 8 + 5)
#define                                 G3FIS13_bit         _BIT_ACCESS(COG3FIS1,5)
// COG3FIS1<G3FIS14>
extern volatile __bit                   G3FIS14             __at(0x40D6);	// @ (0x81A * 8 + 6)
#define                                 G3FIS14_bit         _BIT_ACCESS(COG3FIS1,6)
// COG3FIS1<G3FIS15>
extern volatile __bit                   G3FIS15             __at(0x40D7);	// @ (0x81A * 8 + 7)
#define                                 G3FIS15_bit         _BIT_ACCESS(COG3FIS1,7)
// COG3FIS0<G3FIS2>
extern volatile __bit                   G3FIS2              __at(0x40CA);	// @ (0x819 * 8 + 2)
#define                                 G3FIS2_bit          _BIT_ACCESS(COG3FIS0,2)
// COG3FIS0<G3FIS3>
extern volatile __bit                   G3FIS3              __at(0x40CB);	// @ (0x819 * 8 + 3)
#define                                 G3FIS3_bit          _BIT_ACCESS(COG3FIS0,3)
// COG3FIS0<G3FIS4>
extern volatile __bit                   G3FIS4              __at(0x40CC);	// @ (0x819 * 8 + 4)
#define                                 G3FIS4_bit          _BIT_ACCESS(COG3FIS0,4)
// COG3FIS0<G3FIS5>
extern volatile __bit                   G3FIS5              __at(0x40CD);	// @ (0x819 * 8 + 5)
#define                                 G3FIS5_bit          _BIT_ACCESS(COG3FIS0,5)
// COG3FIS0<G3FIS6>
extern volatile __bit                   G3FIS6              __at(0x40CE);	// @ (0x819 * 8 + 6)
#define                                 G3FIS6_bit          _BIT_ACCESS(COG3FIS0,6)
// COG3FIS0<G3FIS7>
extern volatile __bit                   G3FIS7              __at(0x40CF);	// @ (0x819 * 8 + 7)
#define                                 G3FIS7_bit          _BIT_ACCESS(COG3FIS0,7)
// COG3FIS1<G3FIS9>
extern volatile __bit                   G3FIS9              __at(0x40D1);	// @ (0x81A * 8 + 1)
#define                                 G3FIS9_bit          _BIT_ACCESS(COG3FIS1,1)
// COG3FSIM0<G3FSIM0>
extern volatile __bit                   G3FSIM0             __at(0x40D8);	// @ (0x81B * 8 + 0)
#define                                 G3FSIM0_bit         _BIT_ACCESS(COG3FSIM0,0)
// COG3FSIM0<G3FSIM1>
extern volatile __bit                   G3FSIM1             __at(0x40D9);	// @ (0x81B * 8 + 1)
#define                                 G3FSIM1_bit         _BIT_ACCESS(COG3FSIM0,1)
// COG3FSIM1<G3FSIM11>
extern volatile __bit                   G3FSIM11            __at(0x40E3);	// @ (0x81C * 8 + 3)
#define                                 G3FSIM11_bit        _BIT_ACCESS(COG3FSIM1,3)
// COG3FSIM1<G3FSIM12>
extern volatile __bit                   G3FSIM12            __at(0x40E4);	// @ (0x81C * 8 + 4)
#define                                 G3FSIM12_bit        _BIT_ACCESS(COG3FSIM1,4)
// COG3FSIM1<G3FSIM13>
extern volatile __bit                   G3FSIM13            __at(0x40E5);	// @ (0x81C * 8 + 5)
#define                                 G3FSIM13_bit        _BIT_ACCESS(COG3FSIM1,5)
// COG3FSIM1<G3FSIM14>
extern volatile __bit                   G3FSIM14            __at(0x40E6);	// @ (0x81C * 8 + 6)
#define                                 G3FSIM14_bit        _BIT_ACCESS(COG3FSIM1,6)
// COG3FSIM1<G3FSIM15>
extern volatile __bit                   G3FSIM15            __at(0x40E7);	// @ (0x81C * 8 + 7)
#define                                 G3FSIM15_bit        _BIT_ACCESS(COG3FSIM1,7)
// COG3FSIM0<G3FSIM2>
extern volatile __bit                   G3FSIM2             __at(0x40DA);	// @ (0x81B * 8 + 2)
#define                                 G3FSIM2_bit         _BIT_ACCESS(COG3FSIM0,2)
// COG3FSIM0<G3FSIM3>
extern volatile __bit                   G3FSIM3             __at(0x40DB);	// @ (0x81B * 8 + 3)
#define                                 G3FSIM3_bit         _BIT_ACCESS(COG3FSIM0,3)
// COG3FSIM0<G3FSIM4>
extern volatile __bit                   G3FSIM4             __at(0x40DC);	// @ (0x81B * 8 + 4)
#define                                 G3FSIM4_bit         _BIT_ACCESS(COG3FSIM0,4)
// COG3FSIM0<G3FSIM5>
extern volatile __bit                   G3FSIM5             __at(0x40DD);	// @ (0x81B * 8 + 5)
#define                                 G3FSIM5_bit         _BIT_ACCESS(COG3FSIM0,5)
// COG3FSIM0<G3FSIM6>
extern volatile __bit                   G3FSIM6             __at(0x40DE);	// @ (0x81B * 8 + 6)
#define                                 G3FSIM6_bit         _BIT_ACCESS(COG3FSIM0,6)
// COG3FSIM0<G3FSIM7>
extern volatile __bit                   G3FSIM7             __at(0x40DF);	// @ (0x81B * 8 + 7)
#define                                 G3FSIM7_bit         _BIT_ACCESS(COG3FSIM0,7)
// COG3FSIM1<G3FSIM9>
extern volatile __bit                   G3FSIM9             __at(0x40E1);	// @ (0x81C * 8 + 1)
#define                                 G3FSIM9_bit         _BIT_ACCESS(COG3FSIM1,1)
// COG3CON0<G3LD>
extern volatile __bit                   G3LD                __at(0x409E);	// @ (0x813 * 8 + 6)
#define                                 G3LD_bit            _BIT_ACCESS(COG3CON0,6)
// COG3CON0<G3MD0>
extern volatile __bit                   G3MD0               __at(0x4098);	// @ (0x813 * 8 + 0)
#define                                 G3MD0_bit           _BIT_ACCESS(COG3CON0,0)
// COG3CON0<G3MD1>
extern volatile __bit                   G3MD1               __at(0x4099);	// @ (0x813 * 8 + 1)
#define                                 G3MD1_bit           _BIT_ACCESS(COG3CON0,1)
// COG3CON0<G3MD2>
extern volatile __bit                   G3MD2               __at(0x409A);	// @ (0x813 * 8 + 2)
#define                                 G3MD2_bit           _BIT_ACCESS(COG3CON0,2)
// COG3PHF<G3PHF0>
extern volatile __bit                   G3PHF0              __at(0x4070);	// @ (0x80E * 8 + 0)
#define                                 G3PHF0_bit          _BIT_ACCESS(COG3PHF,0)
// COG3PHF<G3PHF1>
extern volatile __bit                   G3PHF1              __at(0x4071);	// @ (0x80E * 8 + 1)
#define                                 G3PHF1_bit          _BIT_ACCESS(COG3PHF,1)
// COG3PHF<G3PHF2>
extern volatile __bit                   G3PHF2              __at(0x4072);	// @ (0x80E * 8 + 2)
#define                                 G3PHF2_bit          _BIT_ACCESS(COG3PHF,2)
// COG3PHF<G3PHF3>
extern volatile __bit                   G3PHF3              __at(0x4073);	// @ (0x80E * 8 + 3)
#define                                 G3PHF3_bit          _BIT_ACCESS(COG3PHF,3)
// COG3PHF<G3PHF4>
extern volatile __bit                   G3PHF4              __at(0x4074);	// @ (0x80E * 8 + 4)
#define                                 G3PHF4_bit          _BIT_ACCESS(COG3PHF,4)
// COG3PHF<G3PHF5>
extern volatile __bit                   G3PHF5              __at(0x4075);	// @ (0x80E * 8 + 5)
#define                                 G3PHF5_bit          _BIT_ACCESS(COG3PHF,5)
// COG3PHR<G3PHR0>
extern volatile __bit                   G3PHR0              __at(0x4068);	// @ (0x80D * 8 + 0)
#define                                 G3PHR0_bit          _BIT_ACCESS(COG3PHR,0)
// COG3PHR<G3PHR1>
extern volatile __bit                   G3PHR1              __at(0x4069);	// @ (0x80D * 8 + 1)
#define                                 G3PHR1_bit          _BIT_ACCESS(COG3PHR,1)
// COG3PHR<G3PHR2>
extern volatile __bit                   G3PHR2              __at(0x406A);	// @ (0x80D * 8 + 2)
#define                                 G3PHR2_bit          _BIT_ACCESS(COG3PHR,2)
// COG3PHR<G3PHR3>
extern volatile __bit                   G3PHR3              __at(0x406B);	// @ (0x80D * 8 + 3)
#define                                 G3PHR3_bit          _BIT_ACCESS(COG3PHR,3)
// COG3PHR<G3PHR4>
extern volatile __bit                   G3PHR4              __at(0x406C);	// @ (0x80D * 8 + 4)
#define                                 G3PHR4_bit          _BIT_ACCESS(COG3PHR,4)
// COG3PHR<G3PHR5>
extern volatile __bit                   G3PHR5              __at(0x406D);	// @ (0x80D * 8 + 5)
#define                                 G3PHR5_bit          _BIT_ACCESS(COG3PHR,5)
// COG3CON1<G3POLA>
extern volatile __bit                   G3POLA              __at(0x40A0);	// @ (0x814 * 8 + 0)
#define                                 G3POLA_bit          _BIT_ACCESS(COG3CON1,0)
// COG3CON1<G3POLB>
extern volatile __bit                   G3POLB              __at(0x40A1);	// @ (0x814 * 8 + 1)
#define                                 G3POLB_bit          _BIT_ACCESS(COG3CON1,1)
// COG3CON1<G3POLC>
extern volatile __bit                   G3POLC              __at(0x40A2);	// @ (0x814 * 8 + 2)
#define                                 G3POLC_bit          _BIT_ACCESS(COG3CON1,2)
// COG3CON1<G3POLD>
extern volatile __bit                   G3POLD              __at(0x40A3);	// @ (0x814 * 8 + 3)
#define                                 G3POLD_bit          _BIT_ACCESS(COG3CON1,3)
// COG3CON1<G3RDBS>
extern volatile __bit                   G3RDBS              __at(0x40A7);	// @ (0x814 * 8 + 7)
#define                                 G3RDBS_bit          _BIT_ACCESS(COG3CON1,7)
// COG3RIS0<G3RIS0>
extern volatile __bit                   G3RIS0              __at(0x40A8);	// @ (0x815 * 8 + 0)
#define                                 G3RIS0_bit          _BIT_ACCESS(COG3RIS0,0)
// COG3RIS0<G3RIS1>
extern volatile __bit                   G3RIS1              __at(0x40A9);	// @ (0x815 * 8 + 1)
#define                                 G3RIS1_bit          _BIT_ACCESS(COG3RIS0,1)
// COG3RIS1<G3RIS11>
extern volatile __bit                   G3RIS11             __at(0x40B3);	// @ (0x816 * 8 + 3)
#define                                 G3RIS11_bit         _BIT_ACCESS(COG3RIS1,3)
// COG3RIS1<G3RIS12>
extern volatile __bit                   G3RIS12             __at(0x40B4);	// @ (0x816 * 8 + 4)
#define                                 G3RIS12_bit         _BIT_ACCESS(COG3RIS1,4)
// COG3RIS1<G3RIS13>
extern volatile __bit                   G3RIS13             __at(0x40B5);	// @ (0x816 * 8 + 5)
#define                                 G3RIS13_bit         _BIT_ACCESS(COG3RIS1,5)
// COG3RIS1<G3RIS14>
extern volatile __bit                   G3RIS14             __at(0x40B6);	// @ (0x816 * 8 + 6)
#define                                 G3RIS14_bit         _BIT_ACCESS(COG3RIS1,6)
// COG3RIS1<G3RIS15>
extern volatile __bit                   G3RIS15             __at(0x40B7);	// @ (0x816 * 8 + 7)
#define                                 G3RIS15_bit         _BIT_ACCESS(COG3RIS1,7)
// COG3RIS0<G3RIS2>
extern volatile __bit                   G3RIS2              __at(0x40AA);	// @ (0x815 * 8 + 2)
#define                                 G3RIS2_bit          _BIT_ACCESS(COG3RIS0,2)
// COG3RIS0<G3RIS3>
extern volatile __bit                   G3RIS3              __at(0x40AB);	// @ (0x815 * 8 + 3)
#define                                 G3RIS3_bit          _BIT_ACCESS(COG3RIS0,3)
// COG3RIS0<G3RIS4>
extern volatile __bit                   G3RIS4              __at(0x40AC);	// @ (0x815 * 8 + 4)
#define                                 G3RIS4_bit          _BIT_ACCESS(COG3RIS0,4)
// COG3RIS0<G3RIS5>
extern volatile __bit                   G3RIS5              __at(0x40AD);	// @ (0x815 * 8 + 5)
#define                                 G3RIS5_bit          _BIT_ACCESS(COG3RIS0,5)
// COG3RIS0<G3RIS6>
extern volatile __bit                   G3RIS6              __at(0x40AE);	// @ (0x815 * 8 + 6)
#define                                 G3RIS6_bit          _BIT_ACCESS(COG3RIS0,6)
// COG3RIS0<G3RIS7>
extern volatile __bit                   G3RIS7              __at(0x40AF);	// @ (0x815 * 8 + 7)
#define                                 G3RIS7_bit          _BIT_ACCESS(COG3RIS0,7)
// COG3RIS1<G3RIS9>
extern volatile __bit                   G3RIS9              __at(0x40B1);	// @ (0x816 * 8 + 1)
#define                                 G3RIS9_bit          _BIT_ACCESS(COG3RIS1,1)
// COG3RSIM0<G3RSIM0>
extern volatile __bit                   G3RSIM0             __at(0x40B8);	// @ (0x817 * 8 + 0)
#define                                 G3RSIM0_bit         _BIT_ACCESS(COG3RSIM0,0)
// COG3RSIM0<G3RSIM1>
extern volatile __bit                   G3RSIM1             __at(0x40B9);	// @ (0x817 * 8 + 1)
#define                                 G3RSIM1_bit         _BIT_ACCESS(COG3RSIM0,1)
// COG3RSIM1<G3RSIM11>
extern volatile __bit                   G3RSIM11            __at(0x40C3);	// @ (0x818 * 8 + 3)
#define                                 G3RSIM11_bit        _BIT_ACCESS(COG3RSIM1,3)
// COG3RSIM1<G3RSIM12>
extern volatile __bit                   G3RSIM12            __at(0x40C4);	// @ (0x818 * 8 + 4)
#define                                 G3RSIM12_bit        _BIT_ACCESS(COG3RSIM1,4)
// COG3RSIM1<G3RSIM13>
extern volatile __bit                   G3RSIM13            __at(0x40C5);	// @ (0x818 * 8 + 5)
#define                                 G3RSIM13_bit        _BIT_ACCESS(COG3RSIM1,5)
// COG3RSIM1<G3RSIM14>
extern volatile __bit                   G3RSIM14            __at(0x40C6);	// @ (0x818 * 8 + 6)
#define                                 G3RSIM14_bit        _BIT_ACCESS(COG3RSIM1,6)
// COG3RSIM1<G3RSIM15>
extern volatile __bit                   G3RSIM15            __at(0x40C7);	// @ (0x818 * 8 + 7)
#define                                 G3RSIM15_bit        _BIT_ACCESS(COG3RSIM1,7)
// COG3RSIM0<G3RSIM2>
extern volatile __bit                   G3RSIM2             __at(0x40BA);	// @ (0x817 * 8 + 2)
#define                                 G3RSIM2_bit         _BIT_ACCESS(COG3RSIM0,2)
// COG3RSIM0<G3RSIM3>
extern volatile __bit                   G3RSIM3             __at(0x40BB);	// @ (0x817 * 8 + 3)
#define                                 G3RSIM3_bit         _BIT_ACCESS(COG3RSIM0,3)
// COG3RSIM0<G3RSIM4>
extern volatile __bit                   G3RSIM4             __at(0x40BC);	// @ (0x817 * 8 + 4)
#define                                 G3RSIM4_bit         _BIT_ACCESS(COG3RSIM0,4)
// COG3RSIM0<G3RSIM5>
extern volatile __bit                   G3RSIM5             __at(0x40BD);	// @ (0x817 * 8 + 5)
#define                                 G3RSIM5_bit         _BIT_ACCESS(COG3RSIM0,5)
// COG3RSIM0<G3RSIM6>
extern volatile __bit                   G3RSIM6             __at(0x40BE);	// @ (0x817 * 8 + 6)
#define                                 G3RSIM6_bit         _BIT_ACCESS(COG3RSIM0,6)
// COG3RSIM0<G3RSIM7>
extern volatile __bit                   G3RSIM7             __at(0x40BF);	// @ (0x817 * 8 + 7)
#define                                 G3RSIM7_bit         _BIT_ACCESS(COG3RSIM0,7)
// COG3RSIM1<G3RSIM9>
extern volatile __bit                   G3RSIM9             __at(0x40C1);	// @ (0x818 * 8 + 1)
#define                                 G3RSIM9_bit         _BIT_ACCESS(COG3RSIM1,1)
// COG3STR<G3SDATA>
extern volatile __bit                   G3SDATA             __at(0x40FC);	// @ (0x81F * 8 + 4)
#define                                 G3SDATA_bit         _BIT_ACCESS(COG3STR,4)
// COG3STR<G3SDATB>
extern volatile __bit                   G3SDATB             __at(0x40FD);	// @ (0x81F * 8 + 5)
#define                                 G3SDATB_bit         _BIT_ACCESS(COG3STR,5)
// COG3STR<G3SDATC>
extern volatile __bit                   G3SDATC             __at(0x40FE);	// @ (0x81F * 8 + 6)
#define                                 G3SDATC_bit         _BIT_ACCESS(COG3STR,6)
// COG3STR<G3SDATD>
extern volatile __bit                   G3SDATD             __at(0x40FF);	// @ (0x81F * 8 + 7)
#define                                 G3SDATD_bit         _BIT_ACCESS(COG3STR,7)
// COG3STR<G3STRA>
extern volatile __bit                   G3STRA              __at(0x40F8);	// @ (0x81F * 8 + 0)
#define                                 G3STRA_bit          _BIT_ACCESS(COG3STR,0)
// COG3STR<G3STRB>
extern volatile __bit                   G3STRB              __at(0x40F9);	// @ (0x81F * 8 + 1)
#define                                 G3STRB_bit          _BIT_ACCESS(COG3STR,1)
// COG3STR<G3STRC>
extern volatile __bit                   G3STRC              __at(0x40FA);	// @ (0x81F * 8 + 2)
#define                                 G3STRC_bit          _BIT_ACCESS(COG3STR,2)
// COG3STR<G3STRD>
extern volatile __bit                   G3STRD              __at(0x40FB);	// @ (0x81F * 8 + 3)
#define                                 G3STRD_bit          _BIT_ACCESS(COG3STR,3)
// SSP1CON2<GCEN>
extern volatile __bit                   GCEN                __at(0x10B7);	// @ (0x216 * 8 + 7)
#define                                 GCEN_bit            _BIT_ACCESS(SSP1CON2,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// OSCSTAT<HFIOFL>
extern volatile __bit                   HFIOFL              __at(0x4E3);	// @ (0x9C * 8 + 3)
#define                                 HFIOFL_bit          _BIT_ACCESS(OSCSTAT,3)
// OSCSTAT<HFIOFR>
extern volatile __bit                   HFIOFR              __at(0x4E4);	// @ (0x9C * 8 + 4)
#define                                 HFIOFR_bit          _BIT_ACCESS(OSCSTAT,4)
// OSCSTAT<HFIOFS>
extern volatile __bit                   HFIOFS              __at(0x4E0);	// @ (0x9C * 8 + 0)
#define                                 HFIOFS_bit          _BIT_ACCESS(OSCSTAT,0)
// HIDRVB<HIDB0>
extern volatile __bit                   HIDB0               __at(0x2068);	// @ (0x40D * 8 + 0)
#define                                 HIDB0_bit           _BIT_ACCESS(HIDRVB,0)
// HIDRVB<HIDB1>
extern volatile __bit                   HIDB1               __at(0x2069);	// @ (0x40D * 8 + 1)
#define                                 HIDB1_bit           _BIT_ACCESS(HIDRVB,1)
// INLVLA<INLVA6>
extern volatile __bit                   INLVA6              __at(0x1C66);	// @ (0x38C * 8 + 6)
#define                                 INLVA6_bit          _BIT_ACCESS(INLVLA,6)
// INLVLA<INLVA7>
extern volatile __bit                   INLVA7              __at(0x1C67);	// @ (0x38C * 8 + 7)
#define                                 INLVA7_bit          _BIT_ACCESS(INLVLA,7)
// INLVLB<INLVB0>
extern volatile __bit                   INLVB0              __at(0x1C68);	// @ (0x38D * 8 + 0)
#define                                 INLVB0_bit          _BIT_ACCESS(INLVLB,0)
// INLVLB<INLVB1>
extern volatile __bit                   INLVB1              __at(0x1C69);	// @ (0x38D * 8 + 1)
#define                                 INLVB1_bit          _BIT_ACCESS(INLVLB,1)
// INLVLB<INLVB2>
extern volatile __bit                   INLVB2              __at(0x1C6A);	// @ (0x38D * 8 + 2)
#define                                 INLVB2_bit          _BIT_ACCESS(INLVLB,2)
// INLVLB<INLVB3>
extern volatile __bit                   INLVB3              __at(0x1C6B);	// @ (0x38D * 8 + 3)
#define                                 INLVB3_bit          _BIT_ACCESS(INLVLB,3)
// INLVLA<INLVLA0>
extern volatile __bit                   INLVLA0             __at(0x1C60);	// @ (0x38C * 8 + 0)
#define                                 INLVLA0_bit         _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0x1C61);	// @ (0x38C * 8 + 1)
#define                                 INLVLA1_bit         _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0x1C62);	// @ (0x38C * 8 + 2)
#define                                 INLVLA2_bit         _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0x1C63);	// @ (0x38C * 8 + 3)
#define                                 INLVLA3_bit         _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0x1C64);	// @ (0x38C * 8 + 4)
#define                                 INLVLA4_bit         _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0x1C65);	// @ (0x38C * 8 + 5)
#define                                 INLVLA5_bit         _BIT_ACCESS(INLVLA,5)
// INLVLA<INLVLA6>
extern volatile __bit                   INLVLA6             __at(0x1C66);	// @ (0x38C * 8 + 6)
#define                                 INLVLA6_bit         _BIT_ACCESS(INLVLA,6)
// INLVLA<INLVLA7>
extern volatile __bit                   INLVLA7             __at(0x1C67);	// @ (0x38C * 8 + 7)
#define                                 INLVLA7_bit         _BIT_ACCESS(INLVLA,7)
// INLVLB<INLVLB0>
extern volatile __bit                   INLVLB0             __at(0x1C68);	// @ (0x38D * 8 + 0)
#define                                 INLVLB0_bit         _BIT_ACCESS(INLVLB,0)
// INLVLB<INLVLB1>
extern volatile __bit                   INLVLB1             __at(0x1C69);	// @ (0x38D * 8 + 1)
#define                                 INLVLB1_bit         _BIT_ACCESS(INLVLB,1)
// INLVLB<INLVLB2>
extern volatile __bit                   INLVLB2             __at(0x1C6A);	// @ (0x38D * 8 + 2)
#define                                 INLVLB2_bit         _BIT_ACCESS(INLVLB,2)
// INLVLB<INLVLB3>
extern volatile __bit                   INLVLB3             __at(0x1C6B);	// @ (0x38D * 8 + 3)
#define                                 INLVLB3_bit         _BIT_ACCESS(INLVLB,3)
// INLVLB<INLVLB4>
extern volatile __bit                   INLVLB4             __at(0x1C6C);	// @ (0x38D * 8 + 4)
#define                                 INLVLB4_bit         _BIT_ACCESS(INLVLB,4)
// INLVLB<INLVLB5>
extern volatile __bit                   INLVLB5             __at(0x1C6D);	// @ (0x38D * 8 + 5)
#define                                 INLVLB5_bit         _BIT_ACCESS(INLVLB,5)
// INLVLB<INLVLB6>
extern volatile __bit                   INLVLB6             __at(0x1C6E);	// @ (0x38D * 8 + 6)
