MikroElektronika/core_packages/PIC/XC8/def/PIC16F1778/mcu.h
#define                                 MSK3_bit            _BIT_ACCESS(SSP1MSK,3)
// SSP1MSK<MSK4>
extern volatile __bit                   MSK4                __at(0x109C);	// @ (0x213 * 8 + 4)
#define                                 MSK4_bit            _BIT_ACCESS(SSP1MSK,4)
// SSP1MSK<MSK5>
extern volatile __bit                   MSK5                __at(0x109D);	// @ (0x213 * 8 + 5)
#define                                 MSK5_bit            _BIT_ACCESS(SSP1MSK,5)
// SSP1MSK<MSK6>
extern volatile __bit                   MSK6                __at(0x109E);	// @ (0x213 * 8 + 6)
#define                                 MSK6_bit            _BIT_ACCESS(SSP1MSK,6)
// SSP1MSK<MSK7>
extern volatile __bit                   MSK7                __at(0x109F);	// @ (0x213 * 8 + 7)
#define                                 MSK7_bit            _BIT_ACCESS(SSP1MSK,7)
// ODCONA<ODA0>
extern volatile __bit                   ODA0                __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 ODA0_bit            _BIT_ACCESS(ODCONA,0)
// ODCONA<ODA1>
extern volatile __bit                   ODA1                __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 ODA1_bit            _BIT_ACCESS(ODCONA,1)
// ODCONA<ODA2>
extern volatile __bit                   ODA2                __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 ODA2_bit            _BIT_ACCESS(ODCONA,2)
// ODCONA<ODA3>
extern volatile __bit                   ODA3                __at(0x1463);	// @ (0x28C * 8 + 3)
#define                                 ODA3_bit            _BIT_ACCESS(ODCONA,3)
// ODCONA<ODA4>
extern volatile __bit                   ODA4                __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 ODA4_bit            _BIT_ACCESS(ODCONA,4)
// ODCONA<ODA5>
extern volatile __bit                   ODA5                __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 ODA5_bit            _BIT_ACCESS(ODCONA,5)
// ODCONA<ODA6>
extern volatile __bit                   ODA6                __at(0x1466);	// @ (0x28C * 8 + 6)
#define                                 ODA6_bit            _BIT_ACCESS(ODCONA,6)
// ODCONA<ODA7>
extern volatile __bit                   ODA7                __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 ODA7_bit            _BIT_ACCESS(ODCONA,7)
// ODCONB<ODB0>
extern volatile __bit                   ODB0                __at(0x1468);	// @ (0x28D * 8 + 0)
#define                                 ODB0_bit            _BIT_ACCESS(ODCONB,0)
// ODCONB<ODB1>
extern volatile __bit                   ODB1                __at(0x1469);	// @ (0x28D * 8 + 1)
#define                                 ODB1_bit            _BIT_ACCESS(ODCONB,1)
// ODCONB<ODB2>
extern volatile __bit                   ODB2                __at(0x146A);	// @ (0x28D * 8 + 2)
#define                                 ODB2_bit            _BIT_ACCESS(ODCONB,2)
// ODCONB<ODB3>
extern volatile __bit                   ODB3                __at(0x146B);	// @ (0x28D * 8 + 3)
#define                                 ODB3_bit            _BIT_ACCESS(ODCONB,3)
// ODCONB<ODB4>
extern volatile __bit                   ODB4                __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 ODB4_bit            _BIT_ACCESS(ODCONB,4)
// ODCONB<ODB5>
extern volatile __bit                   ODB5                __at(0x146D);	// @ (0x28D * 8 + 5)
#define                                 ODB5_bit            _BIT_ACCESS(ODCONB,5)
// ODCONB<ODB6>
extern volatile __bit                   ODB6                __at(0x146E);	// @ (0x28D * 8 + 6)
#define                                 ODB6_bit            _BIT_ACCESS(ODCONB,6)
// ODCONB<ODB7>
extern volatile __bit                   ODB7                __at(0x146F);	// @ (0x28D * 8 + 7)
#define                                 ODB7_bit            _BIT_ACCESS(ODCONB,7)
// ODCONC<ODC0>
extern volatile __bit                   ODC0                __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 ODC0_bit            _BIT_ACCESS(ODCONC,0)
// ODCONC<ODC1>
extern volatile __bit                   ODC1                __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 ODC1_bit            _BIT_ACCESS(ODCONC,1)
// ODCONC<ODC2>
extern volatile __bit                   ODC2                __at(0x1472);	// @ (0x28E * 8 + 2)
#define                                 ODC2_bit            _BIT_ACCESS(ODCONC,2)
// ODCONC<ODC3>
extern volatile __bit                   ODC3                __at(0x1473);	// @ (0x28E * 8 + 3)
#define                                 ODC3_bit            _BIT_ACCESS(ODCONC,3)
// ODCONC<ODC4>
extern volatile __bit                   ODC4                __at(0x1474);	// @ (0x28E * 8 + 4)
#define                                 ODC4_bit            _BIT_ACCESS(ODCONC,4)
// ODCONC<ODC5>
extern volatile __bit                   ODC5                __at(0x1475);	// @ (0x28E * 8 + 5)
#define                                 ODC5_bit            _BIT_ACCESS(ODCONC,5)
// ODCONC<ODC6>
extern volatile __bit                   ODC6                __at(0x1476);	// @ (0x28E * 8 + 6)
#define                                 ODC6_bit            _BIT_ACCESS(ODCONC,6)
// ODCONC<ODC7>
extern volatile __bit                   ODC7                __at(0x1477);	// @ (0x28E * 8 + 7)
#define                                 ODC7_bit            _BIT_ACCESS(ODCONC,7)
// RC1STA<OERR>
extern volatile __bit                   OERR                __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RC1STA,1)
// OPA1CON<OPA1EN>
extern volatile __bit                   OPA1EN              __at(0x288F);	// @ (0x511 * 8 + 7)
#define                                 OPA1EN_bit          _BIT_ACCESS(OPA1CON,7)
// OPA1CON<OPA1ORM0>
extern volatile __bit                   OPA1ORM0            __at(0x2888);	// @ (0x511 * 8 + 0)
#define                                 OPA1ORM0_bit        _BIT_ACCESS(OPA1CON,0)
// OPA1CON<OPA1ORM1>
extern volatile __bit                   OPA1ORM1            __at(0x2889);	// @ (0x511 * 8 + 1)
#define                                 OPA1ORM1_bit        _BIT_ACCESS(OPA1CON,1)
// OPA1CON<OPA1ORPOL>
extern volatile __bit                   OPA1ORPOL           __at(0x288A);	// @ (0x511 * 8 + 2)
#define                                 OPA1ORPOL_bit       _BIT_ACCESS(OPA1CON,2)
// OPA1CON<OPA1UG>
extern volatile __bit                   OPA1UG              __at(0x288C);	// @ (0x511 * 8 + 4)
#define                                 OPA1UG_bit          _BIT_ACCESS(OPA1CON,4)
// OPA2CON<OPA2EN>
extern volatile __bit                   OPA2EN              __at(0x28AF);	// @ (0x515 * 8 + 7)
#define                                 OPA2EN_bit          _BIT_ACCESS(OPA2CON,7)
// OPA2CON<OPA2ORM0>
extern volatile __bit                   OPA2ORM0            __at(0x28A8);	// @ (0x515 * 8 + 0)
#define                                 OPA2ORM0_bit        _BIT_ACCESS(OPA2CON,0)
// OPA2CON<OPA2ORM1>
extern volatile __bit                   OPA2ORM1            __at(0x28A9);	// @ (0x515 * 8 + 1)
#define                                 OPA2ORM1_bit        _BIT_ACCESS(OPA2CON,1)
// OPA2CON<OPA2ORPOL>
extern volatile __bit                   OPA2ORPOL           __at(0x28AA);	// @ (0x515 * 8 + 2)
#define                                 OPA2ORPOL_bit       _BIT_ACCESS(OPA2CON,2)
// OPA2CON<OPA2UG>
extern volatile __bit                   OPA2UG              __at(0x28AC);	// @ (0x515 * 8 + 4)
#define                                 OPA2UG_bit          _BIT_ACCESS(OPA2CON,4)
// OPA3CON<OPA3EN>
extern volatile __bit                   OPA3EN              __at(0x28CF);	// @ (0x519 * 8 + 7)
#define                                 OPA3EN_bit          _BIT_ACCESS(OPA3CON,7)
// OPA3CON<OPA3ORM0>
extern volatile __bit                   OPA3ORM0            __at(0x28C8);	// @ (0x519 * 8 + 0)
#define                                 OPA3ORM0_bit        _BIT_ACCESS(OPA3CON,0)
// OPA3CON<OPA3ORM1>
extern volatile __bit                   OPA3ORM1            __at(0x28C9);	// @ (0x519 * 8 + 1)
#define                                 OPA3ORM1_bit        _BIT_ACCESS(OPA3CON,1)
// OPA3CON<OPA3ORPOL>
extern volatile __bit                   OPA3ORPOL           __at(0x28CA);	// @ (0x519 * 8 + 2)
#define                                 OPA3ORPOL_bit       _BIT_ACCESS(OPA3CON,2)
// OPA3CON<OPA3SP>
extern volatile __bit                   OPA3SP              __at(0x28CE);	// @ (0x519 * 8 + 6)
#define                                 OPA3SP_bit          _BIT_ACCESS(OPA3CON,6)
// OPA3CON<OPA3UG>
extern volatile __bit                   OPA3UG              __at(0x28CC);	// @ (0x519 * 8 + 4)
#define                                 OPA3UG_bit          _BIT_ACCESS(OPA3CON,4)
// PIE2<OSFIE>
extern volatile __bit                   OSFIE               __at(0x497);	// @ (0x92 * 8 + 7)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE2,7)
// PIR2<OSFIF>
extern volatile __bit                   OSFIF               __at(0x97);	// @ (0x12 * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR2,7)
// OSCSTAT<OSTS>
extern volatile __bit                   OSTS                __at(0x4E5);	// @ (0x9C * 8 + 5)
#define                                 OSTS_bit            _BIT_ACCESS(OSCSTAT,5)
// CCPTMRS2<P3TSEL0>
extern volatile __bit                   P3TSEL0             __at(0x14F8);	// @ (0x29F * 8 + 0)
#define                                 P3TSEL0_bit         _BIT_ACCESS(CCPTMRS2,0)
// CCPTMRS2<P3TSEL1>
extern volatile __bit                   P3TSEL1             __at(0x14F9);	// @ (0x29F * 8 + 1)
#define                                 P3TSEL1_bit         _BIT_ACCESS(CCPTMRS2,1)
// CCPTMRS2<P4TSEL0>
extern volatile __bit                   P4TSEL0             __at(0x14FA);	// @ (0x29F * 8 + 2)
#define                                 P4TSEL0_bit         _BIT_ACCESS(CCPTMRS2,2)
// CCPTMRS2<P4TSEL1>
extern volatile __bit                   P4TSEL1             __at(0x14FB);	// @ (0x29F * 8 + 3)
#define                                 P4TSEL1_bit         _BIT_ACCESS(CCPTMRS2,3)
// CCPTMRS2<P9TSEL0>
extern volatile __bit                   P9TSEL0             __at(0x14FC);	// @ (0x29F * 8 + 4)
#define                                 P9TSEL0_bit         _BIT_ACCESS(CCPTMRS2,4)
// CCPTMRS2<P9TSEL1>
extern volatile __bit                   P9TSEL1             __at(0x14FD);	// @ (0x29F * 8 + 5)
#define                                 P9TSEL1_bit         _BIT_ACCESS(CCPTMRS2,5)
// SSP1CON3<PCIE>
extern volatile __bit                   PCIE                __at(0x10BE);	// @ (0x217 * 8 + 6)
#define                                 PCIE_bit            _BIT_ACCESS(SSP1CON3,6)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN>
extern volatile __bit                   PEN                 __at(0x10B2);	// @ (0x216 * 8 + 2)
#define                                 PEN_bit             _BIT_ACCESS(SSP1CON2,2)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x4E6);	// @ (0x9C * 8 + 6)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,6)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x7060);	// @ (0xE0C * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x4BB);	// @ (0x97 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// PWM11CLKCON<PWM11CS0>
extern volatile __bit                   PWM11CS0            __at(0x6DF0);	// @ (0xDBE * 8 + 0)
#define                                 PWM11CS0_bit        _BIT_ACCESS(PWM11CLKCON,0)
// PWM11CLKCON<PWM11CS1>
extern volatile __bit                   PWM11CS1            __at(0x6DF1);	// @ (0xDBE * 8 + 1)
#define                                 PWM11CS1_bit        _BIT_ACCESS(PWM11CLKCON,1)
// PWM11CLKCON<PWM11CS2>
extern volatile __bit                   PWM11CS2            __at(0x6DF2);	// @ (0xDBE * 8 + 2)
#define                                 PWM11CS2_bit        _BIT_ACCESS(PWM11CLKCON,2)
// PWM11DCH<PWM11DCH0>
extern volatile __bit                   PWM11DCH0           __at(0x6DA0);	// @ (0xDB4 * 8 + 0)
#define                                 PWM11DCH0_bit       _BIT_ACCESS(PWM11DCH,0)
// PWM11DCH<PWM11DCH1>
extern volatile __bit                   PWM11DCH1           __at(0x6DA1);	// @ (0xDB4 * 8 + 1)
#define                                 PWM11DCH1_bit       _BIT_ACCESS(PWM11DCH,1)
// PWM11DCH<PWM11DCH2>
extern volatile __bit                   PWM11DCH2           __at(0x6DA2);	// @ (0xDB4 * 8 + 2)
#define                                 PWM11DCH2_bit       _BIT_ACCESS(PWM11DCH,2)
// PWM11DCH<PWM11DCH3>
extern volatile __bit                   PWM11DCH3           __at(0x6DA3);	// @ (0xDB4 * 8 + 3)
#define                                 PWM11DCH3_bit       _BIT_ACCESS(PWM11DCH,3)
// PWM11DCH<PWM11DCH4>
extern volatile __bit                   PWM11DCH4           __at(0x6DA4);	// @ (0xDB4 * 8 + 4)
#define                                 PWM11DCH4_bit       _BIT_ACCESS(PWM11DCH,4)
// PWM11DCH<PWM11DCH5>
extern volatile __bit                   PWM11DCH5           __at(0x6DA5);	// @ (0xDB4 * 8 + 5)
#define                                 PWM11DCH5_bit       _BIT_ACCESS(PWM11DCH,5)
// PWM11DCH<PWM11DCH6>
extern volatile __bit                   PWM11DCH6           __at(0x6DA6);	// @ (0xDB4 * 8 + 6)
#define                                 PWM11DCH6_bit       _BIT_ACCESS(PWM11DCH,6)
// PWM11DCH<PWM11DCH7>
extern volatile __bit                   PWM11DCH7           __at(0x6DA7);	// @ (0xDB4 * 8 + 7)
#define                                 PWM11DCH7_bit       _BIT_ACCESS(PWM11DCH,7)
// PWM11INTE<PWM11DCIE>
extern volatile __bit                   PWM11DCIE           __at(0x6DE1);	// @ (0xDBC * 8 + 1)
#define                                 PWM11DCIE_bit       _BIT_ACCESS(PWM11INTE,1)
// PWM11INTF<PWM11DCIF>
extern volatile __bit                   PWM11DCIF           __at(0x6DE9);	// @ (0xDBD * 8 + 1)
#define                                 PWM11DCIF_bit       _BIT_ACCESS(PWM11INTF,1)
// PWM11DCL<PWM11DCL0>
extern volatile __bit                   PWM11DCL0           __at(0x6D98);	// @ (0xDB3 * 8 + 0)
#define                                 PWM11DCL0_bit       _BIT_ACCESS(PWM11DCL,0)
// PWM11DCL<PWM11DCL1>
extern volatile __bit                   PWM11DCL1           __at(0x6D99);	// @ (0xDB3 * 8 + 1)
#define                                 PWM11DCL1_bit       _BIT_ACCESS(PWM11DCL,1)
// PWM11DCL<PWM11DCL2>
extern volatile __bit                   PWM11DCL2           __at(0x6D9A);	// @ (0xDB3 * 8 + 2)
#define                                 PWM11DCL2_bit       _BIT_ACCESS(PWM11DCL,2)
// PWM11DCL<PWM11DCL3>
extern volatile __bit                   PWM11DCL3           __at(0x6D9B);	// @ (0xDB3 * 8 + 3)
#define                                 PWM11DCL3_bit       _BIT_ACCESS(PWM11DCL,3)
// PWM11DCL<PWM11DCL4>
extern volatile __bit                   PWM11DCL4           __at(0x6D9C);	// @ (0xDB3 * 8 + 4)
#define                                 PWM11DCL4_bit       _BIT_ACCESS(PWM11DCL,4)
// PWM11DCL<PWM11DCL5>
extern volatile __bit                   PWM11DCL5           __at(0x6D9D);	// @ (0xDB3 * 8 + 5)
#define                                 PWM11DCL5_bit       _BIT_ACCESS(PWM11DCL,5)
// PWM11DCL<PWM11DCL6>
extern volatile __bit                   PWM11DCL6           __at(0x6D9E);	// @ (0xDB3 * 8 + 6)
#define                                 PWM11DCL6_bit       _BIT_ACCESS(PWM11DCL,6)
// PWM11DCL<PWM11DCL7>
extern volatile __bit                   PWM11DCL7           __at(0x6D9F);	// @ (0xDB3 * 8 + 7)
#define                                 PWM11DCL7_bit       _BIT_ACCESS(PWM11DCL,7)
// PWM11CON<PWM11EN>
extern volatile __bit                   PWM11EN             __at(0x6DDF);	// @ (0xDBB * 8 + 7)
#define                                 PWM11EN_bit         _BIT_ACCESS(PWM11CON,7)
// PIE6<PWM11IE>
extern volatile __bit                   PWM11IE             __at(0x4B2);	// @ (0x96 * 8 + 2)
#define                                 PWM11IE_bit         _BIT_ACCESS(PIE6,2)
// PIR6<PWM11IF>
extern volatile __bit                   PWM11IF             __at(0xB2);	// @ (0x16 * 8 + 2)
#define                                 PWM11IF_bit         _BIT_ACCESS(PIR6,2)
// PWM11LDCON<PWM11LD>
extern volatile __bit                   PWM11LD             __at(0x6DFF);	// @ (0xDBF * 8 + 7)
#define                                 PWM11LD_bit         _BIT_ACCESS(PWM11LDCON,7)
// PWM11LDCON<PWM11LDM>
extern volatile __bit                   PWM11LDM            __at(0x6DFE);	// @ (0xDBF * 8 + 6)
#define                                 PWM11LDM_bit        _BIT_ACCESS(PWM11LDCON,6)
// PWM11LDCON<PWM11LDS0>
extern volatile __bit                   PWM11LDS0           __at(0x6DF8);	// @ (0xDBF * 8 + 0)
#define                                 PWM11LDS0_bit       _BIT_ACCESS(PWM11LDCON,0)
// PWM11LDCON<PWM11LDS1>
extern volatile __bit                   PWM11LDS1           __at(0x6DF9);	// @ (0xDBF * 8 + 1)
#define                                 PWM11LDS1_bit       _BIT_ACCESS(PWM11LDCON,1)
// PWM11CON<PWM11MODE0>
extern volatile __bit                   PWM11MODE0          __at(0x6DDA);	// @ (0xDBB * 8 + 2)
#define                                 PWM11MODE0_bit      _BIT_ACCESS(PWM11CON,2)
// PWM11CON<PWM11MODE1>
extern volatile __bit                   PWM11MODE1          __at(0x6DDB);	// @ (0xDBB * 8 + 3)
#define                                 PWM11MODE1_bit      _BIT_ACCESS(PWM11CON,3)
// PWM11OFH<PWM11OFH0>
extern volatile __bit                   PWM11OFH0           __at(0x6DC0);	// @ (0xDB8 * 8 + 0)
#define                                 PWM11OFH0_bit       _BIT_ACCESS(PWM11OFH,0)
// PWM11OFH<PWM11OFH1>
extern volatile __bit                   PWM11OFH1           __at(0x6DC1);	// @ (0xDB8 * 8 + 1)
#define                                 PWM11OFH1_bit       _BIT_ACCESS(PWM11OFH,1)
// PWM11OFH<PWM11OFH2>
extern volatile __bit                   PWM11OFH2           __at(0x6DC2);	// @ (0xDB8 * 8 + 2)
#define                                 PWM11OFH2_bit       _BIT_ACCESS(PWM11OFH,2)
// PWM11OFH<PWM11OFH3>
extern volatile __bit                   PWM11OFH3           __at(0x6DC3);	// @ (0xDB8 * 8 + 3)
#define                                 PWM11OFH3_bit       _BIT_ACCESS(PWM11OFH,3)
// PWM11OFH<PWM11OFH4>
extern volatile __bit                   PWM11OFH4           __at(0x6DC4);	// @ (0xDB8 * 8 + 4)
#define                                 PWM11OFH4_bit       _BIT_ACCESS(PWM11OFH,4)
// PWM11OFH<PWM11OFH5>
extern volatile __bit                   PWM11OFH5           __at(0x6DC5);	// @ (0xDB8 * 8 + 5)
#define                                 PWM11OFH5_bit       _BIT_ACCESS(PWM11OFH,5)
// PWM11OFH<PWM11OFH6>
extern volatile __bit                   PWM11OFH6           __at(0x6DC6);	// @ (0xDB8 * 8 + 6)
#define                                 PWM11OFH6_bit       _BIT_ACCESS(PWM11OFH,6)
// PWM11OFH<PWM11OFH7>
extern volatile __bit                   PWM11OFH7           __at(0x6DC7);	// @ (0xDB8 * 8 + 7)
#define                                 PWM11OFH7_bit       _BIT_ACCESS(PWM11OFH,7)
// PWM11INTE<PWM11OFIE>
extern volatile __bit                   PWM11OFIE           __at(0x6DE3);	// @ (0xDBC * 8 + 3)
#define                                 PWM11OFIE_bit       _BIT_ACCESS(PWM11INTE,3)
// PWM11INTF<PWM11OFIF>
extern volatile __bit                   PWM11OFIF           __at(0x6DEB);	// @ (0xDBD * 8 + 3)
#define                                 PWM11OFIF_bit       _BIT_ACCESS(PWM11INTF,3)
// PWM11OFL<PWM11OFL0>
extern volatile __bit                   PWM11OFL0           __at(0x6DB8);	// @ (0xDB7 * 8 + 0)
#define                                 PWM11OFL0_bit       _BIT_ACCESS(PWM11OFL,0)
// PWM11OFL<PWM11OFL1>
extern volatile __bit                   PWM11OFL1           __at(0x6DB9);	// @ (0xDB7 * 8 + 1)
#define                                 PWM11OFL1_bit       _BIT_ACCESS(PWM11OFL,1)
// PWM11OFL<PWM11OFL2>
extern volatile __bit                   PWM11OFL2           __at(0x6DBA);	// @ (0xDB7 * 8 + 2)
#define                                 PWM11OFL2_bit       _BIT_ACCESS(PWM11OFL,2)
// PWM11OFL<PWM11OFL3>
extern volatile __bit                   PWM11OFL3           __at(0x6DBB);	// @ (0xDB7 * 8 + 3)
#define                                 PWM11OFL3_bit       _BIT_ACCESS(PWM11OFL,3)
// PWM11OFL<PWM11OFL4>
extern volatile __bit                   PWM11OFL4           __at(0x6DBC);	// @ (0xDB7 * 8 + 4)
#define                                 PWM11OFL4_bit       _BIT_ACCESS(PWM11OFL,4)
// PWM11OFL<PWM11OFL5>
extern volatile __bit                   PWM11OFL5           __at(0x6DBD);	// @ (0xDB7 * 8 + 5)
#define                                 PWM11OFL5_bit       _BIT_ACCESS(PWM11OFL,5)
// PWM11OFL<PWM11OFL6>
extern volatile __bit                   PWM11OFL6           __at(0x6DBE);	// @ (0xDB7 * 8 + 6)
#define                                 PWM11OFL6_bit       _BIT_ACCESS(PWM11OFL,6)
// PWM11OFL<PWM11OFL7>
extern volatile __bit                   PWM11OFL7           __at(0x6DBF);	// @ (0xDB7 * 8 + 7)
#define                                 PWM11OFL7_bit       _BIT_ACCESS(PWM11OFL,7)
// PWM11OFCON<PWM11OFM0>
extern volatile __bit                   PWM11OFM0           __at(0x6E05);	// @ (0xDC0 * 8 + 5)
#define                                 PWM11OFM0_bit       _BIT_ACCESS(PWM11OFCON,5)
// PWM11OFCON<PWM11OFM1>
extern volatile __bit                   PWM11OFM1           __at(0x6E06);	// @ (0xDC0 * 8 + 6)
#define                                 PWM11OFM1_bit       _BIT_ACCESS(PWM11OFCON,6)
// PWM11OFCON<PWM11OFMC>
extern volatile __bit                   PWM11OFMC           __at(0x6E04);	// @ (0xDC0 * 8 + 4)
#define                                 PWM11OFMC_bit       _BIT_ACCESS(PWM11OFCON,4)
// PWM11OFCON<PWM11OFS0>
extern volatile __bit                   PWM11OFS0           __at(0x6E00);	// @ (0xDC0 * 8 + 0)
#define                                 PWM11OFS0_bit       _BIT_ACCESS(PWM11OFCON,0)
// PWM11OFCON<PWM11OFS1>
extern volatile __bit                   PWM11OFS1           __at(0x6E01);	// @ (0xDC0 * 8 + 1)
#define                                 PWM11OFS1_bit       _BIT_ACCESS(PWM11OFCON,1)
// PWM11CON<PWM11OUT>
extern volatile __bit                   PWM11OUT            __at(0x6DDD);	// @ (0xDBB * 8 + 5)
#define                                 PWM11OUT_bit        _BIT_ACCESS(PWM11CON,5)
// PWM11PHH<PWM11PHH0>
extern volatile __bit                   PWM11PHH0           __at(0x6D90);	// @ (0xDB2 * 8 + 0)
#define                                 PWM11PHH0_bit       _BIT_ACCESS(PWM11PHH,0)
// PWM11PHH<PWM11PHH1>
extern volatile __bit                   PWM11PHH1           __at(0x6D91);	// @ (0xDB2 * 8 + 1)
#define                                 PWM11PHH1_bit       _BIT_ACCESS(PWM11PHH,1)
// PWM11PHH<PWM11PHH2>
extern volatile __bit                   PWM11PHH2           __at(0x6D92);	// @ (0xDB2 * 8 + 2)
#define                                 PWM11PHH2_bit       _BIT_ACCESS(PWM11PHH,2)
// PWM11PHH<PWM11PHH3>
extern volatile __bit                   PWM11PHH3           __at(0x6D93);	// @ (0xDB2 * 8 + 3)
#define                                 PWM11PHH3_bit       _BIT_ACCESS(PWM11PHH,3)
// PWM11PHH<PWM11PHH4>
extern volatile __bit                   PWM11PHH4           __at(0x6D94);	// @ (0xDB2 * 8 + 4)
#define                                 PWM11PHH4_bit       _BIT_ACCESS(PWM11PHH,4)
// PWM11PHH<PWM11PHH5>
extern volatile __bit                   PWM11PHH5           __at(0x6D95);	// @ (0xDB2 * 8 + 5)
#define                                 PWM11PHH5_bit       _BIT_ACCESS(PWM11PHH,5)
// PWM11PHH<PWM11PHH6>
