MikroElektronika/core_packages/PIC/XC8/def/PIC16F1778/mcu.h
extern volatile __bit                   PWM11PHH6           __at(0x6D96);	// @ (0xDB2 * 8 + 6)
#define                                 PWM11PHH6_bit       _BIT_ACCESS(PWM11PHH,6)
// PWM11PHH<PWM11PHH7>
extern volatile __bit                   PWM11PHH7           __at(0x6D97);	// @ (0xDB2 * 8 + 7)
#define                                 PWM11PHH7_bit       _BIT_ACCESS(PWM11PHH,7)
// PWM11INTE<PWM11PHIE>
extern volatile __bit                   PWM11PHIE           __at(0x6DE2);	// @ (0xDBC * 8 + 2)
#define                                 PWM11PHIE_bit       _BIT_ACCESS(PWM11INTE,2)
// PWM11INTF<PWM11PHIF>
extern volatile __bit                   PWM11PHIF           __at(0x6DEA);	// @ (0xDBD * 8 + 2)
#define                                 PWM11PHIF_bit       _BIT_ACCESS(PWM11INTF,2)
// PWM11PHL<PWM11PHL0>
extern volatile __bit                   PWM11PHL0           __at(0x6D88);	// @ (0xDB1 * 8 + 0)
#define                                 PWM11PHL0_bit       _BIT_ACCESS(PWM11PHL,0)
// PWM11PHL<PWM11PHL1>
extern volatile __bit                   PWM11PHL1           __at(0x6D89);	// @ (0xDB1 * 8 + 1)
#define                                 PWM11PHL1_bit       _BIT_ACCESS(PWM11PHL,1)
// PWM11PHL<PWM11PHL2>
extern volatile __bit                   PWM11PHL2           __at(0x6D8A);	// @ (0xDB1 * 8 + 2)
#define                                 PWM11PHL2_bit       _BIT_ACCESS(PWM11PHL,2)
// PWM11PHL<PWM11PHL3>
extern volatile __bit                   PWM11PHL3           __at(0x6D8B);	// @ (0xDB1 * 8 + 3)
#define                                 PWM11PHL3_bit       _BIT_ACCESS(PWM11PHL,3)
// PWM11PHL<PWM11PHL4>
extern volatile __bit                   PWM11PHL4           __at(0x6D8C);	// @ (0xDB1 * 8 + 4)
#define                                 PWM11PHL4_bit       _BIT_ACCESS(PWM11PHL,4)
// PWM11PHL<PWM11PHL5>
extern volatile __bit                   PWM11PHL5           __at(0x6D8D);	// @ (0xDB1 * 8 + 5)
#define                                 PWM11PHL5_bit       _BIT_ACCESS(PWM11PHL,5)
// PWM11PHL<PWM11PHL6>
extern volatile __bit                   PWM11PHL6           __at(0x6D8E);	// @ (0xDB1 * 8 + 6)
#define                                 PWM11PHL6_bit       _BIT_ACCESS(PWM11PHL,6)
// PWM11PHL<PWM11PHL7>
extern volatile __bit                   PWM11PHL7           __at(0x6D8F);	// @ (0xDB1 * 8 + 7)
#define                                 PWM11PHL7_bit       _BIT_ACCESS(PWM11PHL,7)
// PWM11CON<PWM11POL>
extern volatile __bit                   PWM11POL            __at(0x6DDC);	// @ (0xDBB * 8 + 4)
#define                                 PWM11POL_bit        _BIT_ACCESS(PWM11CON,4)
// PWM11PRH<PWM11PRH0>
extern volatile __bit                   PWM11PRH0           __at(0x6DB0);	// @ (0xDB6 * 8 + 0)
#define                                 PWM11PRH0_bit       _BIT_ACCESS(PWM11PRH,0)
// PWM11PRH<PWM11PRH1>
extern volatile __bit                   PWM11PRH1           __at(0x6DB1);	// @ (0xDB6 * 8 + 1)
#define                                 PWM11PRH1_bit       _BIT_ACCESS(PWM11PRH,1)
// PWM11PRH<PWM11PRH2>
extern volatile __bit                   PWM11PRH2           __at(0x6DB2);	// @ (0xDB6 * 8 + 2)
#define                                 PWM11PRH2_bit       _BIT_ACCESS(PWM11PRH,2)
// PWM11PRH<PWM11PRH3>
extern volatile __bit                   PWM11PRH3           __at(0x6DB3);	// @ (0xDB6 * 8 + 3)
#define                                 PWM11PRH3_bit       _BIT_ACCESS(PWM11PRH,3)
// PWM11PRH<PWM11PRH4>
extern volatile __bit                   PWM11PRH4           __at(0x6DB4);	// @ (0xDB6 * 8 + 4)
#define                                 PWM11PRH4_bit       _BIT_ACCESS(PWM11PRH,4)
// PWM11PRH<PWM11PRH5>
extern volatile __bit                   PWM11PRH5           __at(0x6DB5);	// @ (0xDB6 * 8 + 5)
#define                                 PWM11PRH5_bit       _BIT_ACCESS(PWM11PRH,5)
// PWM11PRH<PWM11PRH6>
extern volatile __bit                   PWM11PRH6           __at(0x6DB6);	// @ (0xDB6 * 8 + 6)
#define                                 PWM11PRH6_bit       _BIT_ACCESS(PWM11PRH,6)
// PWM11PRH<PWM11PRH7>
extern volatile __bit                   PWM11PRH7           __at(0x6DB7);	// @ (0xDB6 * 8 + 7)
#define                                 PWM11PRH7_bit       _BIT_ACCESS(PWM11PRH,7)
// PWM11INTE<PWM11PRIE>
extern volatile __bit                   PWM11PRIE           __at(0x6DE0);	// @ (0xDBC * 8 + 0)
#define                                 PWM11PRIE_bit       _BIT_ACCESS(PWM11INTE,0)
// PWM11INTF<PWM11PRIF>
extern volatile __bit                   PWM11PRIF           __at(0x6DE8);	// @ (0xDBD * 8 + 0)
#define                                 PWM11PRIF_bit       _BIT_ACCESS(PWM11INTF,0)
// PWM11PRL<PWM11PRL0>
extern volatile __bit                   PWM11PRL0           __at(0x6DA8);	// @ (0xDB5 * 8 + 0)
#define                                 PWM11PRL0_bit       _BIT_ACCESS(PWM11PRL,0)
// PWM11PRL<PWM11PRL1>
extern volatile __bit                   PWM11PRL1           __at(0x6DA9);	// @ (0xDB5 * 8 + 1)
#define                                 PWM11PRL1_bit       _BIT_ACCESS(PWM11PRL,1)
// PWM11PRL<PWM11PRL2>
extern volatile __bit                   PWM11PRL2           __at(0x6DAA);	// @ (0xDB5 * 8 + 2)
#define                                 PWM11PRL2_bit       _BIT_ACCESS(PWM11PRL,2)
// PWM11PRL<PWM11PRL3>
extern volatile __bit                   PWM11PRL3           __at(0x6DAB);	// @ (0xDB5 * 8 + 3)
#define                                 PWM11PRL3_bit       _BIT_ACCESS(PWM11PRL,3)
// PWM11PRL<PWM11PRL4>
extern volatile __bit                   PWM11PRL4           __at(0x6DAC);	// @ (0xDB5 * 8 + 4)
#define                                 PWM11PRL4_bit       _BIT_ACCESS(PWM11PRL,4)
// PWM11PRL<PWM11PRL5>
extern volatile __bit                   PWM11PRL5           __at(0x6DAD);	// @ (0xDB5 * 8 + 5)
#define                                 PWM11PRL5_bit       _BIT_ACCESS(PWM11PRL,5)
// PWM11PRL<PWM11PRL6>
extern volatile __bit                   PWM11PRL6           __at(0x6DAE);	// @ (0xDB5 * 8 + 6)
#define                                 PWM11PRL6_bit       _BIT_ACCESS(PWM11PRL,6)
// PWM11PRL<PWM11PRL7>
extern volatile __bit                   PWM11PRL7           __at(0x6DAF);	// @ (0xDB5 * 8 + 7)
#define                                 PWM11PRL7_bit       _BIT_ACCESS(PWM11PRL,7)
// PWM11CLKCON<PWM11PS0>
extern volatile __bit                   PWM11PS0            __at(0x6DF4);	// @ (0xDBE * 8 + 4)
#define                                 PWM11PS0_bit        _BIT_ACCESS(PWM11CLKCON,4)
// PWM11CLKCON<PWM11PS1>
extern volatile __bit                   PWM11PS1            __at(0x6DF5);	// @ (0xDBE * 8 + 5)
#define                                 PWM11PS1_bit        _BIT_ACCESS(PWM11CLKCON,5)
// PWM11CLKCON<PWM11PS2>
extern volatile __bit                   PWM11PS2            __at(0x6DF6);	// @ (0xDBE * 8 + 6)
#define                                 PWM11PS2_bit        _BIT_ACCESS(PWM11CLKCON,6)
// PWM11TMRH<PWM11TMRH0>
extern volatile __bit                   PWM11TMRH0          __at(0x6DD0);	// @ (0xDBA * 8 + 0)
#define                                 PWM11TMRH0_bit      _BIT_ACCESS(PWM11TMRH,0)
// PWM11TMRH<PWM11TMRH1>
extern volatile __bit                   PWM11TMRH1          __at(0x6DD1);	// @ (0xDBA * 8 + 1)
#define                                 PWM11TMRH1_bit      _BIT_ACCESS(PWM11TMRH,1)
// PWM11TMRH<PWM11TMRH2>
extern volatile __bit                   PWM11TMRH2          __at(0x6DD2);	// @ (0xDBA * 8 + 2)
#define                                 PWM11TMRH2_bit      _BIT_ACCESS(PWM11TMRH,2)
// PWM11TMRH<PWM11TMRH3>
extern volatile __bit                   PWM11TMRH3          __at(0x6DD3);	// @ (0xDBA * 8 + 3)
#define                                 PWM11TMRH3_bit      _BIT_ACCESS(PWM11TMRH,3)
// PWM11TMRH<PWM11TMRH4>
extern volatile __bit                   PWM11TMRH4          __at(0x6DD4);	// @ (0xDBA * 8 + 4)
#define                                 PWM11TMRH4_bit      _BIT_ACCESS(PWM11TMRH,4)
// PWM11TMRH<PWM11TMRH5>
extern volatile __bit                   PWM11TMRH5          __at(0x6DD5);	// @ (0xDBA * 8 + 5)
#define                                 PWM11TMRH5_bit      _BIT_ACCESS(PWM11TMRH,5)
// PWM11TMRH<PWM11TMRH6>
extern volatile __bit                   PWM11TMRH6          __at(0x6DD6);	// @ (0xDBA * 8 + 6)
#define                                 PWM11TMRH6_bit      _BIT_ACCESS(PWM11TMRH,6)
// PWM11TMRH<PWM11TMRH7>
extern volatile __bit                   PWM11TMRH7          __at(0x6DD7);	// @ (0xDBA * 8 + 7)
#define                                 PWM11TMRH7_bit      _BIT_ACCESS(PWM11TMRH,7)
// PWM11TMRL<PWM11TMRL0>
extern volatile __bit                   PWM11TMRL0          __at(0x6DC8);	// @ (0xDB9 * 8 + 0)
#define                                 PWM11TMRL0_bit      _BIT_ACCESS(PWM11TMRL,0)
// PWM11TMRL<PWM11TMRL1>
extern volatile __bit                   PWM11TMRL1          __at(0x6DC9);	// @ (0xDB9 * 8 + 1)
#define                                 PWM11TMRL1_bit      _BIT_ACCESS(PWM11TMRL,1)
// PWM11TMRL<PWM11TMRL2>
extern volatile __bit                   PWM11TMRL2          __at(0x6DCA);	// @ (0xDB9 * 8 + 2)
#define                                 PWM11TMRL2_bit      _BIT_ACCESS(PWM11TMRL,2)
// PWM11TMRL<PWM11TMRL3>
extern volatile __bit                   PWM11TMRL3          __at(0x6DCB);	// @ (0xDB9 * 8 + 3)
#define                                 PWM11TMRL3_bit      _BIT_ACCESS(PWM11TMRL,3)
// PWM11TMRL<PWM11TMRL4>
extern volatile __bit                   PWM11TMRL4          __at(0x6DCC);	// @ (0xDB9 * 8 + 4)
#define                                 PWM11TMRL4_bit      _BIT_ACCESS(PWM11TMRL,4)
// PWM11TMRL<PWM11TMRL5>
extern volatile __bit                   PWM11TMRL5          __at(0x6DCD);	// @ (0xDB9 * 8 + 5)
#define                                 PWM11TMRL5_bit      _BIT_ACCESS(PWM11TMRL,5)
// PWM11TMRL<PWM11TMRL6>
extern volatile __bit                   PWM11TMRL6          __at(0x6DCE);	// @ (0xDB9 * 8 + 6)
#define                                 PWM11TMRL6_bit      _BIT_ACCESS(PWM11TMRL,6)
// PWM11TMRL<PWM11TMRL7>
extern volatile __bit                   PWM11TMRL7          __at(0x6DCF);	// @ (0xDB9 * 8 + 7)
#define                                 PWM11TMRL7_bit      _BIT_ACCESS(PWM11TMRL,7)
// PWM3DCL<PWM3DC0>
extern volatile __bit                   PWM3DC0             __at(0x30A6);	// @ (0x614 * 8 + 6)
#define                                 PWM3DC0_bit         _BIT_ACCESS(PWM3DCL,6)
// PWM3DCL<PWM3DC1>
extern volatile __bit                   PWM3DC1             __at(0x30A7);	// @ (0x614 * 8 + 7)
#define                                 PWM3DC1_bit         _BIT_ACCESS(PWM3DCL,7)
// PWM3DCH<PWM3DC2>
extern volatile __bit                   PWM3DC2             __at(0x30A8);	// @ (0x615 * 8 + 0)
#define                                 PWM3DC2_bit         _BIT_ACCESS(PWM3DCH,0)
// PWM3DCH<PWM3DC3>
extern volatile __bit                   PWM3DC3             __at(0x30A9);	// @ (0x615 * 8 + 1)
#define                                 PWM3DC3_bit         _BIT_ACCESS(PWM3DCH,1)
// PWM3DCH<PWM3DC4>
extern volatile __bit                   PWM3DC4             __at(0x30AA);	// @ (0x615 * 8 + 2)
#define                                 PWM3DC4_bit         _BIT_ACCESS(PWM3DCH,2)
// PWM3DCH<PWM3DC5>
extern volatile __bit                   PWM3DC5             __at(0x30AB);	// @ (0x615 * 8 + 3)
#define                                 PWM3DC5_bit         _BIT_ACCESS(PWM3DCH,3)
// PWM3DCH<PWM3DC6>
extern volatile __bit                   PWM3DC6             __at(0x30AC);	// @ (0x615 * 8 + 4)
#define                                 PWM3DC6_bit         _BIT_ACCESS(PWM3DCH,4)
// PWM3DCH<PWM3DC7>
extern volatile __bit                   PWM3DC7             __at(0x30AD);	// @ (0x615 * 8 + 5)
#define                                 PWM3DC7_bit         _BIT_ACCESS(PWM3DCH,5)
// PWM3DCH<PWM3DC8>
extern volatile __bit                   PWM3DC8             __at(0x30AE);	// @ (0x615 * 8 + 6)
#define                                 PWM3DC8_bit         _BIT_ACCESS(PWM3DCH,6)
// PWM3DCH<PWM3DC9>
extern volatile __bit                   PWM3DC9             __at(0x30AF);	// @ (0x615 * 8 + 7)
#define                                 PWM3DC9_bit         _BIT_ACCESS(PWM3DCH,7)
// PWM3CON<PWM3EN>
extern volatile __bit                   PWM3EN              __at(0x30B7);	// @ (0x616 * 8 + 7)
#define                                 PWM3EN_bit          _BIT_ACCESS(PWM3CON,7)
// PWM3CON<PWM3OUT>
extern volatile __bit                   PWM3OUT             __at(0x30B5);	// @ (0x616 * 8 + 5)
#define                                 PWM3OUT_bit         _BIT_ACCESS(PWM3CON,5)
// PWM3CON<PWM3POL>
extern volatile __bit                   PWM3POL             __at(0x30B4);	// @ (0x616 * 8 + 4)
#define                                 PWM3POL_bit         _BIT_ACCESS(PWM3CON,4)
// PWM4DCL<PWM4DC0>
extern volatile __bit                   PWM4DC0             __at(0x30BE);	// @ (0x617 * 8 + 6)
#define                                 PWM4DC0_bit         _BIT_ACCESS(PWM4DCL,6)
// PWM4DCL<PWM4DC1>
extern volatile __bit                   PWM4DC1             __at(0x30BF);	// @ (0x617 * 8 + 7)
#define                                 PWM4DC1_bit         _BIT_ACCESS(PWM4DCL,7)
// PWM4DCH<PWM4DC2>
extern volatile __bit                   PWM4DC2             __at(0x30C0);	// @ (0x618 * 8 + 0)
#define                                 PWM4DC2_bit         _BIT_ACCESS(PWM4DCH,0)
// PWM4DCH<PWM4DC3>
extern volatile __bit                   PWM4DC3             __at(0x30C1);	// @ (0x618 * 8 + 1)
#define                                 PWM4DC3_bit         _BIT_ACCESS(PWM4DCH,1)
// PWM4DCH<PWM4DC4>
extern volatile __bit                   PWM4DC4             __at(0x30C2);	// @ (0x618 * 8 + 2)
#define                                 PWM4DC4_bit         _BIT_ACCESS(PWM4DCH,2)
// PWM4DCH<PWM4DC5>
extern volatile __bit                   PWM4DC5             __at(0x30C3);	// @ (0x618 * 8 + 3)
#define                                 PWM4DC5_bit         _BIT_ACCESS(PWM4DCH,3)
// PWM4DCH<PWM4DC6>
extern volatile __bit                   PWM4DC6             __at(0x30C4);	// @ (0x618 * 8 + 4)
#define                                 PWM4DC6_bit         _BIT_ACCESS(PWM4DCH,4)
// PWM4DCH<PWM4DC7>
extern volatile __bit                   PWM4DC7             __at(0x30C5);	// @ (0x618 * 8 + 5)
#define                                 PWM4DC7_bit         _BIT_ACCESS(PWM4DCH,5)
// PWM4DCH<PWM4DC8>
extern volatile __bit                   PWM4DC8             __at(0x30C6);	// @ (0x618 * 8 + 6)
#define                                 PWM4DC8_bit         _BIT_ACCESS(PWM4DCH,6)
// PWM4DCH<PWM4DC9>
extern volatile __bit                   PWM4DC9             __at(0x30C7);	// @ (0x618 * 8 + 7)
#define                                 PWM4DC9_bit         _BIT_ACCESS(PWM4DCH,7)
// PWM4CON<PWM4EN>
extern volatile __bit                   PWM4EN              __at(0x30CF);	// @ (0x619 * 8 + 7)
#define                                 PWM4EN_bit          _BIT_ACCESS(PWM4CON,7)
// PWM4CON<PWM4OUT>
extern volatile __bit                   PWM4OUT             __at(0x30CD);	// @ (0x619 * 8 + 5)
#define                                 PWM4OUT_bit         _BIT_ACCESS(PWM4CON,5)
// PWM4CON<PWM4POL>
extern volatile __bit                   PWM4POL             __at(0x30CC);	// @ (0x619 * 8 + 4)
#define                                 PWM4POL_bit         _BIT_ACCESS(PWM4CON,4)
// PWM5CLKCON<PWM5CS0>
extern volatile __bit                   PWM5CS0             __at(0x6CF0);	// @ (0xD9E * 8 + 0)
#define                                 PWM5CS0_bit         _BIT_ACCESS(PWM5CLKCON,0)
// PWM5CLKCON<PWM5CS1>
extern volatile __bit                   PWM5CS1             __at(0x6CF1);	// @ (0xD9E * 8 + 1)
#define                                 PWM5CS1_bit         _BIT_ACCESS(PWM5CLKCON,1)
// PWM5CLKCON<PWM5CS2>
extern volatile __bit                   PWM5CS2             __at(0x6CF2);	// @ (0xD9E * 8 + 2)
#define                                 PWM5CS2_bit         _BIT_ACCESS(PWM5CLKCON,2)
// PWM5DCH<PWM5DCH0>
extern volatile __bit                   PWM5DCH0            __at(0x6CA0);	// @ (0xD94 * 8 + 0)
#define                                 PWM5DCH0_bit        _BIT_ACCESS(PWM5DCH,0)
// PWM5DCH<PWM5DCH1>
extern volatile __bit                   PWM5DCH1            __at(0x6CA1);	// @ (0xD94 * 8 + 1)
#define                                 PWM5DCH1_bit        _BIT_ACCESS(PWM5DCH,1)
// PWM5DCH<PWM5DCH2>
extern volatile __bit                   PWM5DCH2            __at(0x6CA2);	// @ (0xD94 * 8 + 2)
#define                                 PWM5DCH2_bit        _BIT_ACCESS(PWM5DCH,2)
// PWM5DCH<PWM5DCH3>
extern volatile __bit                   PWM5DCH3            __at(0x6CA3);	// @ (0xD94 * 8 + 3)
#define                                 PWM5DCH3_bit        _BIT_ACCESS(PWM5DCH,3)
// PWM5DCH<PWM5DCH4>
extern volatile __bit                   PWM5DCH4            __at(0x6CA4);	// @ (0xD94 * 8 + 4)
#define                                 PWM5DCH4_bit        _BIT_ACCESS(PWM5DCH,4)
// PWM5DCH<PWM5DCH5>
extern volatile __bit                   PWM5DCH5            __at(0x6CA5);	// @ (0xD94 * 8 + 5)
#define                                 PWM5DCH5_bit        _BIT_ACCESS(PWM5DCH,5)
// PWM5DCH<PWM5DCH6>
extern volatile __bit                   PWM5DCH6            __at(0x6CA6);	// @ (0xD94 * 8 + 6)
#define                                 PWM5DCH6_bit        _BIT_ACCESS(PWM5DCH,6)
// PWM5DCH<PWM5DCH7>
extern volatile __bit                   PWM5DCH7            __at(0x6CA7);	// @ (0xD94 * 8 + 7)
#define                                 PWM5DCH7_bit        _BIT_ACCESS(PWM5DCH,7)
// PWM5INTE<PWM5DCIE>
extern volatile __bit                   PWM5DCIE            __at(0x6CE1);	// @ (0xD9C * 8 + 1)
#define                                 PWM5DCIE_bit        _BIT_ACCESS(PWM5INTE,1)
// PWM5INTF<PWM5DCIF>
extern volatile __bit                   PWM5DCIF            __at(0x6CE9);	// @ (0xD9D * 8 + 1)
#define                                 PWM5DCIF_bit        _BIT_ACCESS(PWM5INTF,1)
// PWM5DCL<PWM5DCL0>
extern volatile __bit                   PWM5DCL0            __at(0x6C98);	// @ (0xD93 * 8 + 0)
#define                                 PWM5DCL0_bit        _BIT_ACCESS(PWM5DCL,0)
// PWM5DCL<PWM5DCL1>
extern volatile __bit                   PWM5DCL1            __at(0x6C99);	// @ (0xD93 * 8 + 1)
#define                                 PWM5DCL1_bit        _BIT_ACCESS(PWM5DCL,1)
// PWM5DCL<PWM5DCL2>
extern volatile __bit                   PWM5DCL2            __at(0x6C9A);	// @ (0xD93 * 8 + 2)
#define                                 PWM5DCL2_bit        _BIT_ACCESS(PWM5DCL,2)
// PWM5DCL<PWM5DCL3>
extern volatile __bit                   PWM5DCL3            __at(0x6C9B);	// @ (0xD93 * 8 + 3)
#define                                 PWM5DCL3_bit        _BIT_ACCESS(PWM5DCL,3)
// PWM5DCL<PWM5DCL4>
extern volatile __bit                   PWM5DCL4            __at(0x6C9C);	// @ (0xD93 * 8 + 4)
#define                                 PWM5DCL4_bit        _BIT_ACCESS(PWM5DCL,4)
// PWM5DCL<PWM5DCL5>
extern volatile __bit                   PWM5DCL5            __at(0x6C9D);	// @ (0xD93 * 8 + 5)
#define                                 PWM5DCL5_bit        _BIT_ACCESS(PWM5DCL,5)
// PWM5DCL<PWM5DCL6>
extern volatile __bit                   PWM5DCL6            __at(0x6C9E);	// @ (0xD93 * 8 + 6)
#define                                 PWM5DCL6_bit        _BIT_ACCESS(PWM5DCL,6)
// PWM5DCL<PWM5DCL7>
extern volatile __bit                   PWM5DCL7            __at(0x6C9F);	// @ (0xD93 * 8 + 7)
#define                                 PWM5DCL7_bit        _BIT_ACCESS(PWM5DCL,7)
// PWM5CON<PWM5EN>
extern volatile __bit                   PWM5EN              __at(0x6CDF);	// @ (0xD9B * 8 + 7)
#define                                 PWM5EN_bit          _BIT_ACCESS(PWM5CON,7)
// PIE6<PWM5IE>
extern volatile __bit                   PWM5IE              __at(0x4B0);	// @ (0x96 * 8 + 0)
#define                                 PWM5IE_bit          _BIT_ACCESS(PIE6,0)
// PIR6<PWM5IF>
extern volatile __bit                   PWM5IF              __at(0xB0);	// @ (0x16 * 8 + 0)
#define                                 PWM5IF_bit          _BIT_ACCESS(PIR6,0)
// PWM5LDCON<PWM5LD>
extern volatile __bit                   PWM5LD              __at(0x6CFF);	// @ (0xD9F * 8 + 7)
#define                                 PWM5LD_bit          _BIT_ACCESS(PWM5LDCON,7)
// PWM5LDCON<PWM5LDM>
extern volatile __bit                   PWM5LDM             __at(0x6CFE);	// @ (0xD9F * 8 + 6)
#define                                 PWM5LDM_bit         _BIT_ACCESS(PWM5LDCON,6)
// PWM5LDCON<PWM5LDS0>
extern volatile __bit                   PWM5LDS0            __at(0x6CF8);	// @ (0xD9F * 8 + 0)
#define                                 PWM5LDS0_bit        _BIT_ACCESS(PWM5LDCON,0)
// PWM5LDCON<PWM5LDS1>
extern volatile __bit                   PWM5LDS1            __at(0x6CF9);	// @ (0xD9F * 8 + 1)
#define                                 PWM5LDS1_bit        _BIT_ACCESS(PWM5LDCON,1)
// PWM5CON<PWM5MODE0>
extern volatile __bit                   PWM5MODE0           __at(0x6CDA);	// @ (0xD9B * 8 + 2)
#define                                 PWM5MODE0_bit       _BIT_ACCESS(PWM5CON,2)
// PWM5CON<PWM5MODE1>
extern volatile __bit                   PWM5MODE1           __at(0x6CDB);	// @ (0xD9B * 8 + 3)
#define                                 PWM5MODE1_bit       _BIT_ACCESS(PWM5CON,3)
// PWM5OFH<PWM5OFH0>
extern volatile __bit                   PWM5OFH0            __at(0x6CC0);	// @ (0xD98 * 8 + 0)
#define                                 PWM5OFH0_bit        _BIT_ACCESS(PWM5OFH,0)
// PWM5OFH<PWM5OFH1>
extern volatile __bit                   PWM5OFH1            __at(0x6CC1);	// @ (0xD98 * 8 + 1)
#define                                 PWM5OFH1_bit        _BIT_ACCESS(PWM5OFH,1)
// PWM5OFH<PWM5OFH2>
extern volatile __bit                   PWM5OFH2            __at(0x6CC2);	// @ (0xD98 * 8 + 2)
#define                                 PWM5OFH2_bit        _BIT_ACCESS(PWM5OFH,2)
// PWM5OFH<PWM5OFH3>
extern volatile __bit                   PWM5OFH3            __at(0x6CC3);	// @ (0xD98 * 8 + 3)
#define                                 PWM5OFH3_bit        _BIT_ACCESS(PWM5OFH,3)
// PWM5OFH<PWM5OFH4>
extern volatile __bit                   PWM5OFH4            __at(0x6CC4);	// @ (0xD98 * 8 + 4)
#define                                 PWM5OFH4_bit        _BIT_ACCESS(PWM5OFH,4)
// PWM5OFH<PWM5OFH5>
extern volatile __bit                   PWM5OFH5            __at(0x6CC5);	// @ (0xD98 * 8 + 5)
#define                                 PWM5OFH5_bit        _BIT_ACCESS(PWM5OFH,5)
// PWM5OFH<PWM5OFH6>
extern volatile __bit                   PWM5OFH6            __at(0x6CC6);	// @ (0xD98 * 8 + 6)
#define                                 PWM5OFH6_bit        _BIT_ACCESS(PWM5OFH,6)
// PWM5OFH<PWM5OFH7>
extern volatile __bit                   PWM5OFH7            __at(0x6CC7);	// @ (0xD98 * 8 + 7)
#define                                 PWM5OFH7_bit        _BIT_ACCESS(PWM5OFH,7)
// PWM5INTE<PWM5OFIE>
extern volatile __bit                   PWM5OFIE            __at(0x6CE3);	// @ (0xD9C * 8 + 3)
#define                                 PWM5OFIE_bit        _BIT_ACCESS(PWM5INTE,3)
// PWM5INTF<PWM5OFIF>
extern volatile __bit                   PWM5OFIF            __at(0x6CEB);	// @ (0xD9D * 8 + 3)
#define                                 PWM5OFIF_bit        _BIT_ACCESS(PWM5INTF,3)
// PWM5OFL<PWM5OFL0>
extern volatile __bit                   PWM5OFL0            __at(0x6CB8);	// @ (0xD97 * 8 + 0)
#define                                 PWM5OFL0_bit        _BIT_ACCESS(PWM5OFL,0)
// PWM5OFL<PWM5OFL1>
extern volatile __bit                   PWM5OFL1            __at(0x6CB9);	// @ (0xD97 * 8 + 1)
#define                                 PWM5OFL1_bit        _BIT_ACCESS(PWM5OFL,1)
// PWM5OFL<PWM5OFL2>
extern volatile __bit                   PWM5OFL2            __at(0x6CBA);	// @ (0xD97 * 8 + 2)
#define                                 PWM5OFL2_bit        _BIT_ACCESS(PWM5OFL,2)
// PWM5OFL<PWM5OFL3>
extern volatile __bit                   PWM5OFL3            __at(0x6CBB);	// @ (0xD97 * 8 + 3)
