MikroElektronika/core_packages/PIC/XC8/def/PIC16F1778/mcu.h
#define                                 PWM5OFL3_bit        _BIT_ACCESS(PWM5OFL,3)
// PWM5OFL<PWM5OFL4>
extern volatile __bit                   PWM5OFL4            __at(0x6CBC);	// @ (0xD97 * 8 + 4)
#define                                 PWM5OFL4_bit        _BIT_ACCESS(PWM5OFL,4)
// PWM5OFL<PWM5OFL5>
extern volatile __bit                   PWM5OFL5            __at(0x6CBD);	// @ (0xD97 * 8 + 5)
#define                                 PWM5OFL5_bit        _BIT_ACCESS(PWM5OFL,5)
// PWM5OFL<PWM5OFL6>
extern volatile __bit                   PWM5OFL6            __at(0x6CBE);	// @ (0xD97 * 8 + 6)
#define                                 PWM5OFL6_bit        _BIT_ACCESS(PWM5OFL,6)
// PWM5OFL<PWM5OFL7>
extern volatile __bit                   PWM5OFL7            __at(0x6CBF);	// @ (0xD97 * 8 + 7)
#define                                 PWM5OFL7_bit        _BIT_ACCESS(PWM5OFL,7)
// PWM5OFCON<PWM5OFM0>
extern volatile __bit                   PWM5OFM0            __at(0x6D05);	// @ (0xDA0 * 8 + 5)
#define                                 PWM5OFM0_bit        _BIT_ACCESS(PWM5OFCON,5)
// PWM5OFCON<PWM5OFM1>
extern volatile __bit                   PWM5OFM1            __at(0x6D06);	// @ (0xDA0 * 8 + 6)
#define                                 PWM5OFM1_bit        _BIT_ACCESS(PWM5OFCON,6)
// PWM5OFCON<PWM5OFMC>
extern volatile __bit                   PWM5OFMC            __at(0x6D04);	// @ (0xDA0 * 8 + 4)
#define                                 PWM5OFMC_bit        _BIT_ACCESS(PWM5OFCON,4)
// PWM5OFCON<PWM5OFS0>
extern volatile __bit                   PWM5OFS0            __at(0x6D00);	// @ (0xDA0 * 8 + 0)
#define                                 PWM5OFS0_bit        _BIT_ACCESS(PWM5OFCON,0)
// PWM5OFCON<PWM5OFS1>
extern volatile __bit                   PWM5OFS1            __at(0x6D01);	// @ (0xDA0 * 8 + 1)
#define                                 PWM5OFS1_bit        _BIT_ACCESS(PWM5OFCON,1)
// PWM5CON<PWM5OUT>
extern volatile __bit                   PWM5OUT             __at(0x6CDD);	// @ (0xD9B * 8 + 5)
#define                                 PWM5OUT_bit         _BIT_ACCESS(PWM5CON,5)
// PWM5PHH<PWM5PHH0>
extern volatile __bit                   PWM5PHH0            __at(0x6C90);	// @ (0xD92 * 8 + 0)
#define                                 PWM5PHH0_bit        _BIT_ACCESS(PWM5PHH,0)
// PWM5PHH<PWM5PHH1>
extern volatile __bit                   PWM5PHH1            __at(0x6C91);	// @ (0xD92 * 8 + 1)
#define                                 PWM5PHH1_bit        _BIT_ACCESS(PWM5PHH,1)
// PWM5PHH<PWM5PHH2>
extern volatile __bit                   PWM5PHH2            __at(0x6C92);	// @ (0xD92 * 8 + 2)
#define                                 PWM5PHH2_bit        _BIT_ACCESS(PWM5PHH,2)
// PWM5PHH<PWM5PHH3>
extern volatile __bit                   PWM5PHH3            __at(0x6C93);	// @ (0xD92 * 8 + 3)
#define                                 PWM5PHH3_bit        _BIT_ACCESS(PWM5PHH,3)
// PWM5PHH<PWM5PHH4>
extern volatile __bit                   PWM5PHH4            __at(0x6C94);	// @ (0xD92 * 8 + 4)
#define                                 PWM5PHH4_bit        _BIT_ACCESS(PWM5PHH,4)
// PWM5PHH<PWM5PHH5>
extern volatile __bit                   PWM5PHH5            __at(0x6C95);	// @ (0xD92 * 8 + 5)
#define                                 PWM5PHH5_bit        _BIT_ACCESS(PWM5PHH,5)
// PWM5PHH<PWM5PHH6>
extern volatile __bit                   PWM5PHH6            __at(0x6C96);	// @ (0xD92 * 8 + 6)
#define                                 PWM5PHH6_bit        _BIT_ACCESS(PWM5PHH,6)
// PWM5PHH<PWM5PHH7>
extern volatile __bit                   PWM5PHH7            __at(0x6C97);	// @ (0xD92 * 8 + 7)
#define                                 PWM5PHH7_bit        _BIT_ACCESS(PWM5PHH,7)
// PWM5INTE<PWM5PHIE>
extern volatile __bit                   PWM5PHIE            __at(0x6CE2);	// @ (0xD9C * 8 + 2)
#define                                 PWM5PHIE_bit        _BIT_ACCESS(PWM5INTE,2)
// PWM5INTF<PWM5PHIF>
extern volatile __bit                   PWM5PHIF            __at(0x6CEA);	// @ (0xD9D * 8 + 2)
#define                                 PWM5PHIF_bit        _BIT_ACCESS(PWM5INTF,2)
// PWM5PHL<PWM5PHL0>
extern volatile __bit                   PWM5PHL0            __at(0x6C88);	// @ (0xD91 * 8 + 0)
#define                                 PWM5PHL0_bit        _BIT_ACCESS(PWM5PHL,0)
// PWM5PHL<PWM5PHL1>
extern volatile __bit                   PWM5PHL1            __at(0x6C89);	// @ (0xD91 * 8 + 1)
#define                                 PWM5PHL1_bit        _BIT_ACCESS(PWM5PHL,1)
// PWM5PHL<PWM5PHL2>
extern volatile __bit                   PWM5PHL2            __at(0x6C8A);	// @ (0xD91 * 8 + 2)
#define                                 PWM5PHL2_bit        _BIT_ACCESS(PWM5PHL,2)
// PWM5PHL<PWM5PHL3>
extern volatile __bit                   PWM5PHL3            __at(0x6C8B);	// @ (0xD91 * 8 + 3)
#define                                 PWM5PHL3_bit        _BIT_ACCESS(PWM5PHL,3)
// PWM5PHL<PWM5PHL4>
extern volatile __bit                   PWM5PHL4            __at(0x6C8C);	// @ (0xD91 * 8 + 4)
#define                                 PWM5PHL4_bit        _BIT_ACCESS(PWM5PHL,4)
// PWM5PHL<PWM5PHL5>
extern volatile __bit                   PWM5PHL5            __at(0x6C8D);	// @ (0xD91 * 8 + 5)
#define                                 PWM5PHL5_bit        _BIT_ACCESS(PWM5PHL,5)
// PWM5PHL<PWM5PHL6>
extern volatile __bit                   PWM5PHL6            __at(0x6C8E);	// @ (0xD91 * 8 + 6)
#define                                 PWM5PHL6_bit        _BIT_ACCESS(PWM5PHL,6)
// PWM5PHL<PWM5PHL7>
extern volatile __bit                   PWM5PHL7            __at(0x6C8F);	// @ (0xD91 * 8 + 7)
#define                                 PWM5PHL7_bit        _BIT_ACCESS(PWM5PHL,7)
// PWM5CON<PWM5POL>
extern volatile __bit                   PWM5POL             __at(0x6CDC);	// @ (0xD9B * 8 + 4)
#define                                 PWM5POL_bit         _BIT_ACCESS(PWM5CON,4)
// PWM5PRH<PWM5PRH0>
extern volatile __bit                   PWM5PRH0            __at(0x6CB0);	// @ (0xD96 * 8 + 0)
#define                                 PWM5PRH0_bit        _BIT_ACCESS(PWM5PRH,0)
// PWM5PRH<PWM5PRH1>
extern volatile __bit                   PWM5PRH1            __at(0x6CB1);	// @ (0xD96 * 8 + 1)
#define                                 PWM5PRH1_bit        _BIT_ACCESS(PWM5PRH,1)
// PWM5PRH<PWM5PRH2>
extern volatile __bit                   PWM5PRH2            __at(0x6CB2);	// @ (0xD96 * 8 + 2)
#define                                 PWM5PRH2_bit        _BIT_ACCESS(PWM5PRH,2)
// PWM5PRH<PWM5PRH3>
extern volatile __bit                   PWM5PRH3            __at(0x6CB3);	// @ (0xD96 * 8 + 3)
#define                                 PWM5PRH3_bit        _BIT_ACCESS(PWM5PRH,3)
// PWM5PRH<PWM5PRH4>
extern volatile __bit                   PWM5PRH4            __at(0x6CB4);	// @ (0xD96 * 8 + 4)
#define                                 PWM5PRH4_bit        _BIT_ACCESS(PWM5PRH,4)
// PWM5PRH<PWM5PRH5>
extern volatile __bit                   PWM5PRH5            __at(0x6CB5);	// @ (0xD96 * 8 + 5)
#define                                 PWM5PRH5_bit        _BIT_ACCESS(PWM5PRH,5)
// PWM5PRH<PWM5PRH6>
extern volatile __bit                   PWM5PRH6            __at(0x6CB6);	// @ (0xD96 * 8 + 6)
#define                                 PWM5PRH6_bit        _BIT_ACCESS(PWM5PRH,6)
// PWM5PRH<PWM5PRH7>
extern volatile __bit                   PWM5PRH7            __at(0x6CB7);	// @ (0xD96 * 8 + 7)
#define                                 PWM5PRH7_bit        _BIT_ACCESS(PWM5PRH,7)
// PWM5INTE<PWM5PRIE>
extern volatile __bit                   PWM5PRIE            __at(0x6CE0);	// @ (0xD9C * 8 + 0)
#define                                 PWM5PRIE_bit        _BIT_ACCESS(PWM5INTE,0)
// PWM5INTF<PWM5PRIF>
extern volatile __bit                   PWM5PRIF            __at(0x6CE8);	// @ (0xD9D * 8 + 0)
#define                                 PWM5PRIF_bit        _BIT_ACCESS(PWM5INTF,0)
// PWM5PRL<PWM5PRL0>
extern volatile __bit                   PWM5PRL0            __at(0x6CA8);	// @ (0xD95 * 8 + 0)
#define                                 PWM5PRL0_bit        _BIT_ACCESS(PWM5PRL,0)
// PWM5PRL<PWM5PRL1>
extern volatile __bit                   PWM5PRL1            __at(0x6CA9);	// @ (0xD95 * 8 + 1)
#define                                 PWM5PRL1_bit        _BIT_ACCESS(PWM5PRL,1)
// PWM5PRL<PWM5PRL2>
extern volatile __bit                   PWM5PRL2            __at(0x6CAA);	// @ (0xD95 * 8 + 2)
#define                                 PWM5PRL2_bit        _BIT_ACCESS(PWM5PRL,2)
// PWM5PRL<PWM5PRL3>
extern volatile __bit                   PWM5PRL3            __at(0x6CAB);	// @ (0xD95 * 8 + 3)
#define                                 PWM5PRL3_bit        _BIT_ACCESS(PWM5PRL,3)
// PWM5PRL<PWM5PRL4>
extern volatile __bit                   PWM5PRL4            __at(0x6CAC);	// @ (0xD95 * 8 + 4)
#define                                 PWM5PRL4_bit        _BIT_ACCESS(PWM5PRL,4)
// PWM5PRL<PWM5PRL5>
extern volatile __bit                   PWM5PRL5            __at(0x6CAD);	// @ (0xD95 * 8 + 5)
#define                                 PWM5PRL5_bit        _BIT_ACCESS(PWM5PRL,5)
// PWM5PRL<PWM5PRL6>
extern volatile __bit                   PWM5PRL6            __at(0x6CAE);	// @ (0xD95 * 8 + 6)
#define                                 PWM5PRL6_bit        _BIT_ACCESS(PWM5PRL,6)
// PWM5PRL<PWM5PRL7>
extern volatile __bit                   PWM5PRL7            __at(0x6CAF);	// @ (0xD95 * 8 + 7)
#define                                 PWM5PRL7_bit        _BIT_ACCESS(PWM5PRL,7)
// PWM5CLKCON<PWM5PS0>
extern volatile __bit                   PWM5PS0             __at(0x6CF4);	// @ (0xD9E * 8 + 4)
#define                                 PWM5PS0_bit         _BIT_ACCESS(PWM5CLKCON,4)
// PWM5CLKCON<PWM5PS1>
extern volatile __bit                   PWM5PS1             __at(0x6CF5);	// @ (0xD9E * 8 + 5)
#define                                 PWM5PS1_bit         _BIT_ACCESS(PWM5CLKCON,5)
// PWM5CLKCON<PWM5PS2>
extern volatile __bit                   PWM5PS2             __at(0x6CF6);	// @ (0xD9E * 8 + 6)
#define                                 PWM5PS2_bit         _BIT_ACCESS(PWM5CLKCON,6)
// PWM5TMRH<PWM5TMRH0>
extern volatile __bit                   PWM5TMRH0           __at(0x6CD0);	// @ (0xD9A * 8 + 0)
#define                                 PWM5TMRH0_bit       _BIT_ACCESS(PWM5TMRH,0)
// PWM5TMRH<PWM5TMRH1>
extern volatile __bit                   PWM5TMRH1           __at(0x6CD1);	// @ (0xD9A * 8 + 1)
#define                                 PWM5TMRH1_bit       _BIT_ACCESS(PWM5TMRH,1)
// PWM5TMRH<PWM5TMRH2>
extern volatile __bit                   PWM5TMRH2           __at(0x6CD2);	// @ (0xD9A * 8 + 2)
#define                                 PWM5TMRH2_bit       _BIT_ACCESS(PWM5TMRH,2)
// PWM5TMRH<PWM5TMRH3>
extern volatile __bit                   PWM5TMRH3           __at(0x6CD3);	// @ (0xD9A * 8 + 3)
#define                                 PWM5TMRH3_bit       _BIT_ACCESS(PWM5TMRH,3)
// PWM5TMRH<PWM5TMRH4>
extern volatile __bit                   PWM5TMRH4           __at(0x6CD4);	// @ (0xD9A * 8 + 4)
#define                                 PWM5TMRH4_bit       _BIT_ACCESS(PWM5TMRH,4)
// PWM5TMRH<PWM5TMRH5>
extern volatile __bit                   PWM5TMRH5           __at(0x6CD5);	// @ (0xD9A * 8 + 5)
#define                                 PWM5TMRH5_bit       _BIT_ACCESS(PWM5TMRH,5)
// PWM5TMRH<PWM5TMRH6>
extern volatile __bit                   PWM5TMRH6           __at(0x6CD6);	// @ (0xD9A * 8 + 6)
#define                                 PWM5TMRH6_bit       _BIT_ACCESS(PWM5TMRH,6)
// PWM5TMRH<PWM5TMRH7>
extern volatile __bit                   PWM5TMRH7           __at(0x6CD7);	// @ (0xD9A * 8 + 7)
#define                                 PWM5TMRH7_bit       _BIT_ACCESS(PWM5TMRH,7)
// PWM5TMRL<PWM5TMRL0>
extern volatile __bit                   PWM5TMRL0           __at(0x6CC8);	// @ (0xD99 * 8 + 0)
#define                                 PWM5TMRL0_bit       _BIT_ACCESS(PWM5TMRL,0)
// PWM5TMRL<PWM5TMRL1>
extern volatile __bit                   PWM5TMRL1           __at(0x6CC9);	// @ (0xD99 * 8 + 1)
#define                                 PWM5TMRL1_bit       _BIT_ACCESS(PWM5TMRL,1)
// PWM5TMRL<PWM5TMRL2>
extern volatile __bit                   PWM5TMRL2           __at(0x6CCA);	// @ (0xD99 * 8 + 2)
#define                                 PWM5TMRL2_bit       _BIT_ACCESS(PWM5TMRL,2)
// PWM5TMRL<PWM5TMRL3>
extern volatile __bit                   PWM5TMRL3           __at(0x6CCB);	// @ (0xD99 * 8 + 3)
#define                                 PWM5TMRL3_bit       _BIT_ACCESS(PWM5TMRL,3)
// PWM5TMRL<PWM5TMRL4>
extern volatile __bit                   PWM5TMRL4           __at(0x6CCC);	// @ (0xD99 * 8 + 4)
#define                                 PWM5TMRL4_bit       _BIT_ACCESS(PWM5TMRL,4)
// PWM5TMRL<PWM5TMRL5>
extern volatile __bit                   PWM5TMRL5           __at(0x6CCD);	// @ (0xD99 * 8 + 5)
#define                                 PWM5TMRL5_bit       _BIT_ACCESS(PWM5TMRL,5)
// PWM5TMRL<PWM5TMRL6>
extern volatile __bit                   PWM5TMRL6           __at(0x6CCE);	// @ (0xD99 * 8 + 6)
#define                                 PWM5TMRL6_bit       _BIT_ACCESS(PWM5TMRL,6)
// PWM5TMRL<PWM5TMRL7>
extern volatile __bit                   PWM5TMRL7           __at(0x6CCF);	// @ (0xD99 * 8 + 7)
#define                                 PWM5TMRL7_bit       _BIT_ACCESS(PWM5TMRL,7)
// PWM6CLKCON<PWM6CS0>
extern volatile __bit                   PWM6CS0             __at(0x6D70);	// @ (0xDAE * 8 + 0)
#define                                 PWM6CS0_bit         _BIT_ACCESS(PWM6CLKCON,0)
// PWM6CLKCON<PWM6CS1>
extern volatile __bit                   PWM6CS1             __at(0x6D71);	// @ (0xDAE * 8 + 1)
#define                                 PWM6CS1_bit         _BIT_ACCESS(PWM6CLKCON,1)
// PWM6CLKCON<PWM6CS2>
extern volatile __bit                   PWM6CS2             __at(0x6D72);	// @ (0xDAE * 8 + 2)
#define                                 PWM6CS2_bit         _BIT_ACCESS(PWM6CLKCON,2)
// PWM6DCH<PWM6DCH0>
extern volatile __bit                   PWM6DCH0            __at(0x6D20);	// @ (0xDA4 * 8 + 0)
#define                                 PWM6DCH0_bit        _BIT_ACCESS(PWM6DCH,0)
// PWM6DCH<PWM6DCH1>
extern volatile __bit                   PWM6DCH1            __at(0x6D21);	// @ (0xDA4 * 8 + 1)
#define                                 PWM6DCH1_bit        _BIT_ACCESS(PWM6DCH,1)
// PWM6DCH<PWM6DCH2>
extern volatile __bit                   PWM6DCH2            __at(0x6D22);	// @ (0xDA4 * 8 + 2)
#define                                 PWM6DCH2_bit        _BIT_ACCESS(PWM6DCH,2)
// PWM6DCH<PWM6DCH3>
extern volatile __bit                   PWM6DCH3            __at(0x6D23);	// @ (0xDA4 * 8 + 3)
#define                                 PWM6DCH3_bit        _BIT_ACCESS(PWM6DCH,3)
// PWM6DCH<PWM6DCH4>
extern volatile __bit                   PWM6DCH4            __at(0x6D24);	// @ (0xDA4 * 8 + 4)
#define                                 PWM6DCH4_bit        _BIT_ACCESS(PWM6DCH,4)
// PWM6DCH<PWM6DCH5>
extern volatile __bit                   PWM6DCH5            __at(0x6D25);	// @ (0xDA4 * 8 + 5)
#define                                 PWM6DCH5_bit        _BIT_ACCESS(PWM6DCH,5)
// PWM6DCH<PWM6DCH6>
extern volatile __bit                   PWM6DCH6            __at(0x6D26);	// @ (0xDA4 * 8 + 6)
#define                                 PWM6DCH6_bit        _BIT_ACCESS(PWM6DCH,6)
// PWM6DCH<PWM6DCH7>
extern volatile __bit                   PWM6DCH7            __at(0x6D27);	// @ (0xDA4 * 8 + 7)
#define                                 PWM6DCH7_bit        _BIT_ACCESS(PWM6DCH,7)
// PWM6INTE<PWM6DCIE>
extern volatile __bit                   PWM6DCIE            __at(0x6D61);	// @ (0xDAC * 8 + 1)
#define                                 PWM6DCIE_bit        _BIT_ACCESS(PWM6INTE,1)
// PWM6INTF<PWM6DCIF>
extern volatile __bit                   PWM6DCIF            __at(0x6D69);	// @ (0xDAD * 8 + 1)
#define                                 PWM6DCIF_bit        _BIT_ACCESS(PWM6INTF,1)
// PWM6DCL<PWM6DCL0>
extern volatile __bit                   PWM6DCL0            __at(0x6D18);	// @ (0xDA3 * 8 + 0)
#define                                 PWM6DCL0_bit        _BIT_ACCESS(PWM6DCL,0)
// PWM6DCL<PWM6DCL1>
extern volatile __bit                   PWM6DCL1            __at(0x6D19);	// @ (0xDA3 * 8 + 1)
#define                                 PWM6DCL1_bit        _BIT_ACCESS(PWM6DCL,1)
// PWM6DCL<PWM6DCL2>
extern volatile __bit                   PWM6DCL2            __at(0x6D1A);	// @ (0xDA3 * 8 + 2)
#define                                 PWM6DCL2_bit        _BIT_ACCESS(PWM6DCL,2)
// PWM6DCL<PWM6DCL3>
extern volatile __bit                   PWM6DCL3            __at(0x6D1B);	// @ (0xDA3 * 8 + 3)
#define                                 PWM6DCL3_bit        _BIT_ACCESS(PWM6DCL,3)
// PWM6DCL<PWM6DCL4>
extern volatile __bit                   PWM6DCL4            __at(0x6D1C);	// @ (0xDA3 * 8 + 4)
#define                                 PWM6DCL4_bit        _BIT_ACCESS(PWM6DCL,4)
// PWM6DCL<PWM6DCL5>
extern volatile __bit                   PWM6DCL5            __at(0x6D1D);	// @ (0xDA3 * 8 + 5)
#define                                 PWM6DCL5_bit        _BIT_ACCESS(PWM6DCL,5)
// PWM6DCL<PWM6DCL6>
extern volatile __bit                   PWM6DCL6            __at(0x6D1E);	// @ (0xDA3 * 8 + 6)
#define                                 PWM6DCL6_bit        _BIT_ACCESS(PWM6DCL,6)
// PWM6DCL<PWM6DCL7>
extern volatile __bit                   PWM6DCL7            __at(0x6D1F);	// @ (0xDA3 * 8 + 7)
#define                                 PWM6DCL7_bit        _BIT_ACCESS(PWM6DCL,7)
// PWM6CON<PWM6EN>
extern volatile __bit                   PWM6EN              __at(0x6D5F);	// @ (0xDAB * 8 + 7)
#define                                 PWM6EN_bit          _BIT_ACCESS(PWM6CON,7)
// PIE6<PWM6IE>
extern volatile __bit                   PWM6IE              __at(0x4B1);	// @ (0x96 * 8 + 1)
#define                                 PWM6IE_bit          _BIT_ACCESS(PIE6,1)
// PIR6<PWM6IF>
extern volatile __bit                   PWM6IF              __at(0xB1);	// @ (0x16 * 8 + 1)
#define                                 PWM6IF_bit          _BIT_ACCESS(PIR6,1)
// PWM6LDCON<PWM6LD>
extern volatile __bit                   PWM6LD              __at(0x6D7F);	// @ (0xDAF * 8 + 7)
#define                                 PWM6LD_bit          _BIT_ACCESS(PWM6LDCON,7)
// PWM6LDCON<PWM6LDM>
extern volatile __bit                   PWM6LDM             __at(0x6D7E);	// @ (0xDAF * 8 + 6)
#define                                 PWM6LDM_bit         _BIT_ACCESS(PWM6LDCON,6)
// PWM6LDCON<PWM6LDS0>
extern volatile __bit                   PWM6LDS0            __at(0x6D78);	// @ (0xDAF * 8 + 0)
#define                                 PWM6LDS0_bit        _BIT_ACCESS(PWM6LDCON,0)
// PWM6LDCON<PWM6LDS1>
extern volatile __bit                   PWM6LDS1            __at(0x6D79);	// @ (0xDAF * 8 + 1)
#define                                 PWM6LDS1_bit        _BIT_ACCESS(PWM6LDCON,1)
// PWM6CON<PWM6MODE0>
extern volatile __bit                   PWM6MODE0           __at(0x6D5A);	// @ (0xDAB * 8 + 2)
#define                                 PWM6MODE0_bit       _BIT_ACCESS(PWM6CON,2)
// PWM6CON<PWM6MODE1>
extern volatile __bit                   PWM6MODE1           __at(0x6D5B);	// @ (0xDAB * 8 + 3)
#define                                 PWM6MODE1_bit       _BIT_ACCESS(PWM6CON,3)
// PWM6OFH<PWM6OFH0>
extern volatile __bit                   PWM6OFH0            __at(0x6D40);	// @ (0xDA8 * 8 + 0)
#define                                 PWM6OFH0_bit        _BIT_ACCESS(PWM6OFH,0)
// PWM6OFH<PWM6OFH1>
extern volatile __bit                   PWM6OFH1            __at(0x6D41);	// @ (0xDA8 * 8 + 1)
#define                                 PWM6OFH1_bit        _BIT_ACCESS(PWM6OFH,1)
// PWM6OFH<PWM6OFH2>
extern volatile __bit                   PWM6OFH2            __at(0x6D42);	// @ (0xDA8 * 8 + 2)
#define                                 PWM6OFH2_bit        _BIT_ACCESS(PWM6OFH,2)
// PWM6OFH<PWM6OFH3>
extern volatile __bit                   PWM6OFH3            __at(0x6D43);	// @ (0xDA8 * 8 + 3)
#define                                 PWM6OFH3_bit        _BIT_ACCESS(PWM6OFH,3)
// PWM6OFH<PWM6OFH4>
extern volatile __bit                   PWM6OFH4            __at(0x6D44);	// @ (0xDA8 * 8 + 4)
#define                                 PWM6OFH4_bit        _BIT_ACCESS(PWM6OFH,4)
// PWM6OFH<PWM6OFH5>
extern volatile __bit                   PWM6OFH5            __at(0x6D45);	// @ (0xDA8 * 8 + 5)
#define                                 PWM6OFH5_bit        _BIT_ACCESS(PWM6OFH,5)
// PWM6OFH<PWM6OFH6>
extern volatile __bit                   PWM6OFH6            __at(0x6D46);	// @ (0xDA8 * 8 + 6)
#define                                 PWM6OFH6_bit        _BIT_ACCESS(PWM6OFH,6)
// PWM6OFH<PWM6OFH7>
extern volatile __bit                   PWM6OFH7            __at(0x6D47);	// @ (0xDA8 * 8 + 7)
#define                                 PWM6OFH7_bit        _BIT_ACCESS(PWM6OFH,7)
// PWM6INTE<PWM6OFIE>
extern volatile __bit                   PWM6OFIE            __at(0x6D63);	// @ (0xDAC * 8 + 3)
#define                                 PWM6OFIE_bit        _BIT_ACCESS(PWM6INTE,3)
// PWM6INTF<PWM6OFIF>
extern volatile __bit                   PWM6OFIF            __at(0x6D6B);	// @ (0xDAD * 8 + 3)
#define                                 PWM6OFIF_bit        _BIT_ACCESS(PWM6INTF,3)
// PWM6OFL<PWM6OFL0>
extern volatile __bit                   PWM6OFL0            __at(0x6D38);	// @ (0xDA7 * 8 + 0)
#define                                 PWM6OFL0_bit        _BIT_ACCESS(PWM6OFL,0)
// PWM6OFL<PWM6OFL1>
extern volatile __bit                   PWM6OFL1            __at(0x6D39);	// @ (0xDA7 * 8 + 1)
#define                                 PWM6OFL1_bit        _BIT_ACCESS(PWM6OFL,1)
// PWM6OFL<PWM6OFL2>
extern volatile __bit                   PWM6OFL2            __at(0x6D3A);	// @ (0xDA7 * 8 + 2)
#define                                 PWM6OFL2_bit        _BIT_ACCESS(PWM6OFL,2)
// PWM6OFL<PWM6OFL3>
extern volatile __bit                   PWM6OFL3            __at(0x6D3B);	// @ (0xDA7 * 8 + 3)
#define                                 PWM6OFL3_bit        _BIT_ACCESS(PWM6OFL,3)
// PWM6OFL<PWM6OFL4>
extern volatile __bit                   PWM6OFL4            __at(0x6D3C);	// @ (0xDA7 * 8 + 4)
#define                                 PWM6OFL4_bit        _BIT_ACCESS(PWM6OFL,4)
// PWM6OFL<PWM6OFL5>
extern volatile __bit                   PWM6OFL5            __at(0x6D3D);	// @ (0xDA7 * 8 + 5)
#define                                 PWM6OFL5_bit        _BIT_ACCESS(PWM6OFL,5)
// PWM6OFL<PWM6OFL6>
extern volatile __bit                   PWM6OFL6            __at(0x6D3E);	// @ (0xDA7 * 8 + 6)
#define                                 PWM6OFL6_bit        _BIT_ACCESS(PWM6OFL,6)
// PWM6OFL<PWM6OFL7>
extern volatile __bit                   PWM6OFL7            __at(0x6D3F);	// @ (0xDA7 * 8 + 7)
#define                                 PWM6OFL7_bit        _BIT_ACCESS(PWM6OFL,7)
// PWM6OFCON<PWM6OFM0>
extern volatile __bit                   PWM6OFM0            __at(0x6D85);	// @ (0xDB0 * 8 + 5)
#define                                 PWM6OFM0_bit        _BIT_ACCESS(PWM6OFCON,5)
// PWM6OFCON<PWM6OFM1>
extern volatile __bit                   PWM6OFM1            __at(0x6D86);	// @ (0xDB0 * 8 + 6)
#define                                 PWM6OFM1_bit        _BIT_ACCESS(PWM6OFCON,6)
// PWM6OFCON<PWM6OFMC>
extern volatile __bit                   PWM6OFMC            __at(0x6D84);	// @ (0xDB0 * 8 + 4)
#define                                 PWM6OFMC_bit        _BIT_ACCESS(PWM6OFCON,4)
// PWM6OFCON<PWM6OFS0>
extern volatile __bit                   PWM6OFS0            __at(0x6D80);	// @ (0xDB0 * 8 + 0)
#define                                 PWM6OFS0_bit        _BIT_ACCESS(PWM6OFCON,0)
// PWM6OFCON<PWM6OFS1>
extern volatile __bit                   PWM6OFS1            __at(0x6D81);	// @ (0xDB0 * 8 + 1)
#define                                 PWM6OFS1_bit        _BIT_ACCESS(PWM6OFCON,1)
// PWM6CON<PWM6OUT>
